#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]
#![allow(dead_code)]
/* automatically generated by rust-bindgen 0.72.1 */

pub const TRUE: i32 = 1;
pub const FALSE: i32 = 0;
pub const IMAQDX_MAX_API_STRING_LENGTH: i32 = 512;
pub const IMAQDX_TIMEOUT_INFINITE: i32 = -1;
pub const IMAQDX_TIMEOUT_USE_DRIVER_SETTING: i32 = -2;
pub const IMAQdxAttributeBaseAddress: &[u8; 31] = b"CameraInformation::BaseAddress\0";
pub const IMAQdxAttributeBusType: &[u8; 27] = b"CameraInformation::BusType\0";
pub const IMAQdxAttributeModelName: &[u8; 29] = b"CameraInformation::ModelName\0";
pub const IMAQdxAttributeSerialNumberHigh: &[u8; 36] = b"CameraInformation::SerialNumberHigh\0";
pub const IMAQdxAttributeSerialNumberLow: &[u8; 35] = b"CameraInformation::SerialNumberLow\0";
pub const IMAQdxAttributeVendorName: &[u8; 30] = b"CameraInformation::VendorName\0";
pub const IMAQdxAttributeHostIPAddress: &[u8; 33] = b"CameraInformation::HostIPAddress\0";
pub const IMAQdxAttributeIPAddress: &[u8; 29] = b"CameraInformation::IPAddress\0";
pub const IMAQdxAttributePrimaryURLString: &[u8; 36] = b"CameraInformation::PrimaryURLString\0";
pub const IMAQdxAttributeSecondaryURLString: &[u8; 38] = b"CameraInformation::SecondaryURLString\0";
pub const IMAQdxAttributeAcqInProgress: &[u8; 33] = b"StatusInformation::AcqInProgress\0";
pub const IMAQdxAttributeLastBufferCount: &[u8; 35] = b"StatusInformation::LastBufferCount\0";

pub type IMAQdxAttributeVisibility_enum = ::std::os::raw::c_int;
pub use self::IMAQdxAttributeVisibility_enum as IMAQdxAttributeVisibility;
pub const IMAQdxStreamChannelMode_enum_IMAQdxStreamChannelModeAutomatic:
	IMAQdxStreamChannelMode_enum = 0;
pub const IMAQdxStreamChannelMode_enum_IMAQdxStreamChannelModeManual: IMAQdxStreamChannelMode_enum =
	1;
pub const IMAQdxStreamChannelMode_enum_IMAQdxStreamChannelModeGuard: IMAQdxStreamChannelMode_enum =
	-1;
pub type IMAQdxStreamChannelMode_enum = ::std::os::raw::c_int;
pub use self::IMAQdxStreamChannelMode_enum as IMAQdxStreamChannelMode;
pub const IMAQdxPixelSignedness_enum_IMAQdxPixelSignednessUnsigned: IMAQdxPixelSignedness_enum = 0;
pub const IMAQdxPixelSignedness_enum_IMAQdxPixelSignednessSigned: IMAQdxPixelSignedness_enum = 1;
pub const IMAQdxPixelSignedness_enum_IMAQdxPixelSignednessHardware: IMAQdxPixelSignedness_enum = 2;
pub const IMAQdxPixelSignedness_enum_IMAQdxPixelSignednessGuard: IMAQdxPixelSignedness_enum = -1;
pub type IMAQdxPixelSignedness_enum = ::std::os::raw::c_int;
pub use self::IMAQdxPixelSignedness_enum as IMAQdxPixelSignedness;
pub const IMAQdxUSBConnectionSpeed_enum_IMAQdxUSBConnectionSpeedLow: IMAQdxUSBConnectionSpeed_enum =
	1;
pub const IMAQdxUSBConnectionSpeed_enum_IMAQdxUSBConnectionSpeedFull:
	IMAQdxUSBConnectionSpeed_enum = 2;
pub const IMAQdxUSBConnectionSpeed_enum_IMAQdxUSBConnectionSpeedHigh:
	IMAQdxUSBConnectionSpeed_enum = 4;
pub const IMAQdxUSBConnectionSpeed_enum_IMAQdxUSBConnectionSpeedSuper:
	IMAQdxUSBConnectionSpeed_enum = 8;
pub const IMAQdxUSBConnectionSpeed_enum_IMAQdxUSBConnectionSpeedGuard:
	IMAQdxUSBConnectionSpeed_enum = -1;
pub type IMAQdxUSBConnectionSpeed_enum = ::std::os::raw::c_int;
pub use self::IMAQdxUSBConnectionSpeed_enum as IMAQdxUSBConnectionSpeed;
pub const IMAQdxDefaultPersistenceAlgorithm_enum_IMAQdxPersistenceAlgorithmAuto:
	IMAQdxDefaultPersistenceAlgorithm_enum = 0;
pub const IMAQdxDefaultPersistenceAlgorithm_enum_IMAQdxPersistenceAlgorithmIMAQdx:
	IMAQdxDefaultPersistenceAlgorithm_enum = 1;
pub const IMAQdxDefaultPersistenceAlgorithm_enum_IMAQdxPersistenceAlgorithmGenICam:
	IMAQdxDefaultPersistenceAlgorithm_enum = 2;
pub const IMAQdxDefaultPersistenceAlgorithm_enum_IMAQdxPersistenceAlgorithmGuard:
	IMAQdxDefaultPersistenceAlgorithm_enum = -1;
pub type IMAQdxDefaultPersistenceAlgorithm_enum = ::std::os::raw::c_int;
pub use self::IMAQdxDefaultPersistenceAlgorithm_enum as IMAQdxDefaultPersistenceAlgorithm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMAQdxCameraInformation_struct {
	pub Type: uInt32,
	pub Version: uInt32,
	pub Flags: uInt32,
	pub SerialNumberHi: uInt32,
	pub SerialNumberLo: uInt32,
	pub BusType: IMAQdxBusType,
	pub InterfaceName: [::std::os::raw::c_char; 512usize],
	pub VendorName: [::std::os::raw::c_char; 512usize],
	pub ModelName: [::std::os::raw::c_char; 512usize],
	pub CameraFileName: [::std::os::raw::c_char; 512usize],
	pub CameraAttributeURL: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of IMAQdxCameraInformation_struct"]
		[::std::mem::size_of::<IMAQdxCameraInformation_struct>() - 2584usize];
	["Alignment of IMAQdxCameraInformation_struct"]
		[::std::mem::align_of::<IMAQdxCameraInformation_struct>() - 4usize];
	["Offset of field: IMAQdxCameraInformation_struct::Type"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, Type) - 0usize];
	["Offset of field: IMAQdxCameraInformation_struct::Version"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, Version) - 4usize];
	["Offset of field: IMAQdxCameraInformation_struct::Flags"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, Flags) - 8usize];
	["Offset of field: IMAQdxCameraInformation_struct::SerialNumberHi"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, SerialNumberHi) - 12usize];
	["Offset of field: IMAQdxCameraInformation_struct::SerialNumberLo"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, SerialNumberLo) - 16usize];
	["Offset of field: IMAQdxCameraInformation_struct::BusType"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, BusType) - 20usize];
	["Offset of field: IMAQdxCameraInformation_struct::InterfaceName"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, InterfaceName) - 24usize];
	["Offset of field: IMAQdxCameraInformation_struct::VendorName"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, VendorName) - 536usize];
	["Offset of field: IMAQdxCameraInformation_struct::ModelName"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, ModelName) - 1048usize];
	["Offset of field: IMAQdxCameraInformation_struct::CameraFileName"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, CameraFileName) - 1560usize];
	["Offset of field: IMAQdxCameraInformation_struct::CameraAttributeURL"]
		[::std::mem::offset_of!(IMAQdxCameraInformation_struct, CameraAttributeURL) - 2072usize];
};
pub type IMAQdxCameraInformation = IMAQdxCameraInformation_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMAQdxCameraFile_struct {
	pub Type: uInt32,
	pub Version: uInt32,
	pub FileName: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of IMAQdxCameraFile_struct"]
		[::std::mem::size_of::<IMAQdxCameraFile_struct>() - 520usize];
	["Alignment of IMAQdxCameraFile_struct"]
		[::std::mem::align_of::<IMAQdxCameraFile_struct>() - 4usize];
	["Offset of field: IMAQdxCameraFile_struct::Type"]
		[::std::mem::offset_of!(IMAQdxCameraFile_struct, Type) - 0usize];
	["Offset of field: IMAQdxCameraFile_struct::Version"]
		[::std::mem::offset_of!(IMAQdxCameraFile_struct, Version) - 4usize];
	["Offset of field: IMAQdxCameraFile_struct::FileName"]
		[::std::mem::offset_of!(IMAQdxCameraFile_struct, FileName) - 8usize];
};
pub type IMAQdxCameraFile = IMAQdxCameraFile_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMAQdxAttributeInformation_struct {
	pub Type: IMAQdxAttributeType,
	pub Readable: bool32,
	pub Writable: bool32,
	pub Name: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of IMAQdxAttributeInformation_struct"]
		[::std::mem::size_of::<IMAQdxAttributeInformation_struct>() - 524usize];
	["Alignment of IMAQdxAttributeInformation_struct"]
		[::std::mem::align_of::<IMAQdxAttributeInformation_struct>() - 4usize];
	["Offset of field: IMAQdxAttributeInformation_struct::Type"]
		[::std::mem::offset_of!(IMAQdxAttributeInformation_struct, Type) - 0usize];
	["Offset of field: IMAQdxAttributeInformation_struct::Readable"]
		[::std::mem::offset_of!(IMAQdxAttributeInformation_struct, Readable) - 4usize];
	["Offset of field: IMAQdxAttributeInformation_struct::Writable"]
		[::std::mem::offset_of!(IMAQdxAttributeInformation_struct, Writable) - 8usize];
	["Offset of field: IMAQdxAttributeInformation_struct::Name"]
		[::std::mem::offset_of!(IMAQdxAttributeInformation_struct, Name) - 12usize];
};
pub type IMAQdxAttributeInformation = IMAQdxAttributeInformation_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMAQdxEnumItem_struct {
	pub Value: uInt32,
	pub Reserved: uInt32,
	pub Name: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of IMAQdxEnumItem_struct"][::std::mem::size_of::<IMAQdxEnumItem_struct>() - 520usize];
	["Alignment of IMAQdxEnumItem_struct"]
		[::std::mem::align_of::<IMAQdxEnumItem_struct>() - 4usize];
	["Offset of field: IMAQdxEnumItem_struct::Value"]
		[::std::mem::offset_of!(IMAQdxEnumItem_struct, Value) - 0usize];
	["Offset of field: IMAQdxEnumItem_struct::Reserved"]
		[::std::mem::offset_of!(IMAQdxEnumItem_struct, Reserved) - 4usize];
	["Offset of field: IMAQdxEnumItem_struct::Name"]
		[::std::mem::offset_of!(IMAQdxEnumItem_struct, Name) - 8usize];
};
pub type IMAQdxEnumItem = IMAQdxEnumItem_struct;
pub type IMAQdxVideoMode = IMAQdxEnumItem;
pub const IMAQdxIOSignalType_enum_IMAQdxIOSignalTypeTTL: IMAQdxIOSignalType_enum = 0;
pub const IMAQdxIOSignalType_enum_IMAQdxIOSignalTypeRTSI: IMAQdxIOSignalType_enum = 1;
pub const IMAQdxIOSignalType_enum_IMAQdxIOSignalTypeIsoIn: IMAQdxIOSignalType_enum = 2;
pub const IMAQdxIOSignalType_enum_IMAQdxIOSignalTypeIsoOut: IMAQdxIOSignalType_enum = 3;
pub const IMAQdxIOSignalType_enum_IMAQdxIOSignalTypeGuard: IMAQdxIOSignalType_enum = -1;
pub type IMAQdxIOSignalType_enum = ::std::os::raw::c_int;
pub use self::IMAQdxIOSignalType_enum as IMAQdxIOSignalType;
pub const IMAQdxEdge_enum_IMAQdxEdgeRising: IMAQdxEdge_enum = 0;
pub const IMAQdxEdge_enum_IMAQdxEdgeFalling: IMAQdxEdge_enum = 1;
pub const IMAQdxEdge_enum_IMAQdxEdgeGuard: IMAQdxEdge_enum = -1;
