#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]
#![allow(dead_code)]
/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
	storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
	#[inline]
	pub const fn new(storage: Storage) -> Self {
		Self { storage }
	}
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
	Storage: AsRef<[u8]> + AsMut<[u8]>,
{
	#[inline]
	fn extract_bit(byte: u8, index: usize) -> bool {
		let bit_index = if cfg!(target_endian = "big") { 7 - (index % 8) } else { index % 8 };
		let mask = 1 << bit_index;
		byte & mask == mask
	}
	#[inline]
	pub fn get_bit(&self, index: usize) -> bool {
		debug_assert!(index / 8 < self.storage.as_ref().len());
		let byte_index = index / 8;
		let byte = self.storage.as_ref()[byte_index];
		Self::extract_bit(byte, index)
	}
	#[inline]
	pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
		debug_assert!(index / 8 < core::mem::size_of::<Storage>());
		let byte_index = index / 8;
		let byte = unsafe {
			*(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
		};
		Self::extract_bit(byte, index)
	}
	#[inline]
	fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
		let bit_index = if cfg!(target_endian = "big") { 7 - (index % 8) } else { index % 8 };
		let mask = 1 << bit_index;

pub const DLL_PROCESS_DETACH: i32 = 0;
pub const THREAD_BASE_PRIORITY_LOWRT: i32 = 15;
pub const THREAD_BASE_PRIORITY_MAX: i32 = 2;
pub const THREAD_BASE_PRIORITY_MIN: i32 = -2;
pub const THREAD_BASE_PRIORITY_IDLE: i32 = -15;
pub const THREAD_PRIORITY_TIME_CRITICAL: i32 = 15;
pub const THREAD_PRIORITY_HIGHEST: i32 = 2;
pub const THREAD_PRIORITY_ABOVE_NORMAL: i32 = 1;
pub const THREAD_PRIORITY_NORMAL: i32 = 0;
pub const THREAD_PRIORITY_LOWEST: i32 = -2;
pub const THREAD_PRIORITY_IDLE: i32 = -15;
pub const _CVI_LIBS_: i32 = 2000;
pub const _CVI_PROFILE_LEVEL_DISABLED_: i32 = 0;
pub const _CVI_PROFILE_LEVEL_FUNCS_: i32 = 1;
pub const _CVI_PROFILE_LEVEL_FUNCS_AND_CALLS_: i32 = 2;
pub const ATTR_IMAGECTRL_SHOW_SCROLLBARS: i32 = 1;
pub const ATTR_IMAGECTRL_CONTEXT_SENSITIVE_TOOLS: i32 = 2;
pub const ATTR_IMAGECTRL_CURRENT_TOOL: i32 = 3;
pub const ATTR_IMAGECTRL_DISPLAY_WINDOW: i32 = 4;
pub const ATTR_IMAGECTRL_SHOW_INFOTEXT: i32 = 5;
pub const ATTR_IMAGECTRL_TOOL_COLOR: i32 = 6;
pub const ATTR_IMAGECTRL_FILL_STYLE: i32 = 7;
pub const ATTR_IMAGECTRL_HATCH_STYLE: i32 = 8;
pub const ATTR_IMAGECTRL_FILL_COLOR: i32 = 9;
pub const ATTR_IMAGECTRL_BACKGROUND_COLOR: i32 = 10;
pub const ATTR_IMAGECTRL_DISPLAY_MAPPING: i32 = 11;
pub const ATTR_IMAGECTRL_MAX_CONTOUR_COUNT: i32 = 12;
pub const ATTR_IMAGECTRL_IMAGE: i32 = 13;
pub const ATTR_IMAGECTRL_HEIGHT: i32 = 14;
pub const ATTR_IMAGECTRL_WIDTH: i32 = 15;
pub const ATTR_IMAGECTRL_TOP: i32 = 16;
pub const ATTR_IMAGECTRL_LEFT: i32 = 17;
pub const ATTR_IMAGECTRL_VISIBLE: i32 = 18;
pub const ATTR_IMAGECTRL_WINDOW_ROI: i32 = 19;
pub const EVENT_IMAGECTRL_MOUSEMOVE: i32 = 33;
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
	pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
	pub fn __security_init_cookie();
}
unsafe extern "C" {
	pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
	pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
	pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
unsafe extern "C" {
	pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
	pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
	pub fn _invoke_watson(
		_Expression: *const wchar_t,
		_FunctionName: *const wchar_t,
		_FileName: *const wchar_t,
		_LineNo: ::std::os::raw::c_uint,
		_Reserved: usize,
	) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
	pub _locale_pctype: *const ::std::os::raw::c_ushort,
	pub _locale_mb_cur_max: ::std::os::raw::c_int,
	pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of __crt_locale_data_public"]
		[::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
	["Alignment of __crt_locale_data_public"]
		[::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
	["Offset of field: __crt_locale_data_public::_locale_pctype"]
		[::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
	["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
		[::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
	["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
		[::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
	pub locinfo: *mut __crt_locale_data,
	pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
	["Alignment of __crt_locale_pointers"]
		[::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
	["Offset of field: __crt_locale_pointers::locinfo"]
		[::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
	["Offset of field: __crt_locale_pointers::mbcinfo"]
		[::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
	pub _Wchar: ::std::os::raw::c_ulong,
	pub _Byte: ::std::os::raw::c_ushort,
	pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
	["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
	["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
	["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
	["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
	pub fn _errno() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
	pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
	pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
	pub fn __threadid() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
	pub fn __threadhandle() -> usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub const Plane3D_enum_IMAQ_3D_REAL: Plane3D_enum = 0;
pub const Plane3D_enum_IMAQ_3D_IMAGINARY: Plane3D_enum = 1;
pub const Plane3D_enum_IMAQ_3D_MAGNITUDE: Plane3D_enum = 2;
pub const Plane3D_enum_IMAQ_3D_PHASE: Plane3D_enum = 3;
pub const Plane3D_enum_IMAQ_PLANE_3D_SIZE_GUARD: Plane3D_enum = -1;
pub type Plane3D_enum = ::std::os::raw::c_int;
pub use self::Plane3D_enum as Plane3D;
pub const MeasurementValue_enum_IMAQ_AREA: MeasurementValue_enum = 0;
pub const MeasurementValue_enum_IMAQ_AREA_CALIBRATED: MeasurementValue_enum = 1;
pub const MeasurementValue_enum_IMAQ_NUM_HOLES: MeasurementValue_enum = 2;
pub const MeasurementValue_enum_IMAQ_AREA_OF_HOLES: MeasurementValue_enum = 3;
pub const MeasurementValue_enum_IMAQ_TOTAL_AREA: MeasurementValue_enum = 4;
pub const MeasurementValue_enum_IMAQ_IMAGE_AREA: MeasurementValue_enum = 5;
pub const MeasurementValue_enum_IMAQ_PARTICLE_TO_IMAGE: MeasurementValue_enum = 6;
pub const MeasurementValue_enum_IMAQ_PARTICLE_TO_TOTAL: MeasurementValue_enum = 7;
pub const MeasurementValue_enum_IMAQ_CENTER_MASS_X: MeasurementValue_enum = 8;
pub const MeasurementValue_enum_IMAQ_CENTER_MASS_Y: MeasurementValue_enum = 9;
pub const MeasurementValue_enum_IMAQ_LEFT_COLUMN: MeasurementValue_enum = 10;
pub const MeasurementValue_enum_IMAQ_TOP_ROW: MeasurementValue_enum = 11;
pub const MeasurementValue_enum_IMAQ_RIGHT_COLUMN: MeasurementValue_enum = 12;
pub const MeasurementValue_enum_IMAQ_BOTTOM_ROW: MeasurementValue_enum = 13;
pub const MeasurementValue_enum_IMAQ_WIDTH: MeasurementValue_enum = 14;
pub const MeasurementValue_enum_IMAQ_HEIGHT: MeasurementValue_enum = 15;
pub const MeasurementValue_enum_IMAQ_MAX_SEGMENT_LENGTH: MeasurementValue_enum = 16;
pub const MeasurementValue_enum_IMAQ_MAX_SEGMENT_LEFT_COLUMN: MeasurementValue_enum = 17;
pub const MeasurementValue_enum_IMAQ_MAX_SEGMENT_TOP_ROW: MeasurementValue_enum = 18;
pub const MeasurementValue_enum_IMAQ_PERIMETER: MeasurementValue_enum = 19;
pub const MeasurementValue_enum_IMAQ_PERIMETER_OF_HOLES: MeasurementValue_enum = 20;
pub const MeasurementValue_enum_IMAQ_SIGMA_X: MeasurementValue_enum = 21;
pub const MeasurementValue_enum_IMAQ_SIGMA_Y: MeasurementValue_enum = 22;
pub const MeasurementValue_enum_IMAQ_SIGMA_XX: MeasurementValue_enum = 23;
pub const MeasurementValue_enum_IMAQ_SIGMA_YY: MeasurementValue_enum = 24;
pub const MeasurementValue_enum_IMAQ_SIGMA_XY: MeasurementValue_enum = 25;
pub const MeasurementValue_enum_IMAQ_PROJ_X: MeasurementValue_enum = 26;
pub const MeasurementValue_enum_IMAQ_PROJ_Y: MeasurementValue_enum = 27;
pub const MeasurementValue_enum_IMAQ_INERTIA_XX: MeasurementValue_enum = 28;
pub const MeasurementValue_enum_IMAQ_INERTIA_YY: MeasurementValue_enum = 29;
pub const MeasurementValue_enum_IMAQ_INERTIA_XY: MeasurementValue_enum = 30;
pub const MeasurementValue_enum_IMAQ_MEAN_H: MeasurementValue_enum = 31;
pub const MeasurementValue_enum_IMAQ_MEAN_V: MeasurementValue_enum = 32;
pub const MeasurementValue_enum_IMAQ_MAX_INTERCEPT: MeasurementValue_enum = 33;
pub const MeasurementValue_enum_IMAQ_MEAN_INTERCEPT: MeasurementValue_enum = 34;
pub const MeasurementValue_enum_IMAQ_ORIENTATION: MeasurementValue_enum = 35;
pub const MeasurementValue_enum_IMAQ_EQUIV_ELLIPSE_MINOR: MeasurementValue_enum = 36;
pub const MeasurementValue_enum_IMAQ_ELLIPSE_MAJOR: MeasurementValue_enum = 37;
pub const MeasurementValue_enum_IMAQ_ELLIPSE_MINOR: MeasurementValue_enum = 38;
pub const MeasurementValue_enum_IMAQ_ELLIPSE_RATIO: MeasurementValue_enum = 39;
pub const MeasurementValue_enum_IMAQ_RECT_LONG_SIDE: MeasurementValue_enum = 40;
pub const MeasurementValue_enum_IMAQ_RECT_SHORT_SIDE: MeasurementValue_enum = 41;
pub const MeasurementValue_enum_IMAQ_RECT_RATIO: MeasurementValue_enum = 42;
pub const MeasurementValue_enum_IMAQ_ELONGATION: MeasurementValue_enum = 43;
pub const MeasurementValue_enum_IMAQ_COMPACTNESS: MeasurementValue_enum = 44;
pub const MeasurementValue_enum_IMAQ_HEYWOOD: MeasurementValue_enum = 45;
pub const MeasurementValue_enum_IMAQ_TYPE_FACTOR: MeasurementValue_enum = 46;
pub const MeasurementValue_enum_IMAQ_HYDRAULIC: MeasurementValue_enum = 47;
pub const MeasurementValue_enum_IMAQ_WADDLE_DISK: MeasurementValue_enum = 48;
pub const MeasurementValue_enum_IMAQ_DIAGONAL: MeasurementValue_enum = 49;
pub const MeasurementValue_enum_IMAQ_MEASUREMENT_VALUE_SIZE_GUARD: MeasurementValue_enum = -1;
pub type MeasurementValue_enum = ::std::os::raw::c_int;
pub use self::MeasurementValue_enum as MeasurementValue;
pub const ScalingMethod_enum_IMAQ_SCALE_TO_PRESERVE_AREA: ScalingMethod_enum = 0;
pub const ScalingMethod_enum_IMAQ_SCALE_TO_FIT: ScalingMethod_enum = 1;
pub const ScalingMethod_enum_IMAQ_SCALING_METHOD_SIZE_GUARD: ScalingMethod_enum = -1;
pub type ScalingMethod_enum = ::std::os::raw::c_int;
pub use self::ScalingMethod_enum as ScalingMethod;
pub const ReferenceMode_enum_IMAQ_COORD_X_Y: ReferenceMode_enum = 0;
pub const ReferenceMode_enum_IMAQ_COORD_ORIGIN_X: ReferenceMode_enum = 1;
pub const ReferenceMode_enum_IMAQ_REFERENCE_MODE_SIZE_GUARD: ReferenceMode_enum = -1;
pub type ReferenceMode_enum = ::std::os::raw::c_int;
pub use self::ReferenceMode_enum as ReferenceMode;
pub const RectOrientation_enum_IMAQ_BASE_INSIDE: RectOrientation_enum = 0;
pub const RectOrientation_enum_IMAQ_BASE_OUTSIDE: RectOrientation_enum = 1;
pub const RectOrientation_enum_IMAQ_TEXT_ORIENTATION_SIZE_GUARD: RectOrientation_enum = -1;
pub type RectOrientation_enum = ::std::os::raw::c_int;
pub use self::RectOrientation_enum as RectOrientation;
pub const RakeDirection_enum_IMAQ_LEFT_TO_RIGHT: RakeDirection_enum = 0;
pub const RakeDirection_enum_IMAQ_RIGHT_TO_LEFT: RakeDirection_enum = 1;
pub const RakeDirection_enum_IMAQ_TOP_TO_BOTTOM: RakeDirection_enum = 2;
pub const RakeDirection_enum_IMAQ_BOTTOM_TO_TOP: RakeDirection_enum = 3;
pub const RakeDirection_enum_IMAQ_RAKE_DIRECTION_SIZE_GUARD: RakeDirection_enum = -1;
pub type RakeDirection_enum = ::std::os::raw::c_int;
pub use self::RakeDirection_enum as RakeDirection;
pub const SearchStrategy_enum_IMAQ_CONSERVATIVE: SearchStrategy_enum = 1;
pub const SearchStrategy_enum_IMAQ_BALANCED: SearchStrategy_enum = 2;
pub const SearchStrategy_enum_IMAQ_AGGRESSIVE: SearchStrategy_enum = 3;
pub const SearchStrategy_enum_IMAQ_VERY_AGGRESSIVE: SearchStrategy_enum = 4;
pub const SearchStrategy_enum_IMAQ_SEARCH_STRATEGY_SIZE_GUARD: SearchStrategy_enum = -1;
pub type SearchStrategy_enum = ::std::os::raw::c_int;
pub use self::SearchStrategy_enum as SearchStrategy;
pub const LearnSetupOption_enum_IMAQ_LDLO_SearchStrategy: LearnSetupOption_enum = 0;
pub const LearnSetupOption_enum_IMAQ_LDLO_InitialStepSize: LearnSetupOption_enum = 1;
pub const LearnSetupOption_enum_IMAQ_LDLO_InitialSampleSize: LearnSetupOption_enum = 2;
pub const LearnSetupOption_enum_IMAQ_LDLO_InitialSampleSizeFactor: LearnSetupOption_enum = 3;
pub const LearnSetupOption_enum_IMAQ_LDLO_InitialAngularAccuracy: LearnSetupOption_enum = 4;
pub const LearnSetupOption_enum_IMAQ_LDLO_FinalSampleSize: LearnSetupOption_enum = 5;
pub const LearnSetupOption_enum_IMAQ_LDLO_FinalSampleSizeFactor: LearnSetupOption_enum = 6;
pub const LearnSetupOption_enum_IMAQ_LDLO_FinalAngularAccuracy: LearnSetupOption_enum = 7;
pub const LearnSetupOption_enum_IMAQ_LDLO_SubpixelSampleSize: LearnSetupOption_enum = 8;
pub const LearnSetupOption_enum_IMAQ_LDLO_SubpixelSampleSizeFactor: LearnSetupOption_enum = 9;
pub const LearnSetupOption_enum_IMAQ_LDLO_MatchOffsetXPosition: LearnSetupOption_enum = 10;
pub const LearnSetupOption_enum_IMAQ_LDLO_MatchOffsetYPosition: LearnSetupOption_enum = 11;
pub const LearnSetupOption_enum_IMAQ_LDLO_MatchOffsetAngle: LearnSetupOption_enum = 12;
pub const LearnSetupOption_enum_IMAQ_PYLO_SubpixelSampleSize: LearnSetupOption_enum = 100;
pub const LearnSetupOption_enum_IMAQ_PYLO_SubpixelSampleSizeFactor: LearnSetupOption_enum = 101;
pub const LearnSetupOption_enum_IMAQ_PYLO_MatchOffsetXPosition: LearnSetupOption_enum = 102;
pub const LearnSetupOption_enum_IMAQ_PYLO_MatchOffsetYPosition: LearnSetupOption_enum = 103;
pub const LearnSetupOption_enum_IMAQ_PYLO_MatchOffsetAngle: LearnSetupOption_enum = 104;
pub const LearnSetupOption_enum_IMAQ_PYLO_MaxPyramidLevelToStoreData: LearnSetupOption_enum = 105;
pub const LearnSetupOption_enum_IMAQ_PYLO_PreProcess: LearnSetupOption_enum = 106;
pub const LearnSetupOption_enum_IMAQ_PYLO_PercentPixelsToKeepForGradientTemplate:
	LearnSetupOption_enum = 107;
pub const LearnSetupOption_enum_IMAQ_COMBINEDLEARNSETUPOPTION_SIZE_GUARD: LearnSetupOption_enum =
	-1;
pub type LearnSetupOption_enum = ::std::os::raw::c_int;
pub use self::LearnSetupOption_enum as LearnSetupOption;
pub const MatchSetupOption_enum_IMAQ_LDMO_MinimumContrast: MatchSetupOption_enum = 0;
pub const MatchSetupOption_enum_IMAQ_LDMO_EnableSubpixelAccuracy: MatchSetupOption_enum = 1;
pub const MatchSetupOption_enum_IMAQ_LDMO_SearchStrategy: MatchSetupOption_enum = 2;
pub const MatchSetupOption_enum_IMAQ_LDMO_SubpixelIterations: MatchSetupOption_enum = 3;
pub const MatchSetupOption_enum_IMAQ_LDMO_SubpixelTolerance: MatchSetupOption_enum = 4;
pub const MatchSetupOption_enum_IMAQ_LDMO_InitialMatchListLength: MatchSetupOption_enum = 5;
pub const MatchSetupOption_enum_IMAQ_LDMO_MatchListReductionFactor: MatchSetupOption_enum = 6;
pub const MatchSetupOption_enum_IMAQ_LDMO_InitialStepSize: MatchSetupOption_enum = 7;
pub const MatchSetupOption_enum_IMAQ_LDMO_IntermediateAngularAccuracy: MatchSetupOption_enum = 8;
pub const MatchSetupOption_enum_IMAQ_PYMO_MaxPyramidLevel: MatchSetupOption_enum = 100;
pub const MatchSetupOption_enum_IMAQ_PYMO_MinimumContrast: MatchSetupOption_enum = 102;
pub const MatchSetupOption_enum_IMAQ_PYMO_EnableSubpixelAccuracy: MatchSetupOption_enum = 103;
pub const MatchSetupOption_enum_IMAQ_PYMO_SubpixelIterations: MatchSetupOption_enum = 104;
pub const MatchSetupOption_enum_IMAQ_PYMO_SubpixelTolerance: MatchSetupOption_enum = 105;
pub const MatchSetupOption_enum_IMAQ_PYMO_InitialMatchListLength: MatchSetupOption_enum = 106;
pub const MatchSetupOption_enum_IMAQ_PYMO_MatchListReductionFactor: MatchSetupOption_enum = 107;
pub const MatchSetupOption_enum_IMAQ_PYMO_IntermediateAngularAccuracy: MatchSetupOption_enum = 108;
pub const MatchSetupOption_enum_IMAQ_PYMO_ProcessBorderMatches: MatchSetupOption_enum = 109;
pub const MatchSetupOption_enum_IMAQ_PYMO_MinMatchSeparationDistance: MatchSetupOption_enum = 111;
pub const MatchSetupOption_enum_IMAQ_PYMO_MinMatchSeparationAngle: MatchSetupOption_enum = 112;
pub const MatchSetupOption_enum_IMAQ_PYMO_MaxMatchOverlap: MatchSetupOption_enum = 113;
pub const MatchSetupOption_enum_IMAQ_PYMO_MaxCacheSizeInMegabytes: MatchSetupOption_enum = 114;
pub const MatchSetupOption_enum_IMAQ_PYMO_ClearCacheOnEveryMatch: MatchSetupOption_enum = 115;
pub const MatchSetupOption_enum_IMAQ_PYMO_EnableAccurateScoreComputatation: MatchSetupOption_enum =
	116;
pub const MatchSetupOption_enum_IMAQ_PYMO_InterpolationForAccurateScoreComputation:
	MatchSetupOption_enum = 117;
pub const MatchSetupOption_enum_IMAQ_PYMO_TargetToTemplateScore: MatchSetupOption_enum = 118;
pub const MatchSetupOption_enum_IMAQ_ALLMO_EnableScoreMap: MatchSetupOption_enum = 200;
pub const MatchSetupOption_enum_IMAQ_COMBINEDMATCHSETUPOPTION_IS_AN_INT: MatchSetupOption_enum = -1;
pub type MatchSetupOption_enum = ::std::os::raw::c_int;
pub use self::MatchSetupOption_enum as MatchSetupOption;
pub const PointSymbol_enum_IMAQ_POINT_AS_PIXEL: PointSymbol_enum = 0;
pub const PointSymbol_enum_IMAQ_POINT_AS_CROSS: PointSymbol_enum = 1;
pub const PointSymbol_enum_IMAQ_POINT_USER_DEFINED: PointSymbol_enum = 2;
pub const PointSymbol_enum_IMAQ_POINT_SYMBOL_SIZE_GUARD: PointSymbol_enum = -1;
pub type PointSymbol_enum = ::std::os::raw::c_int;
pub use self::PointSymbol_enum as PointSymbol;
pub const ShapeMode_enum_IMAQ_SHAPE_RECT: ShapeMode_enum = 1;
pub const ShapeMode_enum_IMAQ_SHAPE_OVAL: ShapeMode_enum = 2;
pub const ShapeMode_enum_IMAQ_SHAPE_MODE_SIZE_GUARD: ShapeMode_enum = -1;
pub type ShapeMode_enum = ::std::os::raw::c_int;
pub use self::ShapeMode_enum as ShapeMode;
pub const PhotometricMode_enum_IMAQ_WHITE_IS_ZERO: PhotometricMode_enum = 0;
pub const PhotometricMode_enum_IMAQ_BLACK_IS_ZERO: PhotometricMode_enum = 1;
pub const PhotometricMode_enum_IMAQ_PHOTOMETRIC_MODE_SIZE_GUARD: PhotometricMode_enum = -1;
pub type PhotometricMode_enum = ::std::os::raw::c_int;
pub use self::PhotometricMode_enum as PhotometricMode;
pub const AttenuateMode_enum_IMAQ_ATTENUATE_LOW: AttenuateMode_enum = 0;
pub const AttenuateMode_enum_IMAQ_ATTENUATE_HIGH: AttenuateMode_enum = 1;
pub const AttenuateMode_enum_IMAQ_ATTENUATE_MODE_SIZE_GUARD: AttenuateMode_enum = -1;
pub type AttenuateMode_enum = ::std::os::raw::c_int;
pub use self::AttenuateMode_enum as AttenuateMode;
pub const PaletteType_enum_IMAQ_PALETTE_GRAY: PaletteType_enum = 0;
pub const PaletteType_enum_IMAQ_PALETTE_BINARY: PaletteType_enum = 1;
pub const PaletteType_enum_IMAQ_PALETTE_GRADIENT: PaletteType_enum = 2;
pub const PaletteType_enum_IMAQ_PALETTE_RAINBOW: PaletteType_enum = 3;
pub const PaletteType_enum_IMAQ_PALETTE_TEMPERATURE: PaletteType_enum = 4;
pub const PaletteType_enum_IMAQ_PALETTE_USER: PaletteType_enum = 5;
pub const PaletteType_enum_IMAQ_PALETTE_TYPE_SIZE_GUARD: PaletteType_enum = -1;
pub type PaletteType_enum = ::std::os::raw::c_int;
pub use self::PaletteType_enum as PaletteType;
pub const ObjectType_enum_IMAQ_BRIGHT_OBJECTS: ObjectType_enum = 0;
pub const ObjectType_enum_IMAQ_DARK_OBJECTS: ObjectType_enum = 1;
pub const ObjectType_enum_IMAQ_OBJECT_TYPE_SIZE_GUARD: ObjectType_enum = -1;
pub type ObjectType_enum = ::std::os::raw::c_int;
pub use self::ObjectType_enum as ObjectType;
pub const MorphologyMethod_enum_IMAQ_AUTOM: MorphologyMethod_enum = 0;
pub const MorphologyMethod_enum_IMAQ_CLOSE: MorphologyMethod_enum = 1;
pub const MorphologyMethod_enum_IMAQ_DILATE: MorphologyMethod_enum = 2;
pub const MorphologyMethod_enum_IMAQ_ERODE: MorphologyMethod_enum = 3;
pub const MorphologyMethod_enum_IMAQ_GRADIENT: MorphologyMethod_enum = 4;
pub const MorphologyMethod_enum_IMAQ_GRADIENTOUT: MorphologyMethod_enum = 5;
pub const MorphologyMethod_enum_IMAQ_GRADIENTIN: MorphologyMethod_enum = 6;
pub const MorphologyMethod_enum_IMAQ_HITMISS: MorphologyMethod_enum = 7;
pub const MorphologyMethod_enum_IMAQ_OPEN: MorphologyMethod_enum = 8;
pub const MorphologyMethod_enum_IMAQ_PCLOSE: MorphologyMethod_enum = 9;
pub const MorphologyMethod_enum_IMAQ_POPEN: MorphologyMethod_enum = 10;
pub const MorphologyMethod_enum_IMAQ_THICK: MorphologyMethod_enum = 11;
pub const MorphologyMethod_enum_IMAQ_THIN: MorphologyMethod_enum = 12;
pub const MorphologyMethod_enum_IMAQ_MORPHOLOGY_METHOD_SIZE_GUARD: MorphologyMethod_enum = -1;
pub type MorphologyMethod_enum = ::std::os::raw::c_int;
pub use self::MorphologyMethod_enum as MorphologyMethod;
pub const MeterArcMode_enum_IMAQ_METER_ARC_ROI: MeterArcMode_enum = 0;
pub const MeterArcMode_enum_IMAQ_METER_ARC_POINTS: MeterArcMode_enum = 1;
pub const MeterArcMode_enum_IMAQ_METER_ARC_MODE_SIZE_GUARD: MeterArcMode_enum = -1;
pub type MeterArcMode_enum = ::std::os::raw::c_int;
pub use self::MeterArcMode_enum as MeterArcMode;
pub const PolarityType_enum_IMAQ_EDGE_FALLING: PolarityType_enum = -1;
pub const PolarityType_enum_IMAQ_EDGE_RISING: PolarityType_enum = 1;
pub const PolarityType_enum_IMAQ_POLARITY_TYPE_SIZE_GUARD: PolarityType_enum = 2147483647;
pub type PolarityType_enum = ::std::os::raw::c_int;
pub use self::PolarityType_enum as PolarityType;
pub const Tool_enum_IMAQ_NO_TOOL: Tool_enum = -1;
pub const Tool_enum_IMAQ_SELECTION_TOOL: Tool_enum = 0;
pub const Tool_enum_IMAQ_POINT_TOOL: Tool_enum = 1;
pub const Tool_enum_IMAQ_LINE_TOOL: Tool_enum = 2;
pub const Tool_enum_IMAQ_RECTANGLE_TOOL: Tool_enum = 3;
pub const Tool_enum_IMAQ_OVAL_TOOL: Tool_enum = 4;
pub const Tool_enum_IMAQ_POLYGON_TOOL: Tool_enum = 5;
pub const Tool_enum_IMAQ_CLOSED_FREEHAND_TOOL: Tool_enum = 6;
pub const Tool_enum_IMAQ_ANNULUS_TOOL: Tool_enum = 7;
pub const Tool_enum_IMAQ_ZOOM_TOOL: Tool_enum = 8;
pub const Tool_enum_IMAQ_PAN_TOOL: Tool_enum = 9;
pub const Tool_enum_IMAQ_POLYLINE_TOOL: Tool_enum = 10;
pub const Tool_enum_IMAQ_FREEHAND_TOOL: Tool_enum = 11;
pub const Tool_enum_IMAQ_ROTATED_RECT_TOOL: Tool_enum = 12;
pub const Tool_enum_IMAQ_ZOOM_OUT_TOOL: Tool_enum = 13;
pub const Tool_enum_IMAQ_TOOL_SIZE_GUARD: Tool_enum = 2147483647;
pub type Tool_enum = ::std::os::raw::c_int;
pub use self::Tool_enum as Tool;
pub const WindowThreadPolicy_enum_IMAQ_CALLING_THREAD: WindowThreadPolicy_enum = 0;
pub const WindowThreadPolicy_enum_IMAQ_SEPARATE_THREAD: WindowThreadPolicy_enum = 1;
pub const WindowThreadPolicy_enum_IMAQ_WINDOW_THREAD_POLICY_SIZE_GUARD: WindowThreadPolicy_enum =
	-1;
pub type WindowThreadPolicy_enum = ::std::os::raw::c_int;
pub use self::WindowThreadPolicy_enum as WindowThreadPolicy;
pub const WindowOptions_enum_IMAQ_WIND_RESIZABLE: WindowOptions_enum = 1;
pub const WindowOptions_enum_IMAQ_WIND_TITLEBAR: WindowOptions_enum = 2;
pub const WindowOptions_enum_IMAQ_WIND_CLOSEABLE: WindowOptions_enum = 4;
pub const WindowOptions_enum_IMAQ_WIND_TOPMOST: WindowOptions_enum = 8;
pub const WindowOptions_enum_IMAQ_WINDOW_OPTIONS_SIZE_GUARD: WindowOptions_enum = -1;
pub type WindowOptions_enum = ::std::os::raw::c_int;
pub use self::WindowOptions_enum as WindowOptions;
pub const WindowEventType_enum_IMAQ_NO_EVENT: WindowEventType_enum = 0;
pub const WindowEventType_enum_IMAQ_CLICK_EVENT: WindowEventType_enum = 1;
pub const WindowEventType_enum_IMAQ_DRAW_EVENT: WindowEventType_enum = 2;
pub const WindowEventType_enum_IMAQ_MOVE_EVENT: WindowEventType_enum = 3;
pub const WindowEventType_enum_IMAQ_SIZE_EVENT: WindowEventType_enum = 4;
pub const WindowEventType_enum_IMAQ_SCROLL_EVENT: WindowEventType_enum = 5;
pub const WindowEventType_enum_IMAQ_ACTIVATE_EVENT: WindowEventType_enum = 6;
pub const WindowEventType_enum_IMAQ_CLOSE_EVENT: WindowEventType_enum = 7;
pub const WindowEventType_enum_IMAQ_DOUBLE_CLICK_EVENT: WindowEventType_enum = 8;
pub const WindowEventType_enum_IMAQ_WINDOW_EVENT_TYPE_SIZE_GUARD: WindowEventType_enum = -1;
pub type WindowEventType_enum = ::std::os::raw::c_int;
pub use self::WindowEventType_enum as WindowEventType;
pub const VisionInfoType_enum_IMAQ_ANY_VISION_INFO: VisionInfoType_enum = 0;
pub const VisionInfoType_enum_IMAQ_PATTERN_MATCHING_INFO: VisionInfoType_enum = 1;
pub const VisionInfoType_enum_IMAQ_CALIBRATION_INFO: VisionInfoType_enum = 2;
pub const VisionInfoType_enum_IMAQ_OVERLAY_INFO: VisionInfoType_enum = 3;
pub const VisionInfoType_enum_IMAQ_VISION_INFO_TYPE_SIZE_GUARD: VisionInfoType_enum = -1;
pub type VisionInfoType_enum = ::std::os::raw::c_int;
pub use self::VisionInfoType_enum as VisionInfoType;
pub const VerticalTextAlignment_enum_IMAQ_BOTTOM: VerticalTextAlignment_enum = 0;
pub const VerticalTextAlignment_enum_IMAQ_TOP: VerticalTextAlignment_enum = 1;
pub const VerticalTextAlignment_enum_IMAQ_BASELINE: VerticalTextAlignment_enum = 2;
pub const VerticalTextAlignment_enum_IMAQ_VERTICAL_TEXT_ALIGNMENT_SIZE_GUARD:
	VerticalTextAlignment_enum = -1;
pub type VerticalTextAlignment_enum = ::std::os::raw::c_int;
pub use self::VerticalTextAlignment_enum as VerticalTextAlignment;
pub const ScalingMode_enum_IMAQ_SCALE_LARGER: ScalingMode_enum = 0;
pub const ScalingMode_enum_IMAQ_SCALE_SMALLER: ScalingMode_enum = 1;
pub const ScalingMode_enum_IMAQ_SCALING_MODE_SIZE_GUARD: ScalingMode_enum = -1;
pub type ScalingMode_enum = ::std::os::raw::c_int;
pub use self::ScalingMode_enum as ScalingMode;
pub const TruncateMode_enum_IMAQ_TRUNCATE_LOW: TruncateMode_enum = 0;
pub const TruncateMode_enum_IMAQ_TRUNCATE_HIGH: TruncateMode_enum = 1;
pub const TruncateMode_enum_IMAQ_TRUNCATE_MODE_SIZE_GUARD: TruncateMode_enum = -1;
pub type TruncateMode_enum = ::std::os::raw::c_int;
pub use self::TruncateMode_enum as TruncateMode;
pub const OutlineMethod_enum_IMAQ_EDGE_DIFFERENCE: OutlineMethod_enum = 0;
pub const OutlineMethod_enum_IMAQ_EDGE_GRADIENT: OutlineMethod_enum = 1;
pub const OutlineMethod_enum_IMAQ_EDGE_PREWITT: OutlineMethod_enum = 2;
pub const OutlineMethod_enum_IMAQ_EDGE_ROBERTS: OutlineMethod_enum = 3;
pub const OutlineMethod_enum_IMAQ_EDGE_SIGMA: OutlineMethod_enum = 4;
pub const OutlineMethod_enum_IMAQ_EDGE_SOBEL: OutlineMethod_enum = 5;
pub const OutlineMethod_enum_IMAQ_OUTLINE_METHOD_SIZE_GUARD: OutlineMethod_enum = -1;
pub type OutlineMethod_enum = ::std::os::raw::c_int;
pub use self::OutlineMethod_enum as OutlineMethod;
pub const TIFFCompressionType_enum_IMAQ_NO_COMPRESSION: TIFFCompressionType_enum = 0;
pub const TIFFCompressionType_enum_IMAQ_JPEG: TIFFCompressionType_enum = 1;
pub const TIFFCompressionType_enum_IMAQ_RUN_LENGTH: TIFFCompressionType_enum = 2;
pub const TIFFCompressionType_enum_IMAQ_ZIP: TIFFCompressionType_enum = 3;
pub const TIFFCompressionType_enum_IMAQ_TIFF_COMPRESSION_TYPE_SIZE_GUARD: TIFFCompressionType_enum =
	-1;
pub type TIFFCompressionType_enum = ::std::os::raw::c_int;
pub use self::TIFFCompressionType_enum as TIFFCompressionType;
pub const ThresholdMethod_enum_IMAQ_THRESH_CLUSTERING: ThresholdMethod_enum = 0;
pub const ThresholdMethod_enum_IMAQ_THRESH_ENTROPY: ThresholdMethod_enum = 1;
pub const ThresholdMethod_enum_IMAQ_THRESH_METRIC: ThresholdMethod_enum = 2;
pub const ThresholdMethod_enum_IMAQ_THRESH_MOMENTS: ThresholdMethod_enum = 3;
pub const ThresholdMethod_enum_IMAQ_THRESH_INTERCLASS: ThresholdMethod_enum = 4;
pub const ThresholdMethod_enum_IMAQ_THRESHOLD_METHOD_SIZE_GUARD: ThresholdMethod_enum = -1;
pub type ThresholdMethod_enum = ::std::os::raw::c_int;
pub use self::ThresholdMethod_enum as ThresholdMethod;
pub const TextAlignment_enum_IMAQ_LEFT: TextAlignment_enum = 0;
pub const TextAlignment_enum_IMAQ_CENTER: TextAlignment_enum = 1;
pub const TextAlignment_enum_IMAQ_RIGHT: TextAlignment_enum = 2;
pub const TextAlignment_enum_IMAQ_TEXT_ALIGNMENT_SIZE_GUARD: TextAlignment_enum = -1;
pub type TextAlignment_enum = ::std::os::raw::c_int;
pub use self::TextAlignment_enum as TextAlignment;
pub const SpokeDirection_enum_IMAQ_OUTSIDE_TO_INSIDE: SpokeDirection_enum = 0;
pub const SpokeDirection_enum_IMAQ_INSIDE_TO_OUTSIDE: SpokeDirection_enum = 1;
pub const SpokeDirection_enum_IMAQ_SPOKE_DIRECTION_SIZE_GUARD: SpokeDirection_enum = -1;
pub type SpokeDirection_enum = ::std::os::raw::c_int;
pub use self::SpokeDirection_enum as SpokeDirection;
pub const SkeletonMethod_enum_IMAQ_SKELETON_L: SkeletonMethod_enum = 0;
pub const SkeletonMethod_enum_IMAQ_SKELETON_M: SkeletonMethod_enum = 1;
pub const SkeletonMethod_enum_IMAQ_SKELETON_INVERSE: SkeletonMethod_enum = 2;
pub const SkeletonMethod_enum_IMAQ_SKELETON_METHOD_SIZE_GUARD: SkeletonMethod_enum = -1;
pub type SkeletonMethod_enum = ::std::os::raw::c_int;
pub use self::SkeletonMethod_enum as SkeletonMethod;
pub const SizeType_enum_IMAQ_KEEP_LARGE: SizeType_enum = 0;
pub const SizeType_enum_IMAQ_KEEP_SMALL: SizeType_enum = 1;
pub const SizeType_enum_IMAQ_SIZE_TYPE_SIZE_GUARD: SizeType_enum = -1;
pub type SizeType_enum = ::std::os::raw::c_int;
pub use self::SizeType_enum as SizeType;
pub const TwoEdgePolarityType_enum_IMAQ_NONE: TwoEdgePolarityType_enum = 0;
pub const TwoEdgePolarityType_enum_IMAQ_RISING_FALLING: TwoEdgePolarityType_enum = 1;
pub const TwoEdgePolarityType_enum_IMAQ_FALLING_RISING: TwoEdgePolarityType_enum = 2;
pub const TwoEdgePolarityType_enum_IMAQ_RISING_RISING: TwoEdgePolarityType_enum = 3;
pub const TwoEdgePolarityType_enum_IMAQ_FALLING_FALLING: TwoEdgePolarityType_enum = 4;
pub const TwoEdgePolarityType_enum_IMAQ_TWO_EDGE_POLARITY_TYPE_SIZE_GUARD:
	TwoEdgePolarityType_enum = -1;
pub type TwoEdgePolarityType_enum = ::std::os::raw::c_int;
pub use self::TwoEdgePolarityType_enum as TwoEdgePolarityType;
pub const CalibrationROI_enum_IMAQ_FULL_IMAGE: CalibrationROI_enum = 0;
pub const CalibrationROI_enum_IMAQ_CALIBRATION_ROI: CalibrationROI_enum = 1;
pub const CalibrationROI_enum_IMAQ_USER_ROI: CalibrationROI_enum = 2;
pub const CalibrationROI_enum_IMAQ_CALIBRATION_AND_USER_ROI: CalibrationROI_enum = 3;
pub const CalibrationROI_enum_IMAQ_CALIBRATION_OR_USER_ROI: CalibrationROI_enum = 4;
pub const CalibrationROI_enum_IMAQ_CALIBRATION_ROI_SIZE_GUARD: CalibrationROI_enum = -1;
pub type CalibrationROI_enum = ::std::os::raw::c_int;
pub use self::CalibrationROI_enum as CalibrationROI;
pub const ConcentricRakeDirection_enum_IMAQ_COUNTER_CLOCKWISE: ConcentricRakeDirection_enum = 0;
pub const ConcentricRakeDirection_enum_IMAQ_CLOCKWISE: ConcentricRakeDirection_enum = 1;
pub const ConcentricRakeDirection_enum_IMAQ_CONCENTRIC_RAKE_DIRECTION_SIZE_GUARD:
	ConcentricRakeDirection_enum = -1;
pub type ConcentricRakeDirection_enum = ::std::os::raw::c_int;
pub use self::ConcentricRakeDirection_enum as ConcentricRakeDirection;
pub const ComplexPlane_enum_IMAQ_REAL: ComplexPlane_enum = 0;
pub const ComplexPlane_enum_IMAQ_IMAGINARY: ComplexPlane_enum = 1;
pub const ComplexPlane_enum_IMAQ_MAGNITUDE: ComplexPlane_enum = 2;
pub const ComplexPlane_enum_IMAQ_PHASE: ComplexPlane_enum = 3;
pub const ComplexPlane_enum_IMAQ_COMPLEX_PLANE_SIZE_GUARD: ComplexPlane_enum = -1;
pub type ComplexPlane_enum = ::std::os::raw::c_int;
pub use self::ComplexPlane_enum as ComplexPlane;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_LINEAR: MathTransformMethod_enum = 0;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_LOG: MathTransformMethod_enum = 1;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_EXP: MathTransformMethod_enum = 2;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_SQR: MathTransformMethod_enum = 3;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_SQRT: MathTransformMethod_enum = 4;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_POWX: MathTransformMethod_enum = 5;
pub const MathTransformMethod_enum_IMAQ_TRANSFORM_POW1X: MathTransformMethod_enum = 6;
pub const MathTransformMethod_enum_IMAQ_MATH_TRANSFORM_METHOD_SIZE_GUARD: MathTransformMethod_enum =
	-1;
pub type MathTransformMethod_enum = ::std::os::raw::c_int;
pub use self::MathTransformMethod_enum as MathTransformMethod;
pub const ColorSensitivity_enum_IMAQ_SENSITIVITY_LOW: ColorSensitivity_enum = 0;
pub const ColorSensitivity_enum_IMAQ_SENSITIVITY_MED: ColorSensitivity_enum = 1;
pub const ColorSensitivity_enum_IMAQ_SENSITIVITY_HIGH: ColorSensitivity_enum = 2;
pub const ColorSensitivity_enum_IMAQ_COLOR_SENSITIVITY_SIZE_GUARD: ColorSensitivity_enum = -1;
pub type ColorSensitivity_enum = ::std::os::raw::c_int;
pub use self::ColorSensitivity_enum as ColorSensitivity;
pub const ParticleInfoMode_enum_IMAQ_BASIC_INFO: ParticleInfoMode_enum = 0;
pub const ParticleInfoMode_enum_IMAQ_ALL_INFO: ParticleInfoMode_enum = 1;
pub const ParticleInfoMode_enum_IMAQ_PARTICLE_INFO_MODE_SIZE_GUARD: ParticleInfoMode_enum = -1;
pub type ParticleInfoMode_enum = ::std::os::raw::c_int;
pub use self::ParticleInfoMode_enum as ParticleInfoMode;
pub const ContourType_enum_IMAQ_EMPTY_CONTOUR: ContourType_enum = 0;
pub const ContourType_enum_IMAQ_POINT: ContourType_enum = 1;
pub const ContourType_enum_IMAQ_LINE: ContourType_enum = 2;
pub const ContourType_enum_IMAQ_RECT: ContourType_enum = 3;
pub const ContourType_enum_IMAQ_OVAL: ContourType_enum = 4;
pub const ContourType_enum_IMAQ_CLOSED_CONTOUR: ContourType_enum = 5;
pub const ContourType_enum_IMAQ_OPEN_CONTOUR: ContourType_enum = 6;
pub const ContourType_enum_IMAQ_ANNULUS: ContourType_enum = 7;
pub const ContourType_enum_IMAQ_ROTATED_RECT: ContourType_enum = 8;
pub const ContourType_enum_IMAQ_CONTOUR_TYPE_SIZE_GUARD: ContourType_enum = -1;
pub type ContourType_enum = ::std::os::raw::c_int;
pub use self::ContourType_enum as ContourType;
pub const CalibrationUnit_enum_IMAQ_UNDEFINED: CalibrationUnit_enum = 0;
pub const CalibrationUnit_enum_IMAQ_ANGSTROM: CalibrationUnit_enum = 1;
pub const CalibrationUnit_enum_IMAQ_MICROMETER: CalibrationUnit_enum = 2;
pub const CalibrationUnit_enum_IMAQ_MILLIMETER: CalibrationUnit_enum = 3;
pub const CalibrationUnit_enum_IMAQ_CENTIMETER: CalibrationUnit_enum = 4;
pub const CalibrationUnit_enum_IMAQ_METER: CalibrationUnit_enum = 5;
pub const CalibrationUnit_enum_IMAQ_KILOMETER: CalibrationUnit_enum = 6;
pub const CalibrationUnit_enum_IMAQ_MICROINCH: CalibrationUnit_enum = 7;
pub const CalibrationUnit_enum_IMAQ_INCH: CalibrationUnit_enum = 8;
pub const CalibrationUnit_enum_IMAQ_FOOT: CalibrationUnit_enum = 9;
pub const CalibrationUnit_enum_IMAQ_NAUTICMILE: CalibrationUnit_enum = 10;
pub const CalibrationUnit_enum_IMAQ_GROUNDMILE: CalibrationUnit_enum = 11;
pub const CalibrationUnit_enum_IMAQ_STEP: CalibrationUnit_enum = 12;
pub const CalibrationUnit_enum_IMAQ_CALIBRATION_UNIT_SIZE_GUARD: CalibrationUnit_enum = -1;
pub type CalibrationUnit_enum = ::std::os::raw::c_int;
pub use self::CalibrationUnit_enum as CalibrationUnit;
pub const ComparisonFunction_enum_IMAQ_CLEAR_LESS: ComparisonFunction_enum = 0;
pub const ComparisonFunction_enum_IMAQ_CLEAR_LESS_OR_EQUAL: ComparisonFunction_enum = 1;
pub const ComparisonFunction_enum_IMAQ_CLEAR_EQUAL: ComparisonFunction_enum = 2;
pub const ComparisonFunction_enum_IMAQ_CLEAR_GREATER_OR_EQUAL: ComparisonFunction_enum = 3;
pub const ComparisonFunction_enum_IMAQ_CLEAR_GREATER: ComparisonFunction_enum = 4;
pub const ComparisonFunction_enum_IMAQ_COMPARE_FUNCTION_SIZE_GUARD: ComparisonFunction_enum = -1;
pub type ComparisonFunction_enum = ::std::os::raw::c_int;
pub use self::ComparisonFunction_enum as ComparisonFunction;
pub const CalibrationMode_enum_IMAQ_PERSPECTIVE: CalibrationMode_enum = 0;
pub const CalibrationMode_enum_IMAQ_NONLINEAR: CalibrationMode_enum = 1;
pub const CalibrationMode_enum_IMAQ_SIMPLE_CALIBRATION: CalibrationMode_enum = 2;
pub const CalibrationMode_enum_IMAQ_CORRECTED_IMAGE: CalibrationMode_enum = 3;
pub const CalibrationMode_enum_IMAQ_CALIBRATION_MODE_SIZE_GUARD: CalibrationMode_enum = -1;
pub type CalibrationMode_enum = ::std::os::raw::c_int;
pub use self::CalibrationMode_enum as CalibrationMode;
pub const BrowserLocation_enum_IMAQ_INSERT_FIRST_FREE: BrowserLocation_enum = 0;
pub const BrowserLocation_enum_IMAQ_INSERT_END: BrowserLocation_enum = 1;
pub const BrowserLocation_enum_IMAQ_BROWSER_LOCATION_SIZE_GUARD: BrowserLocation_enum = -1;
pub type BrowserLocation_enum = ::std::os::raw::c_int;
pub use self::BrowserLocation_enum as BrowserLocation;
pub const BrowserFrameStyle_enum_IMAQ_RAISED_FRAME: BrowserFrameStyle_enum = 0;
pub const BrowserFrameStyle_enum_IMAQ_BEVELLED_FRAME: BrowserFrameStyle_enum = 1;
pub const BrowserFrameStyle_enum_IMAQ_OUTLINE_FRAME: BrowserFrameStyle_enum = 2;
pub const BrowserFrameStyle_enum_IMAQ_HIDDEN_FRAME: BrowserFrameStyle_enum = 3;
pub const BrowserFrameStyle_enum_IMAQ_STEP_FRAME: BrowserFrameStyle_enum = 4;
pub const BrowserFrameStyle_enum_IMAQ_RAISED_OUTLINE_FRAME: BrowserFrameStyle_enum = 5;
pub const BrowserFrameStyle_enum_IMAQ_BROWSER_FRAME_STYLE_SIZE_GUARD: BrowserFrameStyle_enum = -1;
pub type BrowserFrameStyle_enum = ::std::os::raw::c_int;
pub use self::BrowserFrameStyle_enum as BrowserFrameStyle;
pub const BorderMethod_enum_IMAQ_BORDER_MIRROR: BorderMethod_enum = 0;
pub const BorderMethod_enum_IMAQ_BORDER_COPY: BorderMethod_enum = 1;
pub const BorderMethod_enum_IMAQ_BORDER_CLEAR: BorderMethod_enum = 2;
pub const BorderMethod_enum_IMAQ_BORDER_METHOD_SIZE_GUARD: BorderMethod_enum = -1;
pub type BorderMethod_enum = ::std::os::raw::c_int;
pub use self::BorderMethod_enum as BorderMethod;
pub const BarcodeType_enum_IMAQ_INVALID: BarcodeType_enum = -1;
pub const BarcodeType_enum_IMAQ_CODABAR: BarcodeType_enum = 1;
pub const BarcodeType_enum_IMAQ_CODE39: BarcodeType_enum = 2;
pub const BarcodeType_enum_IMAQ_CODE93: BarcodeType_enum = 4;
pub const BarcodeType_enum_IMAQ_CODE128: BarcodeType_enum = 8;
pub const BarcodeType_enum_IMAQ_EAN8: BarcodeType_enum = 16;
pub const BarcodeType_enum_IMAQ_EAN13: BarcodeType_enum = 32;
pub const BarcodeType_enum_IMAQ_I2_OF_5: BarcodeType_enum = 64;
pub const BarcodeType_enum_IMAQ_MSI: BarcodeType_enum = 128;
pub const BarcodeType_enum_IMAQ_UPCA: BarcodeType_enum = 256;
pub const BarcodeType_enum_IMAQ_PHARMACODE: BarcodeType_enum = 512;
pub const BarcodeType_enum_IMAQ_RSS_LIMITED: BarcodeType_enum = 1024;
pub const BarcodeType_enum_IMAQ_BARCODE_TYPE_SIZE_GUARD: BarcodeType_enum = 2147483647;
pub type BarcodeType_enum = ::std::os::raw::c_int;
pub use self::BarcodeType_enum as BarcodeType;
pub const AxisOrientation_enum_IMAQ_DIRECT: AxisOrientation_enum = 0;
pub const AxisOrientation_enum_IMAQ_INDIRECT: AxisOrientation_enum = 1;
pub const AxisOrientation_enum_IMAQ_AXIS_ORIENTATION_SIZE_GUARD: AxisOrientation_enum = -1;
pub type AxisOrientation_enum = ::std::os::raw::c_int;
pub use self::AxisOrientation_enum as AxisOrientation;
pub const ColorIgnoreMode_enum_IMAQ_IGNORE_NONE: ColorIgnoreMode_enum = 0;
pub const ColorIgnoreMode_enum_IMAQ_IGNORE_BLACK: ColorIgnoreMode_enum = 1;
pub const ColorIgnoreMode_enum_IMAQ_IGNORE_WHITE: ColorIgnoreMode_enum = 2;
pub const ColorIgnoreMode_enum_IMAQ_IGNORE_BLACK_AND_WHITE: ColorIgnoreMode_enum = 3;
pub const ColorIgnoreMode_enum_IMAQ_BLACK_WHITE_IGNORE_MODE_SIZE_GUARD: ColorIgnoreMode_enum = -1;
pub type ColorIgnoreMode_enum = ::std::os::raw::c_int;
pub use self::ColorIgnoreMode_enum as ColorIgnoreMode;
pub const LineGaugeMethod_enum_IMAQ_EDGE_TO_EDGE: LineGaugeMethod_enum = 0;
pub const LineGaugeMethod_enum_IMAQ_EDGE_TO_POINT: LineGaugeMethod_enum = 1;
pub const LineGaugeMethod_enum_IMAQ_POINT_TO_EDGE: LineGaugeMethod_enum = 2;
pub const LineGaugeMethod_enum_IMAQ_POINT_TO_POINT: LineGaugeMethod_enum = 3;
pub const LineGaugeMethod_enum_IMAQ_LINE_GAUGE_METHOD_SIZE_GUARD: LineGaugeMethod_enum = -1;
pub type LineGaugeMethod_enum = ::std::os::raw::c_int;
pub use self::LineGaugeMethod_enum as LineGaugeMethod;
pub const MatchingMode_enum_IMAQ_MATCH_SHIFT_INVARIANT: MatchingMode_enum = 1;
pub const MatchingMode_enum_IMAQ_MATCH_ROTATION_INVARIANT: MatchingMode_enum = 2;
pub const MatchingMode_enum_IMAQ_MATCHING_MODE_SIZE_GUARD: MatchingMode_enum = -1;
pub type MatchingMode_enum = ::std::os::raw::c_int;
pub use self::MatchingMode_enum as MatchingMode;
pub const MatchingAlgorithm_enum_IMAQ_MATCH_ALLALGORITHMS: MatchingAlgorithm_enum = 0;
pub const MatchingAlgorithm_enum_IMAQ_MATCH_LOW_DISCREPANCY: MatchingAlgorithm_enum = 1;
pub const MatchingAlgorithm_enum_IMAQ_MATCH_GRAYVALUE_PYRAMID: MatchingAlgorithm_enum = 2;
pub const MatchingAlgorithm_enum_IMAQ_MATCH_GRADIENT_PYRAMID: MatchingAlgorithm_enum = 3;
pub const MatchingAlgorithm_enum_IMAQ_MATCHING_ALGORITHM_SIZE_GUARD: MatchingAlgorithm_enum = -1;
pub type MatchingAlgorithm_enum = ::std::os::raw::c_int;
pub use self::MatchingAlgorithm_enum as MatchingAlgorithm;
pub const PatternMatchPresetFunction_enum_IMAQ_SET_DEFAULT_OPTIONS:
	PatternMatchPresetFunction_enum = 1;
pub const PatternMatchPresetFunction_enum_IMAQ_SET_PRESET_OPTIONS: PatternMatchPresetFunction_enum =
	2;
pub const PatternMatchPresetFunction_enum_IMAQ_PRESET_FUNCTION_SIZE_GUARD:
	PatternMatchPresetFunction_enum = -1;
pub type PatternMatchPresetFunction_enum = ::std::os::raw::c_int;
pub use self::PatternMatchPresetFunction_enum as PatternMatchPresetFunction;
pub const PatternMatchPresetType_enum_IMAQ_PRESET_USE_CASE: PatternMatchPresetType_enum = 0;
pub const PatternMatchPresetType_enum_IMAQ_PRESET_PRIORITY: PatternMatchPresetType_enum = 1;
pub const PatternMatchPresetType_enum_IMAQ_PRESET_TYPE_SIZE_GUARD: PatternMatchPresetType_enum = -1;
pub type PatternMatchPresetType_enum = ::std::os::raw::c_int;
pub use self::PatternMatchPresetType_enum as PatternMatchPresetType;
pub const ColorMode_enum_IMAQ_RGB: ColorMode_enum = 0;
pub const ColorMode_enum_IMAQ_HSL: ColorMode_enum = 1;
pub const ColorMode_enum_IMAQ_HSV: ColorMode_enum = 2;
pub const ColorMode_enum_IMAQ_HSI: ColorMode_enum = 3;
pub const ColorMode_enum_IMAQ_CIE: ColorMode_enum = 4;
pub const ColorMode_enum_IMAQ_CIEXYZ: ColorMode_enum = 5;
pub const ColorMode_enum_IMAQ_COLOR_MODE_SIZE_GUARD: ColorMode_enum = -1;
pub type ColorMode_enum = ::std::os::raw::c_int;
pub use self::ColorMode_enum as ColorMode;
pub const MappingMethod_enum_IMAQ_FULL_DYNAMIC: MappingMethod_enum = 0;
pub const MappingMethod_enum_IMAQ_DOWNSHIFT: MappingMethod_enum = 1;
pub const MappingMethod_enum_IMAQ_RANGE: MappingMethod_enum = 2;
pub const MappingMethod_enum_IMAQ_90_PCT_DYNAMIC: MappingMethod_enum = 3;
pub const MappingMethod_enum_IMAQ_PERCENT_RANGE: MappingMethod_enum = 4;
pub const MappingMethod_enum_IMAQ_DEFAULT_MAPPING: MappingMethod_enum = 10;
pub const MappingMethod_enum_IMAQ_MOST_SIGNIFICANT: MappingMethod_enum = 11;
pub const MappingMethod_enum_IMAQ_FULL_DYNAMIC_ALWAYS: MappingMethod_enum = 12;
pub const MappingMethod_enum_IMAQ_DOWNSHIFT_ALWAYS: MappingMethod_enum = 13;
pub const MappingMethod_enum_IMAQ_RANGE_ALWAYS: MappingMethod_enum = 14;
pub const MappingMethod_enum_IMAQ_90_PCT_DYNAMIC_ALWAYS: MappingMethod_enum = 15;
pub const MappingMethod_enum_IMAQ_PERCENT_RANGE_ALWAYS: MappingMethod_enum = 16;
pub const MappingMethod_enum_IMAQ_MAPPING_METHOD_SIZE_GUARD: MappingMethod_enum = -1;
pub type MappingMethod_enum = ::std::os::raw::c_int;
pub use self::MappingMethod_enum as MappingMethod;
pub const DetectionMode_enum_IMAQ_DETECT_PEAKS: DetectionMode_enum = 0;
pub const DetectionMode_enum_IMAQ_DETECT_VALLEYS: DetectionMode_enum = 1;
pub const DetectionMode_enum_IMAQ_DETECTION_MODE_SIZE_GUARD: DetectionMode_enum = -1;
pub type DetectionMode_enum = ::std::os::raw::c_int;
pub use self::DetectionMode_enum as DetectionMode;
pub const LevelType_enum_IMAQ_ABSOLUTE: LevelType_enum = 0;
pub const LevelType_enum_IMAQ_RELATIVE: LevelType_enum = 1;
pub const LevelType_enum_IMAQ_LEVEL_TYPE_SIZE_GUARD: LevelType_enum = -1;
pub type LevelType_enum = ::std::os::raw::c_int;
pub use self::LevelType_enum as LevelType;
pub const LearningMode_enum_IMAQ_LEARN_ALL: LearningMode_enum = 0;
pub const LearningMode_enum_IMAQ_LEARN_SHIFT_INFORMATION: LearningMode_enum = 1;
pub const LearningMode_enum_IMAQ_LEARN_ROTATION_INFORMATION: LearningMode_enum = 2;
pub const LearningMode_enum_IMAQ_LEARNING_MODE_SIZE_GUARD: LearningMode_enum = -1;
pub type LearningMode_enum = ::std::os::raw::c_int;
pub use self::LearningMode_enum as LearningMode;
pub const KernelFamily_enum_IMAQ_GRADIENT_FAMILY: KernelFamily_enum = 0;
pub const KernelFamily_enum_IMAQ_LAPLACIAN_FAMILY: KernelFamily_enum = 1;
pub const KernelFamily_enum_IMAQ_SMOOTHING_FAMILY: KernelFamily_enum = 2;
pub const KernelFamily_enum_IMAQ_GAUSSIAN_FAMILY: KernelFamily_enum = 3;
pub const KernelFamily_enum_IMAQ_KERNEL_FAMILY_SIZE_GUARD: KernelFamily_enum = -1;
pub type KernelFamily_enum = ::std::os::raw::c_int;
pub use self::KernelFamily_enum as KernelFamily;
pub const ImageType_enum_IMAQ_IMAGE_U8: ImageType_enum = 0;
pub const ImageType_enum_IMAQ_IMAGE_U16: ImageType_enum = 7;
pub const ImageType_enum_IMAQ_IMAGE_I16: ImageType_enum = 1;
pub const ImageType_enum_IMAQ_IMAGE_SGL: ImageType_enum = 2;
pub const ImageType_enum_IMAQ_IMAGE_COMPLEX: ImageType_enum = 3;
pub const ImageType_enum_IMAQ_IMAGE_RGB: ImageType_enum = 4;
pub const ImageType_enum_IMAQ_IMAGE_HSL: ImageType_enum = 5;
pub const ImageType_enum_IMAQ_IMAGE_RGB_U64: ImageType_enum = 6;
pub const ImageType_enum_IMAQ_IMAGE_TYPE_SIZE_GUARD: ImageType_enum = -1;
pub type ImageType_enum = ::std::os::raw::c_int;
pub use self::ImageType_enum as ImageType;
pub const CastingMethod_enum_IMAQ_USE_BIT_DEPTH: CastingMethod_enum = 0;
pub const CastingMethod_enum_IMAQ_USE_SHIFT: CastingMethod_enum = 1;
pub const CastingMethod_enum_IMAQ_USE_LOOKUP_TABLE: CastingMethod_enum = 2;
pub const CastingMethod_enum_IMAQ_CASTING_METHOD_SIZE_GUARD: CastingMethod_enum = -1;
pub type CastingMethod_enum = ::std::os::raw::c_int;
pub use self::CastingMethod_enum as CastingMethod;
pub const ImageFeatureMode_enum_IMAQ_COLOR_AND_SHAPE_FEATURES: ImageFeatureMode_enum = 0;
pub const ImageFeatureMode_enum_IMAQ_COLOR_FEATURES: ImageFeatureMode_enum = 1;
pub const ImageFeatureMode_enum_IMAQ_SHAPE_FEATURES: ImageFeatureMode_enum = 2;
pub const ImageFeatureMode_enum_IMAQ_FEATURE_MODE_SIZE_GUARD: ImageFeatureMode_enum = -1;
pub type ImageFeatureMode_enum = ::std::os::raw::c_int;
pub use self::ImageFeatureMode_enum as ImageFeatureMode;
pub const FontColor_enum_IMAQ_WHITE: FontColor_enum = 0;
pub const FontColor_enum_IMAQ_BLACK: FontColor_enum = 1;
pub const FontColor_enum_IMAQ_INVERT: FontColor_enum = 2;
pub const FontColor_enum_IMAQ_BLACK_ON_WHITE: FontColor_enum = 3;
pub const FontColor_enum_IMAQ_WHITE_ON_BLACK: FontColor_enum = 4;
pub const FontColor_enum_IMAQ_FONT_COLOR_SIZE_GUARD: FontColor_enum = -1;
pub type FontColor_enum = ::std::os::raw::c_int;
pub use self::FontColor_enum as FontColor;
pub const FlipAxis_enum_IMAQ_HORIZONTAL_AXIS: FlipAxis_enum = 0;
pub const FlipAxis_enum_IMAQ_VERTICAL_AXIS: FlipAxis_enum = 1;
pub const FlipAxis_enum_IMAQ_CENTER_AXIS: FlipAxis_enum = 2;
pub const FlipAxis_enum_IMAQ_DIAG_L_TO_R_AXIS: FlipAxis_enum = 3;
pub const FlipAxis_enum_IMAQ_DIAG_R_TO_L_AXIS: FlipAxis_enum = 4;
pub const FlipAxis_enum_IMAQ_FLIP_AXIS_SIZE_GUARD: FlipAxis_enum = -1;
pub type FlipAxis_enum = ::std::os::raw::c_int;
pub use self::FlipAxis_enum as FlipAxis;
pub const EdgeProcess_enum_IMAQ_FIRST: EdgeProcess_enum = 0;
pub const EdgeProcess_enum_IMAQ_FIRST_AND_LAST: EdgeProcess_enum = 1;
pub const EdgeProcess_enum_IMAQ_ALL: EdgeProcess_enum = 2;
pub const EdgeProcess_enum_IMAQ_BEST: EdgeProcess_enum = 3;
pub const EdgeProcess_enum_IMAQ_EDGE_PROCESS_SIZE_GUARD: EdgeProcess_enum = -1;
pub type EdgeProcess_enum = ::std::os::raw::c_int;
pub use self::EdgeProcess_enum as EdgeProcess;
pub const DrawMode_enum_IMAQ_DRAW_VALUE: DrawMode_enum = 0;
pub const DrawMode_enum_IMAQ_DRAW_INVERT: DrawMode_enum = 2;
pub const DrawMode_enum_IMAQ_PAINT_VALUE: DrawMode_enum = 1;
pub const DrawMode_enum_IMAQ_PAINT_INVERT: DrawMode_enum = 3;
pub const DrawMode_enum_IMAQ_HIGHLIGHT_VALUE: DrawMode_enum = 4;
pub const DrawMode_enum_IMAQ_DRAW_MODE_SIZE_GUARD: DrawMode_enum = -1;
pub type DrawMode_enum = ::std::os::raw::c_int;
pub use self::DrawMode_enum as DrawMode;
pub const Direction3D_enum_IMAQ_3D_NW: Direction3D_enum = 0;
pub const Direction3D_enum_IMAQ_3D_SW: Direction3D_enum = 1;
pub const Direction3D_enum_IMAQ_3D_SE: Direction3D_enum = 2;
pub const Direction3D_enum_IMAQ_3D_NE: Direction3D_enum = 3;
pub const Direction3D_enum_IMAQ_DIRECTION_3D_SIZE_GUARD: Direction3D_enum = -1;
pub type Direction3D_enum = ::std::os::raw::c_int;
pub use self::Direction3D_enum as Direction3D;
pub const InterpolationMethod_enum_IMAQ_ZERO_ORDER: InterpolationMethod_enum = 0;
pub const InterpolationMethod_enum_IMAQ_BILINEAR: InterpolationMethod_enum = 1;
pub const InterpolationMethod_enum_IMAQ_QUADRATIC: InterpolationMethod_enum = 2;
pub const InterpolationMethod_enum_IMAQ_CUBIC_SPLINE: InterpolationMethod_enum = 3;
pub const InterpolationMethod_enum_IMAQ_BILINEAR_FIXED: InterpolationMethod_enum = 4;
pub const InterpolationMethod_enum_IMAQ_INTERPOLATION_METHOD_SIZE_GUARD: InterpolationMethod_enum =
	-1;
pub type InterpolationMethod_enum = ::std::os::raw::c_int;
pub use self::InterpolationMethod_enum as InterpolationMethod;
pub const ReadResolution_enum_IMAQ_LOW_RESOLUTION: ReadResolution_enum = 0;
pub const ReadResolution_enum_IMAQ_MEDIUM_RESOLUTION: ReadResolution_enum = 1;
pub const ReadResolution_enum_IMAQ_HIGH_RESOLUTION: ReadResolution_enum = 2;
pub const ReadResolution_enum_IMAQ_READ_RESOLUTION_SIZE_GUARD: ReadResolution_enum = -1;
pub type ReadResolution_enum = ::std::os::raw::c_int;
pub use self::ReadResolution_enum as ReadResolution;
pub const WriteClassifierFileMode_enum_IMAQ_CLASSIFIER_WRITE_ALL: WriteClassifierFileMode_enum = 0;
pub const WriteClassifierFileMode_enum_IMAQ_CLASSIFIER_WRITE_CLASSIFY_ONLY:
	WriteClassifierFileMode_enum = 1;
pub const WriteClassifierFileMode_enum_IMAQ_WRITE_CLASSIFIER_FILE_MODES_SIZE_GUARD:
	WriteClassifierFileMode_enum = -1;
pub type WriteClassifierFileMode_enum = ::std::os::raw::c_int;
pub use self::WriteClassifierFileMode_enum as WriteClassifierFileMode;
pub const NearestNeighborMetric_enum_IMAQ_METRIC_MAXIMUM: NearestNeighborMetric_enum = 0;
pub const NearestNeighborMetric_enum_IMAQ_METRIC_SUM: NearestNeighborMetric_enum = 1;
pub const NearestNeighborMetric_enum_IMAQ_METRIC_EUCLIDEAN: NearestNeighborMetric_enum = 2;
pub const NearestNeighborMetric_enum_IMAQ_NEAREST_NEIGHBOR_METRIC_SIZE_GUARD:
	NearestNeighborMetric_enum = -1;
pub type NearestNeighborMetric_enum = ::std::os::raw::c_int;
pub use self::NearestNeighborMetric_enum as NearestNeighborMetric;
pub const NearestNeighborMethod_enum_IMAQ_MINIMUM_MEAN_DISTANCE: NearestNeighborMethod_enum = 0;
pub const NearestNeighborMethod_enum_IMAQ_K_NEAREST_NEIGHBOR: NearestNeighborMethod_enum = 1;
pub const NearestNeighborMethod_enum_IMAQ_NEAREST_PROTOTYPE: NearestNeighborMethod_enum = 2;
pub const NearestNeighborMethod_enum_IMAQ_NEAREST_NEIGHBOR_METHOD_SIZE_GUARD:
	NearestNeighborMethod_enum = -1;
pub type NearestNeighborMethod_enum = ::std::os::raw::c_int;
pub use self::NearestNeighborMethod_enum as NearestNeighborMethod;
pub const ParticleClassifierType_enum_IMAQ_PARTICLE_LARGEST: ParticleClassifierType_enum = 0;
pub const ParticleClassifierType_enum_IMAQ_PARTICLE_ALL: ParticleClassifierType_enum = 1;
pub const ParticleClassifierType_enum_IMAQ_PARTICLE_CLASSIFIER_TYPE_SIZE_GUARD:
	ParticleClassifierType_enum = -1;
pub type ParticleClassifierType_enum = ::std::os::raw::c_int;
pub use self::ParticleClassifierType_enum as ParticleClassifierType;
pub const ButtonLabel_enum_IMAQ_BUTTON_OK: ButtonLabel_enum = 0;
pub const ButtonLabel_enum_IMAQ_BUTTON_SAVE: ButtonLabel_enum = 1;
pub const ButtonLabel_enum_IMAQ_BUTTON_SELECT: ButtonLabel_enum = 2;
pub const ButtonLabel_enum_IMAQ_BUTTON_LOAD: ButtonLabel_enum = 3;
pub const ButtonLabel_enum_IMAQ_BUTTON_LABEL_SIZE_GUARD: ButtonLabel_enum = -1;
pub type ButtonLabel_enum = ::std::os::raw::c_int;
pub use self::ButtonLabel_enum as ButtonLabel;
pub const GeometricMatchingMode_enum_IMAQ_GEOMETRIC_MATCH_SHIFT_INVARIANT:
	GeometricMatchingMode_enum = 0;
pub const GeometricMatchingMode_enum_IMAQ_GEOMETRIC_MATCH_ROTATION_INVARIANT:
	GeometricMatchingMode_enum = 1;
pub const GeometricMatchingMode_enum_IMAQ_GEOMETRIC_MATCH_SCALE_INVARIANT:
	GeometricMatchingMode_enum = 2;
pub const GeometricMatchingMode_enum_IMAQ_GEOMETRIC_MATCH_OCCLUSION_INVARIANT:
	GeometricMatchingMode_enum = 4;
pub const GeometricMatchingMode_enum_IMAQ_GEOMETRIC_MATCHING_MODE_SIZE_GUARD:
	GeometricMatchingMode_enum = -1;
pub type GeometricMatchingMode_enum = ::std::os::raw::c_int;
pub use self::GeometricMatchingMode_enum as GeometricMatchingMode;
pub const MeasurementType_enum_IMAQ_MT_CENTER_OF_MASS_X: MeasurementType_enum = 0;
pub const MeasurementType_enum_IMAQ_MT_CENTER_OF_MASS_Y: MeasurementType_enum = 1;
pub const MeasurementType_enum_IMAQ_MT_FIRST_PIXEL_X: MeasurementType_enum = 2;
pub const MeasurementType_enum_IMAQ_MT_FIRST_PIXEL_Y: MeasurementType_enum = 3;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_LEFT: MeasurementType_enum = 4;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_TOP: MeasurementType_enum = 5;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_RIGHT: MeasurementType_enum = 6;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_BOTTOM: MeasurementType_enum = 7;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER_START_X: MeasurementType_enum = 8;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER_START_Y: MeasurementType_enum = 9;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER_END_X: MeasurementType_enum = 10;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER_END_Y: MeasurementType_enum = 11;
pub const MeasurementType_enum_IMAQ_MT_MAX_HORIZ_SEGMENT_LENGTH_LEFT: MeasurementType_enum = 12;
pub const MeasurementType_enum_IMAQ_MT_MAX_HORIZ_SEGMENT_LENGTH_RIGHT: MeasurementType_enum = 13;
pub const MeasurementType_enum_IMAQ_MT_MAX_HORIZ_SEGMENT_LENGTH_ROW: MeasurementType_enum = 14;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_WIDTH: MeasurementType_enum = 16;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_HEIGHT: MeasurementType_enum = 17;
pub const MeasurementType_enum_IMAQ_MT_BOUNDING_RECT_DIAGONAL: MeasurementType_enum = 18;
pub const MeasurementType_enum_IMAQ_MT_PERIMETER: MeasurementType_enum = 19;
pub const MeasurementType_enum_IMAQ_MT_CONVEX_HULL_PERIMETER: MeasurementType_enum = 20;
pub const MeasurementType_enum_IMAQ_MT_HOLES_PERIMETER: MeasurementType_enum = 21;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER: MeasurementType_enum = 22;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_ELLIPSE_MAJOR_AXIS: MeasurementType_enum = 23;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_ELLIPSE_MINOR_AXIS: MeasurementType_enum = 24;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_ELLIPSE_MINOR_AXIS_FERET: MeasurementType_enum =
	25;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_RECT_LONG_SIDE: MeasurementType_enum = 26;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_RECT_SHORT_SIDE: MeasurementType_enum = 27;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_RECT_DIAGONAL: MeasurementType_enum = 28;
pub const MeasurementType_enum_IMAQ_MT_EQUIVALENT_RECT_SHORT_SIDE_FERET: MeasurementType_enum = 29;
pub const MeasurementType_enum_IMAQ_MT_AVERAGE_HORIZ_SEGMENT_LENGTH: MeasurementType_enum = 30;
pub const MeasurementType_enum_IMAQ_MT_AVERAGE_VERT_SEGMENT_LENGTH: MeasurementType_enum = 31;
pub const MeasurementType_enum_IMAQ_MT_HYDRAULIC_RADIUS: MeasurementType_enum = 32;
pub const MeasurementType_enum_IMAQ_MT_WADDEL_DISK_DIAMETER: MeasurementType_enum = 33;
pub const MeasurementType_enum_IMAQ_MT_AREA: MeasurementType_enum = 35;
pub const MeasurementType_enum_IMAQ_MT_HOLES_AREA: MeasurementType_enum = 36;
pub const MeasurementType_enum_IMAQ_MT_PARTICLE_AND_HOLES_AREA: MeasurementType_enum = 37;
pub const MeasurementType_enum_IMAQ_MT_CONVEX_HULL_AREA: MeasurementType_enum = 38;
pub const MeasurementType_enum_IMAQ_MT_IMAGE_AREA: MeasurementType_enum = 39;
pub const MeasurementType_enum_IMAQ_MT_NUMBER_OF_HOLES: MeasurementType_enum = 41;
pub const MeasurementType_enum_IMAQ_MT_NUMBER_OF_HORIZ_SEGMENTS: MeasurementType_enum = 42;
pub const MeasurementType_enum_IMAQ_MT_NUMBER_OF_VERT_SEGMENTS: MeasurementType_enum = 43;
pub const MeasurementType_enum_IMAQ_MT_ORIENTATION: MeasurementType_enum = 45;
pub const MeasurementType_enum_IMAQ_MT_MAX_FERET_DIAMETER_ORIENTATION: MeasurementType_enum = 46;
pub const MeasurementType_enum_IMAQ_MT_AREA_BY_IMAGE_AREA: MeasurementType_enum = 48;
pub const MeasurementType_enum_IMAQ_MT_AREA_BY_PARTICLE_AND_HOLES_AREA: MeasurementType_enum = 49;
pub const MeasurementType_enum_IMAQ_MT_RATIO_OF_EQUIVALENT_ELLIPSE_AXES: MeasurementType_enum = 50;
pub const MeasurementType_enum_IMAQ_MT_RATIO_OF_EQUIVALENT_RECT_SIDES: MeasurementType_enum = 51;
pub const MeasurementType_enum_IMAQ_MT_ELONGATION_FACTOR: MeasurementType_enum = 53;
pub const MeasurementType_enum_IMAQ_MT_COMPACTNESS_FACTOR: MeasurementType_enum = 54;
pub const MeasurementType_enum_IMAQ_MT_HEYWOOD_CIRCULARITY_FACTOR: MeasurementType_enum = 55;
pub const MeasurementType_enum_IMAQ_MT_TYPE_FACTOR: MeasurementType_enum = 56;
pub const MeasurementType_enum_IMAQ_MT_SUM_X: MeasurementType_enum = 58;
pub const MeasurementType_enum_IMAQ_MT_SUM_Y: MeasurementType_enum = 59;
pub const MeasurementType_enum_IMAQ_MT_SUM_XX: MeasurementType_enum = 60;
pub const MeasurementType_enum_IMAQ_MT_SUM_XY: MeasurementType_enum = 61;
pub const MeasurementType_enum_IMAQ_MT_SUM_YY: MeasurementType_enum = 62;
pub const MeasurementType_enum_IMAQ_MT_SUM_XXX: MeasurementType_enum = 63;
pub const MeasurementType_enum_IMAQ_MT_SUM_XXY: MeasurementType_enum = 64;
pub const MeasurementType_enum_IMAQ_MT_SUM_XYY: MeasurementType_enum = 65;
pub const MeasurementType_enum_IMAQ_MT_SUM_YYY: MeasurementType_enum = 66;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_XX: MeasurementType_enum = 68;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_XY: MeasurementType_enum = 69;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_YY: MeasurementType_enum = 70;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_XXX: MeasurementType_enum = 71;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_XXY: MeasurementType_enum = 72;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_XYY: MeasurementType_enum = 73;
pub const MeasurementType_enum_IMAQ_MT_MOMENT_OF_INERTIA_YYY: MeasurementType_enum = 74;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_XX: MeasurementType_enum = 75;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_XY: MeasurementType_enum = 76;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_YY: MeasurementType_enum = 77;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_XXX: MeasurementType_enum = 78;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_XXY: MeasurementType_enum = 79;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_XYY: MeasurementType_enum = 80;
pub const MeasurementType_enum_IMAQ_MT_NORM_MOMENT_OF_INERTIA_YYY: MeasurementType_enum = 81;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_1: MeasurementType_enum = 82;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_2: MeasurementType_enum = 83;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_3: MeasurementType_enum = 84;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_4: MeasurementType_enum = 85;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_5: MeasurementType_enum = 86;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_6: MeasurementType_enum = 87;
pub const MeasurementType_enum_IMAQ_MT_HU_MOMENT_7: MeasurementType_enum = 88;
pub const MeasurementType_enum_IMAQ_MEASUREMENT_TYPE_SIZE_GUARD: MeasurementType_enum = -1;
pub type MeasurementType_enum = ::std::os::raw::c_int;
pub use self::MeasurementType_enum as MeasurementType;
pub const ParticleType_enum_IMAQ_PARTICLE_BRIGHT: ParticleType_enum = 0;
pub const ParticleType_enum_IMAQ_PARTICLE_DARK: ParticleType_enum = 1;
pub const ParticleType_enum_IMAQ_PARTICLE_TYPE_SIZE_GUARD: ParticleType_enum = -1;
pub type ParticleType_enum = ::std::os::raw::c_int;
pub use self::ParticleType_enum as ParticleType;
pub const ThresholdMode_enum_IMAQ_FIXED_RANGE: ThresholdMode_enum = 0;
pub const ThresholdMode_enum_IMAQ_COMPUTED_UNIFORM: ThresholdMode_enum = 1;
pub const ThresholdMode_enum_IMAQ_COMPUTED_LINEAR: ThresholdMode_enum = 2;
pub const ThresholdMode_enum_IMAQ_COMPUTED_NONLINEAR: ThresholdMode_enum = 3;
pub const ThresholdMode_enum_IMAQ_THRESHOLD_MODE_SIZE_GUARD: ThresholdMode_enum = -1;
pub type ThresholdMode_enum = ::std::os::raw::c_int;
pub use self::ThresholdMode_enum as ThresholdMode;
pub const ReadStrategy_enum_IMAQ_READ_AGGRESSIVE: ReadStrategy_enum = 0;
pub const ReadStrategy_enum_IMAQ_READ_CONSERVATIVE: ReadStrategy_enum = 1;
pub const ReadStrategy_enum_IMAQ_READ_STRATEGY_SIZE_GUARD: ReadStrategy_enum = -1;
pub type ReadStrategy_enum = ::std::os::raw::c_int;
pub use self::ReadStrategy_enum as ReadStrategy;
pub const GroupBehavior_enum_IMAQ_GROUP_CLEAR: GroupBehavior_enum = 0;
pub const GroupBehavior_enum_IMAQ_GROUP_KEEP: GroupBehavior_enum = 1;
pub const GroupBehavior_enum_IMAQ_GROUP_TRANSFORM: GroupBehavior_enum = 2;
pub const GroupBehavior_enum_IMAQ_GROUP_BEHAVIOR_SIZE_GUARD: GroupBehavior_enum = -1;
pub type GroupBehavior_enum = ::std::os::raw::c_int;
pub use self::GroupBehavior_enum as GroupBehavior;
pub const QRGradingMode_enum_IMAQ_QR_NO_GRADING: QRGradingMode_enum = 0;
pub const QRGradingMode_enum_IMAQ_QR_GRADING_MODE_SIZE_GUARD: QRGradingMode_enum = -1;
pub type QRGradingMode_enum = ::std::os::raw::c_int;
pub use self::QRGradingMode_enum as QRGradingMode;
pub const MeasureParticlesCalibrationMode_enum_IMAQ_CALIBRATION_MODE_PIXEL:
	MeasureParticlesCalibrationMode_enum = 0;
pub const MeasureParticlesCalibrationMode_enum_IMAQ_CALIBRATION_MODE_CALIBRATED:
	MeasureParticlesCalibrationMode_enum = 1;
pub const MeasureParticlesCalibrationMode_enum_IMAQ_CALIBRATION_MODE_BOTH:
	MeasureParticlesCalibrationMode_enum = 2;
pub const MeasureParticlesCalibrationMode_enum_IMAQ_MEASURE_PARTICLES_CALIBRATION_MODE_SIZE_GUARD : MeasureParticlesCalibrationMode_enum = - 1 ;
pub type MeasureParticlesCalibrationMode_enum = ::std::os::raw::c_int;
pub use self::MeasureParticlesCalibrationMode_enum as MeasureParticlesCalibrationMode;
pub const ThresholdType_enum_IMAQ_GLOBAL_THRESHOLD: ThresholdType_enum = 0;
pub const ThresholdType_enum_IMAQ_LOCAL_THRESHOLD: ThresholdType_enum = 1;
pub const ThresholdType_enum_IMAQ_COLOR_THRESHOLD: ThresholdType_enum = 2;
pub const ThresholdType_enum_IMAQ_THRESHOLD_TYPE_SIZE_GUARD: ThresholdType_enum = -1;
pub type ThresholdType_enum = ::std::os::raw::c_int;
pub use self::ThresholdType_enum as ThresholdType;
pub const LineSeparator_enum_IMAQ_END_OF_LINE_CONSTANT: LineSeparator_enum = 0;
pub const LineSeparator_enum_IMAQ_LINE_FEED: LineSeparator_enum = 1;
pub const LineSeparator_enum_IMAQ_CARRIAGE_RETURN: LineSeparator_enum = 2;
pub const LineSeparator_enum_IMAQ_LINE_SEPARATOR_SIZE_GUARD: LineSeparator_enum = -1;
pub type LineSeparator_enum = ::std::os::raw::c_int;
pub use self::LineSeparator_enum as LineSeparator;
pub const GeometricMatchingSearchStrategy_enum_IMAQ_GEOMETRIC_MATCHING_CONSERVATIVE:
	GeometricMatchingSearchStrategy_enum = 0;
pub const GeometricMatchingSearchStrategy_enum_IMAQ_GEOMETRIC_MATCHING_BALANCED:
	GeometricMatchingSearchStrategy_enum = 1;
pub const GeometricMatchingSearchStrategy_enum_IMAQ_GEOMETRIC_MATCHING_AGGRESSIVE:
	GeometricMatchingSearchStrategy_enum = 2;
pub const GeometricMatchingSearchStrategy_enum_IMAQ_GEOMETRIC_MATCHING_SEARCH_STRATEGY_SIZE_GUARD : GeometricMatchingSearchStrategy_enum = - 1 ;
pub type GeometricMatchingSearchStrategy_enum = ::std::os::raw::c_int;
pub use self::GeometricMatchingSearchStrategy_enum as GeometricMatchingSearchStrategy;
pub const ColorClassificationResolution_enum_IMAQ_CLASSIFIER_LOW_RESOLUTION:
	ColorClassificationResolution_enum = 0;
pub const ColorClassificationResolution_enum_IMAQ_CLASSIFIER_MEDIUM_RESOLUTION:
	ColorClassificationResolution_enum = 1;
pub const ColorClassificationResolution_enum_IMAQ_CLASSIFIER_HIGH_RESOLUTION:
	ColorClassificationResolution_enum = 2;
pub const ColorClassificationResolution_enum_IMAQ_CLASSIFIER_RESOLUTION_SIZE_GUARD:
	ColorClassificationResolution_enum = -1;
pub type ColorClassificationResolution_enum = ::std::os::raw::c_int;
pub use self::ColorClassificationResolution_enum as ColorClassificationResolution;
pub const ContrastMode_enum_IMAQ_ORIGINAL_CONTRAST: ContrastMode_enum = 0;
pub const ContrastMode_enum_IMAQ_REVERSED_CONTRAST: ContrastMode_enum = 1;
pub const ContrastMode_enum_IMAQ_BOTH_CONTRASTS: ContrastMode_enum = 2;
pub type ContrastMode_enum = ::std::os::raw::c_int;
pub use self::ContrastMode_enum as ContrastMode;
pub const RoundingMode_enum_IMAQ_ROUNDING_MODE_OPTIMIZE: RoundingMode_enum = 0;
pub const RoundingMode_enum_IMAQ_ROUNDING_MODE_TRUNCATE: RoundingMode_enum = 1;
pub const RoundingMode_enum_IMAQ_ROUNDING_MODE_SIZE_GUARD: RoundingMode_enum = -1;
pub type RoundingMode_enum = ::std::os::raw::c_int;
pub use self::RoundingMode_enum as RoundingMode;
pub const FindTransformMode_enum_IMAQ_FIND_REFERENCE: FindTransformMode_enum = 0;
pub const FindTransformMode_enum_IMAQ_UPDATE_TRANSFORM: FindTransformMode_enum = 1;
pub const FindTransformMode_enum_IMAQ_FIND_TRANSFORM_MODE_SIZE_GUARD: FindTransformMode_enum = -1;
pub type FindTransformMode_enum = ::std::os::raw::c_int;
pub use self::FindTransformMode_enum as FindTransformMode;
pub const WaveletType_enum_IMAQ_DB02: WaveletType_enum = 0;
pub const WaveletType_enum_IMAQ_DB03: WaveletType_enum = 1;
pub const WaveletType_enum_IMAQ_DB04: WaveletType_enum = 2;
pub const WaveletType_enum_IMAQ_DB05: WaveletType_enum = 3;
pub const WaveletType_enum_IMAQ_DB06: WaveletType_enum = 4;
pub const WaveletType_enum_IMAQ_DB07: WaveletType_enum = 5;
pub const WaveletType_enum_IMAQ_DB08: WaveletType_enum = 6;
pub const WaveletType_enum_IMAQ_DB09: WaveletType_enum = 7;
pub const WaveletType_enum_IMAQ_DB10: WaveletType_enum = 8;
pub const WaveletType_enum_IMAQ_DB11: WaveletType_enum = 9;
pub const WaveletType_enum_IMAQ_DB12: WaveletType_enum = 10;
pub const WaveletType_enum_IMAQ_DB13: WaveletType_enum = 11;
pub const WaveletType_enum_IMAQ_DB14: WaveletType_enum = 12;
pub const WaveletType_enum_IMAQ_HAAR: WaveletType_enum = 13;
pub const WaveletType_enum_IMAQ_BIOR1_3: WaveletType_enum = 14;
pub const WaveletType_enum_IMAQ_BIOR1_5: WaveletType_enum = 15;
pub const WaveletType_enum_IMAQ_BIOR2_2: WaveletType_enum = 16;
pub const WaveletType_enum_IMAQ_BIOR2_4: WaveletType_enum = 17;
pub const WaveletType_enum_IMAQ_BIOR2_6: WaveletType_enum = 18;
pub const WaveletType_enum_IMAQ_BIOR2_8: WaveletType_enum = 19;
pub const WaveletType_enum_IMAQ_BIOR3_1: WaveletType_enum = 20;
pub const WaveletType_enum_IMAQ_BIOR3_3: WaveletType_enum = 21;
pub const WaveletType_enum_IMAQ_BIOR3_5: WaveletType_enum = 22;
pub const WaveletType_enum_IMAQ_BIOR3_7: WaveletType_enum = 23;
pub const WaveletType_enum_IMAQ_BIOR3_9: WaveletType_enum = 24;
pub const WaveletType_enum_IMAQ_BIOR4_4: WaveletType_enum = 25;
pub const WaveletType_enum_IMAQ_COIF1: WaveletType_enum = 26;
pub const WaveletType_enum_IMAQ_COIF2: WaveletType_enum = 27;
pub const WaveletType_enum_IMAQ_COIF3: WaveletType_enum = 28;
pub const WaveletType_enum_IMAQ_COIF4: WaveletType_enum = 29;
pub const WaveletType_enum_IMAQ_COIF5: WaveletType_enum = 30;
pub const WaveletType_enum_IMAQ_SYM2: WaveletType_enum = 31;
pub const WaveletType_enum_IMAQ_SYM3: WaveletType_enum = 32;
pub const WaveletType_enum_IMAQ_SYM4: WaveletType_enum = 33;
pub const WaveletType_enum_IMAQ_SYM5: WaveletType_enum = 34;
pub const WaveletType_enum_IMAQ_SYM6: WaveletType_enum = 35;
pub const WaveletType_enum_IMAQ_SYM7: WaveletType_enum = 36;
pub const WaveletType_enum_IMAQ_SYM8: WaveletType_enum = 37;
pub const WaveletType_enum_IMAQ_BIOR5_5: WaveletType_enum = 38;
pub const WaveletType_enum_IMAQ_BIOR6_8: WaveletType_enum = 39;
pub const WaveletType_enum_IMAQ_WAVE_TYPE_SIZE_GUARD: WaveletType_enum = -1;
pub type WaveletType_enum = ::std::os::raw::c_int;
pub use self::WaveletType_enum as WaveletType;
pub const MulticoreOperation_enum_IMAQ_GET_CORES: MulticoreOperation_enum = 0;
pub const MulticoreOperation_enum_IMAQ_SET_CORES: MulticoreOperation_enum = 1;
pub const MulticoreOperation_enum_IMAQ_USE_MAX_AVAILABLE: MulticoreOperation_enum = 2;
pub const MulticoreOperation_enum_IMAQ_MULTICORE_OPERATION_SIZE_GUARD: MulticoreOperation_enum = -1;
pub type MulticoreOperation_enum = ::std::os::raw::c_int;
pub use self::MulticoreOperation_enum as MulticoreOperation;
pub const MorphologyReconstructOperation_enum_IMAQ_DILATE_RECONSTRUCT:
	MorphologyReconstructOperation_enum = 0;
pub const MorphologyReconstructOperation_enum_IMAQ_ERODE_RECONSTRUCT:
	MorphologyReconstructOperation_enum = 1;
pub const MorphologyReconstructOperation_enum_IMAQ_MORPHOLOGY_RECONSTRUCT_OPERATION_SIZE_GUARD:
	MorphologyReconstructOperation_enum = -1;
pub type MorphologyReconstructOperation_enum = ::std::os::raw::c_int;
pub use self::MorphologyReconstructOperation_enum as MorphologyReconstructOperation;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_AUTO_DETECT: QRDimensions_enum = 0;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_11x11: QRDimensions_enum = 11;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_13x13: QRDimensions_enum = 13;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_15x15: QRDimensions_enum = 15;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_17x17: QRDimensions_enum = 17;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_21x21: QRDimensions_enum = 21;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_25x25: QRDimensions_enum = 25;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_29x29: QRDimensions_enum = 29;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_33x33: QRDimensions_enum = 33;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_37x37: QRDimensions_enum = 37;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_41x41: QRDimensions_enum = 41;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_45x45: QRDimensions_enum = 45;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_49x49: QRDimensions_enum = 49;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_53x53: QRDimensions_enum = 53;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_57x57: QRDimensions_enum = 57;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_61x61: QRDimensions_enum = 61;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_65x65: QRDimensions_enum = 65;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_69x69: QRDimensions_enum = 69;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_73x73: QRDimensions_enum = 73;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_77x77: QRDimensions_enum = 77;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_81x81: QRDimensions_enum = 81;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_85x85: QRDimensions_enum = 85;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_89x89: QRDimensions_enum = 89;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_93x93: QRDimensions_enum = 93;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_97x97: QRDimensions_enum = 97;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_101x101: QRDimensions_enum = 101;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_105x105: QRDimensions_enum = 105;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_109x109: QRDimensions_enum = 109;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_113x113: QRDimensions_enum = 113;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_117x117: QRDimensions_enum = 117;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_121x121: QRDimensions_enum = 121;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_125x125: QRDimensions_enum = 125;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_129x129: QRDimensions_enum = 129;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_133x133: QRDimensions_enum = 133;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_137x137: QRDimensions_enum = 137;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_141x141: QRDimensions_enum = 141;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_145x145: QRDimensions_enum = 145;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_149x149: QRDimensions_enum = 149;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_153x153: QRDimensions_enum = 153;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_157x157: QRDimensions_enum = 157;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_161x161: QRDimensions_enum = 161;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_165x165: QRDimensions_enum = 165;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_169x169: QRDimensions_enum = 169;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_173x173: QRDimensions_enum = 173;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_177x177: QRDimensions_enum = 177;
pub const QRDimensions_enum_IMAQ_QR_DIMENSIONS_SIZE_GUARD: QRDimensions_enum = -1;
pub type QRDimensions_enum = ::std::os::raw::c_int;
pub use self::QRDimensions_enum as QRDimensions;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_AUTO_DETECT: QRCellFilterMode_enum = -2;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_AVERAGE: QRCellFilterMode_enum = 0;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_MEDIAN: QRCellFilterMode_enum = 1;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_CENTRAL_AVERAGE: QRCellFilterMode_enum = 2;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_HIGH_AVERAGE: QRCellFilterMode_enum = 3;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_LOW_AVERAGE: QRCellFilterMode_enum = 4;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_VERY_HIGH_AVERAGE: QRCellFilterMode_enum =
	5;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_VERY_LOW_AVERAGE: QRCellFilterMode_enum =
	6;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_ALL: QRCellFilterMode_enum = 8;
pub const QRCellFilterMode_enum_IMAQ_QR_CELL_FILTER_MODE_SIZE_GUARD: QRCellFilterMode_enum =
	2147483647;
pub type QRCellFilterMode_enum = ::std::os::raw::c_int;
pub use self::QRCellFilterMode_enum as QRCellFilterMode;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE_AUTO_DETECT: QRCellSampleSize_enum = -2;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE1X1: QRCellSampleSize_enum = 1;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE2X2: QRCellSampleSize_enum = 2;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE3X3: QRCellSampleSize_enum = 3;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE4X4: QRCellSampleSize_enum = 4;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE5X5: QRCellSampleSize_enum = 5;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE6X6: QRCellSampleSize_enum = 6;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_SIZE7X7: QRCellSampleSize_enum = 7;
pub const QRCellSampleSize_enum_IMAQ_QR_CELL_SAMPLE_TYPE_SIZE_GUARD: QRCellSampleSize_enum =
	2147483647;
pub type QRCellSampleSize_enum = ::std::os::raw::c_int;
pub use self::QRCellSampleSize_enum as QRCellSampleSize;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_AUTO_DETECT: QRDemodulationMode_enum =
	-2;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_HISTOGRAM: QRDemodulationMode_enum = 0;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_LOCAL_CONTRAST:
	QRDemodulationMode_enum = 1;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_COMBINED: QRDemodulationMode_enum = 2;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_ALL: QRDemodulationMode_enum = 3;
pub const QRDemodulationMode_enum_IMAQ_QR_DEMODULATION_MODE_SIZE_GUARD: QRDemodulationMode_enum =
	2147483647;
pub type QRDemodulationMode_enum = ::std::os::raw::c_int;
pub use self::QRDemodulationMode_enum as QRDemodulationMode;
pub const QRMirrorMode_enum_IMAQ_QR_MIRROR_MODE_AUTO_DETECT: QRMirrorMode_enum = -2;
pub const QRMirrorMode_enum_IMAQ_QR_MIRROR_MODE_MIRRORED: QRMirrorMode_enum = 1;
pub const QRMirrorMode_enum_IMAQ_QR_MIRROR_MODE_NORMAL: QRMirrorMode_enum = 0;
pub const QRMirrorMode_enum_IMAQ_QR_MIRROR_MODE_SIZE_GUARD: QRMirrorMode_enum = 2147483647;
pub type QRMirrorMode_enum = ::std::os::raw::c_int;
pub use self::QRMirrorMode_enum as QRMirrorMode;
pub const QRPolarities_enum_IMAQ_QR_POLARITY_AUTO_DETECT: QRPolarities_enum = -2;
pub const QRPolarities_enum_IMAQ_QR_POLARITY_BLACK_ON_WHITE: QRPolarities_enum = 0;
pub const QRPolarities_enum_IMAQ_QR_POLARITY_WHITE_ON_BLACK: QRPolarities_enum = 1;
pub const QRPolarities_enum_IMAQ_QR_POLARITY_MODE_SIZE_GUARD: QRPolarities_enum = 2147483647;
pub type QRPolarities_enum = ::std::os::raw::c_int;
pub use self::QRPolarities_enum as QRPolarities;
pub const ReadClassifierFileMode_enum_IMAQ_CLASSIFIER_READ_ALL: ReadClassifierFileMode_enum = 0;
pub const ReadClassifierFileMode_enum_IMAQ_CLASSIFIER_READ_SAMPLES: ReadClassifierFileMode_enum = 1;
pub const ReadClassifierFileMode_enum_IMAQ_CLASSIFIER_READ_PROPERTIES: ReadClassifierFileMode_enum =
	2;
pub const ReadClassifierFileMode_enum_IMAQ_READ_CLASSIFIER_FILE_MODES_SIZE_GUARD:
	ReadClassifierFileMode_enum = -1;
pub type ReadClassifierFileMode_enum = ::std::os::raw::c_int;
pub use self::ReadClassifierFileMode_enum as ReadClassifierFileMode;
pub const FindReferenceDirection_enum_IMAQ_LEFT_TO_RIGHT_DIRECT: FindReferenceDirection_enum = 0;
pub const FindReferenceDirection_enum_IMAQ_LEFT_TO_RIGHT_INDIRECT: FindReferenceDirection_enum = 1;
pub const FindReferenceDirection_enum_IMAQ_TOP_TO_BOTTOM_DIRECT: FindReferenceDirection_enum = 2;
pub const FindReferenceDirection_enum_IMAQ_TOP_TO_BOTTOM_INDIRECT: FindReferenceDirection_enum = 3;
pub const FindReferenceDirection_enum_IMAQ_RIGHT_TO_LEFT_DIRECT: FindReferenceDirection_enum = 4;
pub const FindReferenceDirection_enum_IMAQ_RIGHT_TO_LEFT_INDIRECT: FindReferenceDirection_enum = 5;
pub const FindReferenceDirection_enum_IMAQ_BOTTOM_TO_TOP_DIRECT: FindReferenceDirection_enum = 6;
pub const FindReferenceDirection_enum_IMAQ_BOTTOM_TO_TOP_INDIRECT: FindReferenceDirection_enum = 7;
pub const FindReferenceDirection_enum_IMAQ_FIND_COORD_SYS_DIR_SIZE_GUARD:
	FindReferenceDirection_enum = -1;
pub type FindReferenceDirection_enum = ::std::os::raw::c_int;
pub use self::FindReferenceDirection_enum as FindReferenceDirection;
pub const CalibrationThumbnailType_enum_IMAQ_CAMARA_MODEL_TYPE: CalibrationThumbnailType_enum = 0;
pub const CalibrationThumbnailType_enum_IMAQ_PERSPECTIVE_TYPE: CalibrationThumbnailType_enum = 1;
pub const CalibrationThumbnailType_enum_IMAQ_MICRO_PLANE_TYPE: CalibrationThumbnailType_enum = 2;
pub const CalibrationThumbnailType_enum_IMAQ_CALIBRATION_THUMBNAIL_TYPE_SIZE_GUARD:
	CalibrationThumbnailType_enum = -1;
pub type CalibrationThumbnailType_enum = ::std::os::raw::c_int;
pub use self::CalibrationThumbnailType_enum as CalibrationThumbnailType;
pub const StereoBlockMatchMetric_enum_IMAQ_SUM_ABSOLUTE_DIFF: StereoBlockMatchMetric_enum = 0;
pub const StereoBlockMatchMetric_enum_IMAQ_SUM_SQUARED_DIFF: StereoBlockMatchMetric_enum = 1;
pub const StereoBlockMatchMetric_enum_IMAQ_CORRELATION: StereoBlockMatchMetric_enum = 2;
pub const StereoBlockMatchMetric_enum_IMAQ_MATCH_METRIC_IS_AN_INT: StereoBlockMatchMetric_enum = -1;
pub type StereoBlockMatchMetric_enum = ::std::os::raw::c_int;
pub use self::StereoBlockMatchMetric_enum as StereoBlockMatchMetric;
pub const StereoPrefilterType_enum_IMAQ_STEREO_BM_NONE: StereoPrefilterType_enum = 0;
pub const StereoPrefilterType_enum_IMAQ_STEREO_BM_NORMALIZED_RESPONSE: StereoPrefilterType_enum = 1;
pub const StereoPrefilterType_enum_IMAQ_STEREO_BM_XSOBEL: StereoPrefilterType_enum = 2;
pub const StereoPrefilterType_enum_IMAQ_PREFILTER_TYPE_IS_AN_INT: StereoPrefilterType_enum = -1;
pub type StereoPrefilterType_enum = ::std::os::raw::c_int;
pub use self::StereoPrefilterType_enum as StereoPrefilterType;
pub const StereoCameraPosition_enum_IMAQ_STEREO_LEFT: StereoCameraPosition_enum = 0;
pub const StereoCameraPosition_enum_IMAQ_STEREO_RIGHT: StereoCameraPosition_enum = 1;
pub const StereoCameraPosition_enum_IMAQ_STEREO_CENTER: StereoCameraPosition_enum = 2;
pub const StereoCameraPosition_enum_IMAQ_STEREO_CAMERA_POSITION_IS_AN_INT:
	StereoCameraPosition_enum = -1;
pub type StereoCameraPosition_enum = ::std::os::raw::c_int;
pub use self::StereoCameraPosition_enum as StereoCameraPosition;
pub const StereoSessionWriteOptions_enum_IMAQ_KWRITE_OPTIONS_FIRST: StereoSessionWriteOptions_enum =
	-1;
pub const StereoSessionWriteOptions_enum_IMAQ_KFULL: StereoSessionWriteOptions_enum = 0;
pub const StereoSessionWriteOptions_enum_IMAQ_COMPACT: StereoSessionWriteOptions_enum = 1;
pub const StereoSessionWriteOptions_enum_IMAQ_WRITEOPTIONS_LAST: StereoSessionWriteOptions_enum = 2;
pub const StereoSessionWriteOptions_enum_IMAQ_SURE_WRITEOPTIONS_IS_AN_INT:
	StereoSessionWriteOptions_enum = 2147483647;
pub type StereoSessionWriteOptions_enum = ::std::os::raw::c_int;
pub use self::StereoSessionWriteOptions_enum as StereoSessionWriteOptions;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_START_OF_PROCESSING:
	DataMatrixAdvancedProcessing_enum = -1;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_LINE_DETECTION: DataMatrixAdvancedProcessing_enum =
	0;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_HIGHLIGHT_FILTER:
	DataMatrixAdvancedProcessing_enum = 1;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_AGGRESSIVE_PROCESSING:
	DataMatrixAdvancedProcessing_enum = 2;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_ENABLEFNC1: DataMatrixAdvancedProcessing_enum = 3;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_REFINE_BOUNDING_BOX:
	DataMatrixAdvancedProcessing_enum = 4;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_END_OF_PROCESSING:
	DataMatrixAdvancedProcessing_enum = 5;
pub const DataMatrixAdvancedProcessing_enum_IMAQ_MAKE_SURE_ADVANCEDPROCESSING_IS_AN_INT:
	DataMatrixAdvancedProcessing_enum = 2147483647;
pub type DataMatrixAdvancedProcessing_enum = ::std::os::raw::c_int;
pub use self::DataMatrixAdvancedProcessing_enum as DataMatrixAdvancedProcessing;
pub const RadialCoefficients_enum_IMAQ_COEFF_K1: RadialCoefficients_enum = 0;
pub const RadialCoefficients_enum_IMAQ_COEFF_K1_K2_K3: RadialCoefficients_enum = 1;
pub const RadialCoefficients_enum_IMAQ_COEFF_K1_K2_K3_K4_K5: RadialCoefficients_enum = 2;
pub const RadialCoefficients_enum_IMAQ_COEFF_SIZE_GUARD: RadialCoefficients_enum = -1;
pub type RadialCoefficients_enum = ::std::os::raw::c_int;
pub use self::RadialCoefficients_enum as RadialCoefficients;
pub const CalibrationMode2_enum_IMAQ_PERSPECTIVE_MODE: CalibrationMode2_enum = 0;
pub const CalibrationMode2_enum_IMAQ_MICROPLANE_MODE: CalibrationMode2_enum = 1;
pub const CalibrationMode2_enum_IMAQ_SIMPLE_CALIBRATION_MODE: CalibrationMode2_enum = 2;
pub const CalibrationMode2_enum_IMAQ_CORRECTED_IMAGE_MODE: CalibrationMode2_enum = 3;
pub const CalibrationMode2_enum_IMAQ_NO_CALIBRATION_MODE: CalibrationMode2_enum = 4;
pub const CalibrationMode2_enum_IMAQ_CALIBRATION_MODE2_SIZE_GUARD: CalibrationMode2_enum = -1;
pub type CalibrationMode2_enum = ::std::os::raw::c_int;
pub use self::CalibrationMode2_enum as CalibrationMode2;
pub const ParticleClassifierThresholdType_enum_IMAQ_THRESHOLD_MANUAL:
	ParticleClassifierThresholdType_enum = 0;
pub const ParticleClassifierThresholdType_enum_IMAQ_THRESHOLD_AUTO:
	ParticleClassifierThresholdType_enum = 1;
pub const ParticleClassifierThresholdType_enum_IMAQ_THRESHOLD_LOCAL:
	ParticleClassifierThresholdType_enum = 2;
pub const ParticleClassifierThresholdType_enum_IMAQ_PARTICLECLASSIFIER_THRESHOLDTYPE_SIZE_GUARD:
	ParticleClassifierThresholdType_enum = -1;
pub type ParticleClassifierThresholdType_enum = ::std::os::raw::c_int;
pub use self::ParticleClassifierThresholdType_enum as ParticleClassifierThresholdType;
pub const DistortionModel_enum_IMAQ_NO_DISTORTION_MODEL: DistortionModel_enum = -1;
pub const DistortionModel_enum_IMAQ_POLYNOMIAL_MODEL: DistortionModel_enum = 0;
pub const DistortionModel_enum_IMAQ_DIVISION_MODEL: DistortionModel_enum = 1;
pub const DistortionModel_enum_IMAQ_DISTORTION_MODEL_SIZE_GUARD: DistortionModel_enum = 2147483647;
pub type DistortionModel_enum = ::std::os::raw::c_int;
pub use self::DistortionModel_enum as DistortionModel;
pub const StraightEdgeSearchMode_enum_IMAQ_USE_FIRST_RAKE_EDGES: StraightEdgeSearchMode_enum = 0;
pub const StraightEdgeSearchMode_enum_IMAQ_USE_BEST_RAKE_EDGES: StraightEdgeSearchMode_enum = 1;
pub const StraightEdgeSearchMode_enum_IMAQ_USE_BEST_HOUGH_LINE: StraightEdgeSearchMode_enum = 2;
pub const StraightEdgeSearchMode_enum_IMAQ_USE_FIRST_PROJECTION_EDGE: StraightEdgeSearchMode_enum =
	3;
pub const StraightEdgeSearchMode_enum_IMAQ_USE_BEST_PROJECTION_EDGE: StraightEdgeSearchMode_enum =
	4;
pub const StraightEdgeSearchMode_enum_IMAQ_STRAIGHT_EDGE_SEARCH_SIZE_GUARD:
	StraightEdgeSearchMode_enum = -1;
pub type StraightEdgeSearchMode_enum = ::std::os::raw::c_int;
pub use self::StraightEdgeSearchMode_enum as StraightEdgeSearchMode;
pub const SettingType_enum_IMAQ_ROTATION_ANGLE_RANGE: SettingType_enum = 0;
pub const SettingType_enum_IMAQ_SCALE_RANGE: SettingType_enum = 1;
pub const SettingType_enum_IMAQ_OCCLUSION_RANGE: SettingType_enum = 2;
pub const SettingType_enum_IMAQ_SETTING_TYPE_SIZE_GUARD: SettingType_enum = -1;
pub type SettingType_enum = ::std::os::raw::c_int;
pub use self::SettingType_enum as SettingType;
pub const SegmentationDistanceLevel_enum_IMAQ_SEGMENTATION_LEVEL_CONSERVATIVE:
	SegmentationDistanceLevel_enum = 0;
pub const SegmentationDistanceLevel_enum_IMAQ_SEGMENTATION_LEVEL_AGGRESSIVE:
	SegmentationDistanceLevel_enum = 1;
pub const SegmentationDistanceLevel_enum_IMAQ_SEGMENTATION_LEVEL_SIZE_GUARD:
	SegmentationDistanceLevel_enum = -1;
pub type SegmentationDistanceLevel_enum = ::std::os::raw::c_int;
pub use self::SegmentationDistanceLevel_enum as SegmentationDistanceLevel;
pub const ExtractContourSelection_enum_IMAQ_CLOSEST: ExtractContourSelection_enum = 0;
pub const ExtractContourSelection_enum_IMAQ_LONGEST: ExtractContourSelection_enum = 1;
pub const ExtractContourSelection_enum_IMAQ_STRONGEST: ExtractContourSelection_enum = 2;
pub const ExtractContourSelection_enum_IMAQ_EXTRACT_CONTOUR_SELECTION_SIZE_GUARD:
	ExtractContourSelection_enum = -1;
pub type ExtractContourSelection_enum = ::std::os::raw::c_int;
pub use self::ExtractContourSelection_enum as ExtractContourSelection;
pub const ConnectionConstraintType_enum_IMAQ_DISTANCE_CONSTRAINT: ConnectionConstraintType_enum = 0;
pub const ConnectionConstraintType_enum_IMAQ_ANGLE_CONSTRAINT: ConnectionConstraintType_enum = 1;
pub const ConnectionConstraintType_enum_IMAQ_CONNECTIVITY_CONSTRAINT:
	ConnectionConstraintType_enum = 2;
pub const ConnectionConstraintType_enum_IMAQ_GRADIENT_CONSTRAINT: ConnectionConstraintType_enum = 3;
pub const ConnectionConstraintType_enum_IMAQ_NUM_CONNECTION_CONSTRAINT_TYPES:
	ConnectionConstraintType_enum = 4;
pub const ConnectionConstraintType_enum_IMAQ_CONNECTION_CONSTRAINT_SIZE_GUARD:
	ConnectionConstraintType_enum = -1;
pub type ConnectionConstraintType_enum = ::std::os::raw::c_int;
pub use self::ConnectionConstraintType_enum as ConnectionConstraintType;
pub const ExtractContourDirection_enum_IMAQ_RECT_LEFT_RIGHT: ExtractContourDirection_enum = 0;
pub const ExtractContourDirection_enum_IMAQ_RECT_RIGHT_LEFT: ExtractContourDirection_enum = 1;
pub const ExtractContourDirection_enum_IMAQ_RECT_TOP_BOTTOM: ExtractContourDirection_enum = 2;
pub const ExtractContourDirection_enum_IMAQ_RECT_BOTTOM_TOP: ExtractContourDirection_enum = 3;
pub const ExtractContourDirection_enum_IMAQ_ANNULUS_INNER_OUTER: ExtractContourDirection_enum = 4;
pub const ExtractContourDirection_enum_IMAQ_ANNULUS_OUTER_INNER: ExtractContourDirection_enum = 5;
pub const ExtractContourDirection_enum_IMAQ_ANNULUS_START_STOP: ExtractContourDirection_enum = 6;
pub const ExtractContourDirection_enum_IMAQ_ANNULUS_STOP_START: ExtractContourDirection_enum = 7;
pub const ExtractContourDirection_enum_IMAQ_EXTRACT_CONTOUR_DIRECTION_SIZE_GUARD:
	ExtractContourDirection_enum = -1;
pub type ExtractContourDirection_enum = ::std::os::raw::c_int;
pub use self::ExtractContourDirection_enum as ExtractContourDirection;
pub const RakeProcessType_enum_IMAQ_GET_FIRST_EDGES: RakeProcessType_enum = 0;
pub const RakeProcessType_enum_IMAQ_GET_FIRST_AND_LAST_EDGES: RakeProcessType_enum = 1;
pub const RakeProcessType_enum_IMAQ_GET_ALL_EDGES: RakeProcessType_enum = 2;
pub const RakeProcessType_enum_IMAQ_GET_BEST_EDGES: RakeProcessType_enum = 3;
pub const RakeProcessType_enum_IMAQ_RAKE_PROCESS_TYPE_SIZE_GUARD: RakeProcessType_enum = -1;
pub type RakeProcessType_enum = ::std::os::raw::c_int;
pub use self::RakeProcessType_enum as RakeProcessType;
pub const Connectivity_enum_IMAQ_FOUR_CONNECTED: Connectivity_enum = 0;
pub const Connectivity_enum_IMAQ_EIGHT_CONNECTED: Connectivity_enum = 1;
pub const Connectivity_enum_IMAQ_CONNECTIVITY_SIZE_GUARD: Connectivity_enum = -1;
pub type Connectivity_enum = ::std::os::raw::c_int;
pub use self::Connectivity_enum as Connectivity;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_SUBPIXEL_ACCURACY: GeometricSetupDataItem_enum =
	10;
pub const GeometricSetupDataItem_enum_IMAQ_SUBPIXEL_ITERATIONS: GeometricSetupDataItem_enum = 11;
pub const GeometricSetupDataItem_enum_IMAQ_SUBPIXEL_TOLERANCE: GeometricSetupDataItem_enum = 12;
pub const GeometricSetupDataItem_enum_IMAQ_INITIAL_MATCH_LIST_LENGTH: GeometricSetupDataItem_enum =
	13;
pub const GeometricSetupDataItem_enum_IMAQ_MINIMUM_MATCH_SEPARATION_DISTANCE:
	GeometricSetupDataItem_enum = 15;
pub const GeometricSetupDataItem_enum_IMAQ_MINIMUM_MATCH_SEPARATION_ANGLE:
	GeometricSetupDataItem_enum = 16;
pub const GeometricSetupDataItem_enum_IMAQ_MINIMUM_MATCH_SEPARATION_SCALE:
	GeometricSetupDataItem_enum = 17;
pub const GeometricSetupDataItem_enum_IMAQ_MAXIMUM_MATCH_OVERLAP: GeometricSetupDataItem_enum = 18;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_COARSE_RESULT: GeometricSetupDataItem_enum = 19;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_CALIBRATION_SUPPORT: GeometricSetupDataItem_enum =
	20;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_CONTRAST_REVERSAL: GeometricSetupDataItem_enum =
	21;
pub const GeometricSetupDataItem_enum_IMAQ_SEARCH_STRATEGY: GeometricSetupDataItem_enum = 22;
pub const GeometricSetupDataItem_enum_IMAQ_REFINEMENT_MATCH_FACTOR: GeometricSetupDataItem_enum =
	23;
pub const GeometricSetupDataItem_enum_IMAQ_SUBPIXEL_MATCH_FACTOR: GeometricSetupDataItem_enum = 24;
pub const GeometricSetupDataItem_enum_IMAQ_MAX_REFINEMENT_ITERATIONS: GeometricSetupDataItem_enum =
	25;
pub const GeometricSetupDataItem_enum_IMAQ_SCORING_METHOD: GeometricSetupDataItem_enum = 26;
pub const GeometricSetupDataItem_enum_IMAQ_INITIAL_MATCH_ANGULAR_ACCURACY:
	GeometricSetupDataItem_enum = 27;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_EXTRACTION_MODE: GeometricSetupDataItem_enum = 0;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_EDGE_THRSHOLD: GeometricSetupDataItem_enum = 1;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_EDGE_FILTER: GeometricSetupDataItem_enum = 2;
pub const GeometricSetupDataItem_enum_IMAQ_MINIMUM_CURVE_LENGTH: GeometricSetupDataItem_enum = 3;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_ROW_SEARCH_STEP_SIZE: GeometricSetupDataItem_enum =
	4;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_COL_SEARCH_STEP_SIZE: GeometricSetupDataItem_enum =
	5;
pub const GeometricSetupDataItem_enum_IMAQ_CURVE_MAX_END_POINT_GAP: GeometricSetupDataItem_enum = 6;
pub const GeometricSetupDataItem_enum_IMAQ_EXTRACT_CLOSED_CURVES: GeometricSetupDataItem_enum = 7;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_SUBPIXEL_CURVE_EXTRACTION:
	GeometricSetupDataItem_enum = 8;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_CORRELATION_SCORE: GeometricSetupDataItem_enum =
	9;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_TARGET_TEMPLATE_CURVESCORE:
	GeometricSetupDataItem_enum = 14;
pub const GeometricSetupDataItem_enum_IMAQ_ENABLE_DEFECT_MAP: GeometricSetupDataItem_enum = 28;
pub const GeometricSetupDataItem_enum_IMAQ_GEOMETRIC_SETUPDATA_ITEMSIZE_GUARD:
	GeometricSetupDataItem_enum = -1;
pub type GeometricSetupDataItem_enum = ::std::os::raw::c_int;
pub use self::GeometricSetupDataItem_enum as GeometricSetupDataItem;
pub const DataMatrixSubtype_enum_IMAQ_ALL_DATA_MATRIX_SUBTYPES: DataMatrixSubtype_enum = 0;
pub const DataMatrixSubtype_enum_IMAQ_DATA_MATRIX_SUBTYPES_ECC_000_ECC_140: DataMatrixSubtype_enum =
	1;
pub const DataMatrixSubtype_enum_IMAQ_DATA_MATRIX_SUBTYPE_ECC_200: DataMatrixSubtype_enum = 2;
pub const DataMatrixSubtype_enum_IMAQ_DATA_MATRIX_SUBTYPE_SIZE_GUARD: DataMatrixSubtype_enum = -1;
pub type DataMatrixSubtype_enum = ::std::os::raw::c_int;
pub use self::DataMatrixSubtype_enum as DataMatrixSubtype;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_UNLIMITED: QRRotationMode_enum = 0;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_0_DEGREES: QRRotationMode_enum = 1;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_90_DEGREES: QRRotationMode_enum = 2;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_180_DEGREES: QRRotationMode_enum = 3;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_270_DEGREES: QRRotationMode_enum = 4;
pub const QRRotationMode_enum_IMAQ_QR_ROTATION_MODE_SIZE_GUARD: QRRotationMode_enum = -1;
pub type QRRotationMode_enum = ::std::os::raw::c_int;
pub use self::QRRotationMode_enum as QRRotationMode;
pub const FlattenType_enum_IMAQ_FLATTEN_IMAGE: FlattenType_enum = 0;
pub const FlattenType_enum_IMAQ_FLATTEN_IMAGE_AND_VISION_INFO: FlattenType_enum = 1;
pub const FlattenType_enum_IMAQ_FLATTEN_TYPE_SIZE_GUARD: FlattenType_enum = -1;
pub type FlattenType_enum = ::std::os::raw::c_int;
pub use self::FlattenType_enum as FlattenType;
pub const LocalThresholdMethod_enum_IMAQ_NIBLACK: LocalThresholdMethod_enum = 0;
pub const LocalThresholdMethod_enum_IMAQ_BACKGROUND_CORRECTION: LocalThresholdMethod_enum = 1;
pub const LocalThresholdMethod_enum_IMAQ_SAUVOLA: LocalThresholdMethod_enum = 2;
pub const LocalThresholdMethod_enum_IMAQ_MODIFIED_SAUVOLA: LocalThresholdMethod_enum = 3;
pub const LocalThresholdMethod_enum_IMAQ_LOCAL_THRESHOLD_METHOD_SIZE_GUARD:
	LocalThresholdMethod_enum = -1;
pub type LocalThresholdMethod_enum = ::std::os::raw::c_int;
pub use self::LocalThresholdMethod_enum as LocalThresholdMethod;
pub const FeatureType_enum_IMAQ_NOT_FOUND_FEATURE: FeatureType_enum = 0;
pub const FeatureType_enum_IMAQ_CIRCLE_FEATURE: FeatureType_enum = 1;
pub const FeatureType_enum_IMAQ_ELLIPSE_FEATURE: FeatureType_enum = 2;
pub const FeatureType_enum_IMAQ_CONST_CURVE_FEATURE: FeatureType_enum = 3;
pub const FeatureType_enum_IMAQ_RECTANGLE_FEATURE: FeatureType_enum = 4;
pub const FeatureType_enum_IMAQ_LEG_FEATURE: FeatureType_enum = 5;
pub const FeatureType_enum_IMAQ_CORNER_FEATURE: FeatureType_enum = 6;
pub const FeatureType_enum_IMAQ_PARALLEL_LINE_PAIR_FEATURE: FeatureType_enum = 7;
pub const FeatureType_enum_IMAQ_PAIR_OF_PARALLEL_LINE_PAIRS_FEATURE: FeatureType_enum = 8;
pub const FeatureType_enum_IMAQ_LINE_FEATURE: FeatureType_enum = 9;
pub const FeatureType_enum_IMAQ_CLOSED_CURVE_FEATURE: FeatureType_enum = 10;
pub const FeatureType_enum_IMAQ_FEATURE_TYPE_SIZE_GUARD: FeatureType_enum = -1;
pub type FeatureType_enum = ::std::os::raw::c_int;
pub use self::FeatureType_enum as FeatureType;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_HORIZONTAL:
	WindowBackgroundHatchStyle_enum = 0;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_VERTICAL:
	WindowBackgroundHatchStyle_enum = 1;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_FORWARD_DIAGONAL:
	WindowBackgroundHatchStyle_enum = 2;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_BACKWARD_DIAGONAL:
	WindowBackgroundHatchStyle_enum = 3;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_CROSS: WindowBackgroundHatchStyle_enum =
	4;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_CROSS_HATCH:
	WindowBackgroundHatchStyle_enum = 5;
pub const WindowBackgroundHatchStyle_enum_IMAQ_HATCH_STYLE_SIZE_GUARD:
	WindowBackgroundHatchStyle_enum = -1;
pub type WindowBackgroundHatchStyle_enum = ::std::os::raw::c_int;
pub use self::WindowBackgroundHatchStyle_enum as WindowBackgroundHatchStyle;
pub const WindowBackgroundFillStyle_enum_IMAQ_FILL_STYLE_SOLID: WindowBackgroundFillStyle_enum = 0;
pub const WindowBackgroundFillStyle_enum_IMAQ_FILL_STYLE_HATCH: WindowBackgroundFillStyle_enum = 2;
pub const WindowBackgroundFillStyle_enum_IMAQ_FILL_STYLE_DEFAULT: WindowBackgroundFillStyle_enum =
	3;
pub const WindowBackgroundFillStyle_enum_IMAQ_FILL_STYLE_SIZE_GUARD:
	WindowBackgroundFillStyle_enum = -1;
pub type WindowBackgroundFillStyle_enum = ::std::os::raw::c_int;
pub use self::WindowBackgroundFillStyle_enum as WindowBackgroundFillStyle;
pub const ExtractionMode_enum_IMAQ_NORMAL_IMAGE: ExtractionMode_enum = 0;
pub const ExtractionMode_enum_IMAQ_UNIFORM_REGIONS: ExtractionMode_enum = 1;
pub const ExtractionMode_enum_IMAQ_EXTRACTION_MODE_SIZE_GUARD: ExtractionMode_enum = -1;
pub type ExtractionMode_enum = ::std::os::raw::c_int;
pub use self::ExtractionMode_enum as ExtractionMode;
pub const LinearAveragesMode_enum_IMAQ_COLUMN_AVERAGES: LinearAveragesMode_enum = 1;
pub const LinearAveragesMode_enum_IMAQ_ROW_AVERAGES: LinearAveragesMode_enum = 2;
pub const LinearAveragesMode_enum_IMAQ_RISING_DIAGONAL_AVERAGES: LinearAveragesMode_enum = 4;
pub const LinearAveragesMode_enum_IMAQ_FALLING_DIAGONAL_AVERAGES: LinearAveragesMode_enum = 8;
pub const LinearAveragesMode_enum_IMAQ_ALL_LINEAR_AVERAGES: LinearAveragesMode_enum = 15;
pub const LinearAveragesMode_enum_IMAQ_LINEAR_AVERAGES_MODE_SIZE_GUARD: LinearAveragesMode_enum =
	-1;
pub type LinearAveragesMode_enum = ::std::os::raw::c_int;
pub use self::LinearAveragesMode_enum as LinearAveragesMode;
pub const Barcode2DSearchMode_enum_IMAQ_SEARCH_MULTIPLE: Barcode2DSearchMode_enum = 0;
pub const Barcode2DSearchMode_enum_IMAQ_SEARCH_SINGLE_CONSERVATIVE: Barcode2DSearchMode_enum = 1;
pub const Barcode2DSearchMode_enum_IMAQ_SEARCH_SINGLE_AGGRESSIVE: Barcode2DSearchMode_enum = 2;
pub const Barcode2DSearchMode_enum_IMAQ_BARCODE_2D_SEARCH_MODE_SIZE_GUARD:
	Barcode2DSearchMode_enum = -1;
pub type Barcode2DSearchMode_enum = ::std::os::raw::c_int;
pub use self::Barcode2DSearchMode_enum as Barcode2DSearchMode;
pub const RegistrationMethod_enum_IMAQ_REGISTRATION_NONE: RegistrationMethod_enum = 0;
pub const RegistrationMethod_enum_IMAQ_REGISTRATION_PERSPECTIVE: RegistrationMethod_enum = 1;
pub const RegistrationMethod_enum_IMAQ_REGISTRATION_SIZE_GUARD: RegistrationMethod_enum = -1;
pub type RegistrationMethod_enum = ::std::os::raw::c_int;
pub use self::RegistrationMethod_enum as RegistrationMethod;
pub const Barcode2DShape_enum_IMAQ_SQUARE_BARCODE_2D: Barcode2DShape_enum = 0;
pub const Barcode2DShape_enum_IMAQ_RECTANGULAR_BARCODE_2D: Barcode2DShape_enum = 1;
pub const Barcode2DShape_enum_IMAQ_BARCODE_2D_SHAPE_SIZE_GUARD: Barcode2DShape_enum = -1;
pub type Barcode2DShape_enum = ::std::os::raw::c_int;
pub use self::Barcode2DShape_enum as Barcode2DShape;
pub const Barcode2DCellShape_enum_IMAQ_SQUARE_CELLS: Barcode2DCellShape_enum = 0;
pub const Barcode2DCellShape_enum_IMAQ_ROUND_CELLS: Barcode2DCellShape_enum = 1;
pub const Barcode2DCellShape_enum_IMAQ_BARCODE_2D_CELL_SHAPE_SIZE_GUARD: Barcode2DCellShape_enum =
	-1;
pub type Barcode2DCellShape_enum = ::std::os::raw::c_int;
pub use self::Barcode2DCellShape_enum as Barcode2DCellShape;
pub const Barcode2DContrast_enum_IMAQ_ALL_BARCODE_2D_CONTRASTS: Barcode2DContrast_enum = 0;
pub const Barcode2DContrast_enum_IMAQ_BLACK_ON_WHITE_BARCODE_2D: Barcode2DContrast_enum = 1;
pub const Barcode2DContrast_enum_IMAQ_WHITE_ON_BLACK_BARCODE_2D: Barcode2DContrast_enum = 2;
pub const Barcode2DContrast_enum_IMAQ_BARCODE_2D_CONTRAST_SIZE_GUARD: Barcode2DContrast_enum = -1;
pub type Barcode2DContrast_enum = ::std::os::raw::c_int;
pub use self::Barcode2DContrast_enum as Barcode2DContrast;
pub const Barcode2DType_enum_IMAQ_PDF417: Barcode2DType_enum = 0;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_000: Barcode2DType_enum = 1;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_050: Barcode2DType_enum = 2;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_080: Barcode2DType_enum = 3;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_100: Barcode2DType_enum = 4;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_140: Barcode2DType_enum = 5;
pub const Barcode2DType_enum_IMAQ_DATA_MATRIX_ECC_200: Barcode2DType_enum = 6;
pub const Barcode2DType_enum_IMAQ_BARCODE_2D_TYPE_SIZE_GUARD: Barcode2DType_enum = -1;
pub type Barcode2DType_enum = ::std::os::raw::c_int;
pub use self::Barcode2DType_enum as Barcode2DType;
pub const ClassifierEngineType_enum_IMAQ_ENGINE_NONE: ClassifierEngineType_enum = 0;
pub const ClassifierEngineType_enum_IMAQ_ENGINE_NEAREST_NEIGHBOR: ClassifierEngineType_enum = 1;
pub const ClassifierEngineType_enum_IMAQ_ENGINE_SUPPORT_VECTOR_MACHINE: ClassifierEngineType_enum =
	2;
pub const ClassifierEngineType_enum_IMAQ_CLASSIFIER_ENGINE_TYPE_SIZE_GUARD:
	ClassifierEngineType_enum = -1;
pub type ClassifierEngineType_enum = ::std::os::raw::c_int;
pub use self::ClassifierEngineType_enum as ClassifierEngineType;
pub const ClassifierType_enum_IMAQ_CLASSIFIER_CUSTOM: ClassifierType_enum = 0;
pub const ClassifierType_enum_IMAQ_CLASSIFIER_PARTICLE: ClassifierType_enum = 1;
pub const ClassifierType_enum_IMAQ_CLASSIFIER_COLOR: ClassifierType_enum = 2;
pub const ClassifierType_enum_IMAQ_CLASSIFIER_TEXTURE: ClassifierType_enum = 3;
pub const ClassifierType_enum_IMAQ_CLASSIFIER_TYPE_SIZE_GUARD: ClassifierType_enum = -1;
pub type ClassifierType_enum = ::std::os::raw::c_int;
pub use self::ClassifierType_enum as ClassifierType;
pub const StereoInterpolationType_enum_IMAQ_KIPTYPEZEROORDER: StereoInterpolationType_enum = 0;
pub const StereoInterpolationType_enum_IMAQ_KIPTYPEBILINEAR: StereoInterpolationType_enum = 1;
pub const StereoInterpolationType_enum_IMAQ_KIPTYPEQUADRATIC: StereoInterpolationType_enum = 2;
pub const StereoInterpolationType_enum_IMAQ_kIPTYPECUBICSPLINE: StereoInterpolationType_enum = 3;
pub const StereoInterpolationType_enum_IMAQ_KIPTYPEBILINEARFIXED: StereoInterpolationType_enum = 4;
pub const StereoInterpolationType_enum_IMAQ_INTERPLOATION_IS_AN_INT: StereoInterpolationType_enum =
	888;
pub type StereoInterpolationType_enum = ::std::os::raw::c_int;
pub use self::StereoInterpolationType_enum as StereoInterpolationType;
pub const EdgeFilterSize_enum_IMAQ_FINE: EdgeFilterSize_enum = 0;
pub const EdgeFilterSize_enum_IMAQ_NORMAL: EdgeFilterSize_enum = 1;
pub const EdgeFilterSize_enum_IMAQ_CONTOUR_TRACING: EdgeFilterSize_enum = 2;
pub const EdgeFilterSize_enum_IMAQ_EDGE_FILTER_SIZE_SIZE_GUARD: EdgeFilterSize_enum = -1;
pub type EdgeFilterSize_enum = ::std::os::raw::c_int;
pub use self::EdgeFilterSize_enum as EdgeFilterSize;
pub const DataMatrixPolarity_enum_IMAQ_AUTO_DETECT_POLARITY: DataMatrixPolarity_enum = -2;
pub const DataMatrixPolarity_enum_IMAQ_BLACK_DATA_ON_WHITE_BACKGROUND: DataMatrixPolarity_enum = 0;
pub const DataMatrixPolarity_enum_IMAQ_WHITE_DATA_ON_BLACK_BACKGROUND: DataMatrixPolarity_enum = 1;
pub const DataMatrixPolarity_enum_IMAQ_DATA_MATRIX_POLARITY_SIZE_GUARD: DataMatrixPolarity_enum =
	2147483647;
pub type DataMatrixPolarity_enum = ::std::os::raw::c_int;
pub use self::DataMatrixPolarity_enum as DataMatrixPolarity;
pub const SearchDirection_enum_IMAQ_SEARCH_DIRECTION_LEFT_TO_RIGHT: SearchDirection_enum = 0;
pub const SearchDirection_enum_IMAQ_SEARCH_DIRECTION_RIGHT_TO_LEFT: SearchDirection_enum = 1;
pub const SearchDirection_enum_IMAQ_SEARCH_DIRECTION_TOP_TO_BOTTOM: SearchDirection_enum = 2;
pub const SearchDirection_enum_IMAQ_SEARCH_DIRECTION_BOTTOM_TO_TOP: SearchDirection_enum = 3;
pub const SearchDirection_enum_IMAQ_SEARCH_DIRECTION_SIZE_GUARD: SearchDirection_enum = -1;
pub type SearchDirection_enum = ::std::os::raw::c_int;
pub use self::SearchDirection_enum as SearchDirection;
pub const QRStreamMode_enum_IMAQ_QR_MODE_NUMERIC: QRStreamMode_enum = 0;
pub const QRStreamMode_enum_IMAQ_QR_MODE_ALPHANUMERIC: QRStreamMode_enum = 1;
pub const QRStreamMode_enum_IMAQ_QR_MODE_RAW_BYTE: QRStreamMode_enum = 2;
pub const QRStreamMode_enum_IMAQ_QR_MODE_EAN128_TOKEN: QRStreamMode_enum = 3;
pub const QRStreamMode_enum_IMAQ_QR_MODE_EAN128_DATA: QRStreamMode_enum = 4;
pub const QRStreamMode_enum_IMAQ_QR_MODE_ECI: QRStreamMode_enum = 5;
pub const QRStreamMode_enum_IMAQ_QR_MODE_KANJI: QRStreamMode_enum = 6;
pub const QRStreamMode_enum_IMAQ_QR_MODE_SIZE_GUARD: QRStreamMode_enum = -1;
pub type QRStreamMode_enum = ::std::os::raw::c_int;
pub use self::QRStreamMode_enum as QRStreamMode;
pub const QRModelType_enum_IMAQ_QR_MODELTYPE_AUTO_DETECT: QRModelType_enum = 0;
pub const QRModelType_enum_IMAQ_QR_MODELTYPE_MICRO: QRModelType_enum = 1;
pub const QRModelType_enum_IMAQ_QR_MODELTYPE_MODEL1: QRModelType_enum = 2;
pub const QRModelType_enum_IMAQ_QR_MODELTYPE_MODEL2: QRModelType_enum = 3;
pub const QRModelType_enum_IMAQ_QR_MODEL_TYPE_SIZE_GUARD: QRModelType_enum = -1;
pub type QRModelType_enum = ::std::os::raw::c_int;
pub use self::QRModelType_enum as QRModelType;
pub const ColumnProcessingMode_enum_IMAQ_AVERAGE_COLUMNS: ColumnProcessingMode_enum = 0;
pub const ColumnProcessingMode_enum_IMAQ_MEDIAN_COLUMNS: ColumnProcessingMode_enum = 1;
pub const ColumnProcessingMode_enum_IMAQ_COLUMN_PROCESSING_MODE_SIZE_GUARD:
	ColumnProcessingMode_enum = -1;
pub type ColumnProcessingMode_enum = ::std::os::raw::c_int;
pub use self::ColumnProcessingMode_enum as ColumnProcessingMode;
pub const EdgePolaritySearchMode_enum_IMAQ_SEARCH_FOR_ALL_EDGES: EdgePolaritySearchMode_enum = 0;
pub const EdgePolaritySearchMode_enum_IMAQ_SEARCH_FOR_RISING_EDGES: EdgePolaritySearchMode_enum = 1;
pub const EdgePolaritySearchMode_enum_IMAQ_SEARCH_FOR_FALLING_EDGES: EdgePolaritySearchMode_enum =
	2;
pub const EdgePolaritySearchMode_enum_IMAQ_EDGE_POLARITY_MODE_SIZE_GUARD:
	EdgePolaritySearchMode_enum = -1;
pub type EdgePolaritySearchMode_enum = ::std::os::raw::c_int;
pub use self::EdgePolaritySearchMode_enum as EdgePolaritySearchMode;
pub const AIMGrade_enum_IMAQ_AIM_GRADE_F: AIMGrade_enum = 0;
pub const AIMGrade_enum_IMAQ_AIM_GRADE_D: AIMGrade_enum = 1;
pub const AIMGrade_enum_IMAQ_AIM_GRADE_C: AIMGrade_enum = 2;
pub const AIMGrade_enum_IMAQ_AIM_GRADE_B: AIMGrade_enum = 3;
pub const AIMGrade_enum_IMAQ_AIM_GRADE_A: AIMGrade_enum = 4;
pub const AIMGrade_enum_IMAQ_DATA_MATRIX_AIM_GRADE_SIZE_GUARD: AIMGrade_enum = -1;
pub type AIMGrade_enum = ::std::os::raw::c_int;
pub use self::AIMGrade_enum as AIMGrade;
pub const DataMatrixCellFillMode_enum_IMAQ_AUTO_DETECT_CELL_FILL_MODE: DataMatrixCellFillMode_enum =
	-2;
pub const DataMatrixCellFillMode_enum_IMAQ_LOW_FILL: DataMatrixCellFillMode_enum = 0;
pub const DataMatrixCellFillMode_enum_IMAQ_NORMAL_FILL: DataMatrixCellFillMode_enum = 1;
pub const DataMatrixCellFillMode_enum_IMAQ_DATA_MATRIX_CELL_FILL_MODE_SIZE_GUARD:
	DataMatrixCellFillMode_enum = 2147483647;
pub type DataMatrixCellFillMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixCellFillMode_enum as DataMatrixCellFillMode;
pub const CompressionType_enum_IMAQ_COMPRESSION_NONE: CompressionType_enum = 0;
pub const CompressionType_enum_IMAQ_COMPRESSION_JPEG: CompressionType_enum = 1;
pub const CompressionType_enum_IMAQ_COMPRESSION_PACKED_BINARY: CompressionType_enum = 2;
pub const CompressionType_enum_IMAQ_COMPRESSION_TYPE_SIZE_GUARD: CompressionType_enum = -1;
pub type CompressionType_enum = ::std::os::raw::c_int;
pub use self::CompressionType_enum as CompressionType;
pub const DataMatrixECC_enum_IMAQ_AUTO_DETECT_ECC: DataMatrixECC_enum = -2;
pub const DataMatrixECC_enum_IMAQ_ECC_000: DataMatrixECC_enum = 0;
pub const DataMatrixECC_enum_IMAQ_ECC_050: DataMatrixECC_enum = 50;
pub const DataMatrixECC_enum_IMAQ_ECC_080: DataMatrixECC_enum = 80;
pub const DataMatrixECC_enum_IMAQ_ECC_100: DataMatrixECC_enum = 100;
pub const DataMatrixECC_enum_IMAQ_ECC_140: DataMatrixECC_enum = 140;
pub const DataMatrixECC_enum_IMAQ_ECC_000_140: DataMatrixECC_enum = 190;
pub const DataMatrixECC_enum_IMAQ_ECC_200: DataMatrixECC_enum = 200;
pub const DataMatrixECC_enum_IMAQ_DATA_MATRIX_ECC_SIZE_GUARD: DataMatrixECC_enum = 2147483647;
pub type DataMatrixECC_enum = ::std::os::raw::c_int;
pub use self::DataMatrixECC_enum as DataMatrixECC;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_CALIBRATION: VisionInfoType2_enum = 1;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_OVERLAY: VisionInfoType2_enum = 2;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_GRAYTEMPLATE: VisionInfoType2_enum = 4;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_COLORTEMPLATE: VisionInfoType2_enum = 8;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_GEOMETRICTEMPLATE: VisionInfoType2_enum = 16;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_CUSTOMDATA: VisionInfoType2_enum = 32;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_GOLDENTEMPLATE: VisionInfoType2_enum = 64;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_GEOMETRICTEMPLATE2: VisionInfoType2_enum = 128;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_CONTOURDATA: VisionInfoType2_enum = 256;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_CAMERAMODEL: VisionInfoType2_enum = 512;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_PYRAMIDGRAYVALUETEMPLATE: VisionInfoType2_enum =
	1024;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_PYRAMIDGRADIENTTEMPLATE: VisionInfoType2_enum = 2048;
pub const VisionInfoType2_enum_IMAQ_VISIONINFO_ALL: VisionInfoType2_enum = -1;
pub type VisionInfoType2_enum = ::std::os::raw::c_int;
pub use self::VisionInfoType2_enum as VisionInfoType2;
pub const DataMatrixCellFilterMode_enum_IMAQ_AUTO_DETECT_CELL_FILTER_MODE:
	DataMatrixCellFilterMode_enum = -2;
pub const DataMatrixCellFilterMode_enum_IMAQ_AVERAGE_FILTER: DataMatrixCellFilterMode_enum = 0;
pub const DataMatrixCellFilterMode_enum_IMAQ_MEDIAN_FILTER: DataMatrixCellFilterMode_enum = 1;
pub const DataMatrixCellFilterMode_enum_IMAQ_CENTRAL_AVERAGE_FILTER: DataMatrixCellFilterMode_enum =
	2;
pub const DataMatrixCellFilterMode_enum_IMAQ_HIGH_AVERAGE_FILTER: DataMatrixCellFilterMode_enum = 3;
pub const DataMatrixCellFilterMode_enum_IMAQ_LOW_AVERAGE_FILTER: DataMatrixCellFilterMode_enum = 4;
pub const DataMatrixCellFilterMode_enum_IMAQ_VERY_HIGH_AVERAGE_FILTER:
	DataMatrixCellFilterMode_enum = 5;
pub const DataMatrixCellFilterMode_enum_IMAQ_VERY_LOW_AVERAGE_FILTER:
	DataMatrixCellFilterMode_enum = 6;
pub const DataMatrixCellFilterMode_enum_IMAQ_ALL_CELL_FILTERS: DataMatrixCellFilterMode_enum = 8;
pub const DataMatrixCellFilterMode_enum_IMAQ_DATA_MATRIX_CELL_FILTER_MODE_SIZE_GUARD:
	DataMatrixCellFilterMode_enum = 2147483647;
pub type DataMatrixCellFilterMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixCellFilterMode_enum as DataMatrixCellFilterMode;
pub const DataMatrixCellSampleSize_enum_IMAQ_AUTO_DETECT_CELL_SAMPLE_SIZE:
	DataMatrixCellSampleSize_enum = -2;
pub const DataMatrixCellSampleSize_enum_IMAQ_1x1: DataMatrixCellSampleSize_enum = 1;
pub const DataMatrixCellSampleSize_enum_IMAQ_2x2: DataMatrixCellSampleSize_enum = 2;
pub const DataMatrixCellSampleSize_enum_IMAQ_3x3: DataMatrixCellSampleSize_enum = 3;
pub const DataMatrixCellSampleSize_enum_IMAQ_4x4: DataMatrixCellSampleSize_enum = 4;
pub const DataMatrixCellSampleSize_enum_IMAQ_5x5: DataMatrixCellSampleSize_enum = 5;
pub const DataMatrixCellSampleSize_enum_IMAQ_6x6: DataMatrixCellSampleSize_enum = 6;
pub const DataMatrixCellSampleSize_enum_IMAQ_7x7: DataMatrixCellSampleSize_enum = 7;
pub const DataMatrixCellSampleSize_enum_IMAQ_DATA_MATRIX_CELL_SAMPLE_SIZE_SIZE_GUARD:
	DataMatrixCellSampleSize_enum = 2147483647;
pub type DataMatrixCellSampleSize_enum = ::std::os::raw::c_int;
pub use self::DataMatrixCellSampleSize_enum as DataMatrixCellSampleSize;
pub const DataMatrixMirrorMode_enum_IMAQ_AUTO_DETECT_MIRROR: DataMatrixMirrorMode_enum = -2;
pub const DataMatrixMirrorMode_enum_IMAQ_APPEARS_NORMAL: DataMatrixMirrorMode_enum = 0;
pub const DataMatrixMirrorMode_enum_IMAQ_APPEARS_MIRRORED: DataMatrixMirrorMode_enum = 1;
pub const DataMatrixMirrorMode_enum_IMAQ_DATA_MATRIX_MIRROR_MODE_SIZE_GUARD:
	DataMatrixMirrorMode_enum = 2147483647;
pub type DataMatrixMirrorMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixMirrorMode_enum as DataMatrixMirrorMode;
pub const DataMatrixRotationMode_enum_IMAQ_UNLIMITED_ROTATION: DataMatrixRotationMode_enum = 0;
pub const DataMatrixRotationMode_enum_IMAQ_0_DEGREES: DataMatrixRotationMode_enum = 1;
pub const DataMatrixRotationMode_enum_IMAQ_90_DEGREES: DataMatrixRotationMode_enum = 2;
pub const DataMatrixRotationMode_enum_IMAQ_180_DEGREES: DataMatrixRotationMode_enum = 3;
pub const DataMatrixRotationMode_enum_IMAQ_270_DEGREES: DataMatrixRotationMode_enum = 4;
pub const DataMatrixRotationMode_enum_IMAQ_DATA_MATRIX_ROTATION_MODE_SIZE_GUARD:
	DataMatrixRotationMode_enum = -1;
pub type DataMatrixRotationMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixRotationMode_enum as DataMatrixRotationMode;
pub const DataMatrixGradingMode_enum_IMAQ_NO_GRADING: DataMatrixGradingMode_enum = 0;
pub const DataMatrixGradingMode_enum_IMAQ_PREPARE_FOR_AIM: DataMatrixGradingMode_enum = 1;
pub const DataMatrixGradingMode_enum_IMAQ_DATA_MATRIX_GRADING_MODE_SIZE_GUARD:
	DataMatrixGradingMode_enum = -1;
pub type DataMatrixGradingMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixGradingMode_enum as DataMatrixGradingMode;
pub const WaveletTransformMode_enum_IMAQ_WAVELET_TRANSFORM_INTEGER: WaveletTransformMode_enum = 0;
pub const WaveletTransformMode_enum_IMAQ_WAVELET_TRANSFORM_FLOATING_POINT:
	WaveletTransformMode_enum = 1;
pub const WaveletTransformMode_enum_IMAQ_WAVELET_TRANSFORM_MODE_SIZE_GUARD:
	WaveletTransformMode_enum = -1;
pub type WaveletTransformMode_enum = ::std::os::raw::c_int;
pub use self::WaveletTransformMode_enum as WaveletTransformMode;
pub const NormalizationMethod_enum_IMAQ_NORMALIZATION_NONE: NormalizationMethod_enum = 0;
pub const NormalizationMethod_enum_IMAQ_NORMALIZATION_HISTOGRAM_MATCHING: NormalizationMethod_enum =
	1;
pub const NormalizationMethod_enum_IMAQ_NORMALIZATION_AVERAGE_MATCHING: NormalizationMethod_enum =
	2;
pub const NormalizationMethod_enum_IMAQ_NORMALIZATION_SIZE_GUARD: NormalizationMethod_enum = -1;
pub type NormalizationMethod_enum = ::std::os::raw::c_int;
pub use self::NormalizationMethod_enum as NormalizationMethod;
pub const DataMatrixDemodulationMode_enum_IMAQ_AUTO_DETECT_DEMODULATION_MODE:
	DataMatrixDemodulationMode_enum = -2;
pub const DataMatrixDemodulationMode_enum_IMAQ_HISTOGRAM: DataMatrixDemodulationMode_enum = 0;
pub const DataMatrixDemodulationMode_enum_IMAQ_LOCAL_CONTRAST: DataMatrixDemodulationMode_enum = 1;
pub const DataMatrixDemodulationMode_enum_IMAQ_COMBINED: DataMatrixDemodulationMode_enum = 2;
pub const DataMatrixDemodulationMode_enum_IMAQ_ALL_DEMODULATION_MODES:
	DataMatrixDemodulationMode_enum = 3;
pub const DataMatrixDemodulationMode_enum_IMAQ_DATA_MATRIX_DEMODULATION_MODE_SIZE_GUARD:
	DataMatrixDemodulationMode_enum = 2147483647;
pub type DataMatrixDemodulationMode_enum = ::std::os::raw::c_int;
pub use self::DataMatrixDemodulationMode_enum as DataMatrixDemodulationMode;
pub const RTVideoModeOperation_enum_IMAQ_GET_MODE: RTVideoModeOperation_enum = 0;
pub const RTVideoModeOperation_enum_IMAQ_SET_MODE: RTVideoModeOperation_enum = 1;
pub const RTVideoModeOperation_enum_IMAQ_RT_VIDEO_MODE_SIZE_GUARD: RTVideoModeOperation_enum = -1;
pub type RTVideoModeOperation_enum = ::std::os::raw::c_int;
pub use self::RTVideoModeOperation_enum as RTVideoModeOperation;
pub const RTDisplayVideoMode_enum_IMAQ_TEXT_MODE: RTDisplayVideoMode_enum = 0;
pub const RTDisplayVideoMode_enum_IMAQ_GRAPHICS_MODE: RTDisplayVideoMode_enum = 1;
pub const RTDisplayVideoMode_enum_IMAQ_DISPLAY_VIDEO_MODE_SIZE_GUARD: RTDisplayVideoMode_enum = -1;
pub type RTDisplayVideoMode_enum = ::std::os::raw::c_int;
pub use self::RTDisplayVideoMode_enum as RTDisplayVideoMode;
pub const BGEstimateMethod_enum_IMAQ_MODEL: BGEstimateMethod_enum = 0;
pub const BGEstimateMethod_enum_IMAQ_BG_CORRECTION: BGEstimateMethod_enum = 1;
pub const BGEstimateMethod_enum_IMAQ_BG_NIBLACK: BGEstimateMethod_enum = 2;
pub const BGEstimateMethod_enum_IMAQ_BGESTIMATE_METHOD_SIZE_GUARD: BGEstimateMethod_enum = -1;
pub type BGEstimateMethod_enum = ::std::os::raw::c_int;
pub use self::BGEstimateMethod_enum as BGEstimateMethod;
pub const SVMType_enum_IMAQ_C_SVC: SVMType_enum = 0;
pub const SVMType_enum_IMAQ_NU_SVC: SVMType_enum = 1;
pub const SVMType_enum_IMAQ_ONE_CLASS: SVMType_enum = 2;
pub const SVMType_enum_IMAQ_IMAQ_SVMTYPE_GUARD: SVMType_enum = -1;
pub type SVMType_enum = ::std::os::raw::c_int;
pub use self::SVMType_enum as SVMType;
pub const KernelType_enum_IMAQ_LINEARSVM: KernelType_enum = 0;
pub const KernelType_enum_IMAQ_POLYNOMIAL: KernelType_enum = 1;
pub const KernelType_enum_IMAQ_GAUSSIAN: KernelType_enum = 2;
pub const KernelType_enum_IMAQ_RBF: KernelType_enum = 3;
pub const KernelType_enum_IMAQ_KERNELTYPE_GUARD: KernelType_enum = -1;
pub type KernelType_enum = ::std::os::raw::c_int;
pub use self::KernelType_enum as KernelType;
pub const CornerOperators_enum_IMAQ_HARRISCORNER: CornerOperators_enum = 0;
pub const CornerOperators_enum_IMAQ_SHICORNER: CornerOperators_enum = 1;
pub const CornerOperators_enum_IMAQ_CORNEROPERATORS_GUARD: CornerOperators_enum = -1;
pub type CornerOperators_enum = ::std::os::raw::c_int;
pub use self::CornerOperators_enum as CornerOperators;
pub const VelocityRepresentation_enum_IMAQ_CARTESIAN: VelocityRepresentation_enum = 0;
pub const VelocityRepresentation_enum_IMAQ_POLAR: VelocityRepresentation_enum = 1;
pub const VelocityRepresentation_enum_IMAQ_VELOCITY_REPRESENTATION_SIZE_GUARD:
	VelocityRepresentation_enum = -1;
pub type VelocityRepresentation_enum = ::std::os::raw::c_int;
pub use self::VelocityRepresentation_enum as VelocityRepresentation;
pub const StoppingType_enum_IMAQ_ITERATIONS: StoppingType_enum = 1;
pub const StoppingType_enum_IMAQ_EPSILON: StoppingType_enum = 2;
pub const StoppingType_enum_IMAQ_BOTH: StoppingType_enum = 3;
pub const StoppingType_enum_IMAQ_STOPPINGTYPE_SIZE_GUARD: StoppingType_enum = -1;
pub type StoppingType_enum = ::std::os::raw::c_int;
pub use self::StoppingType_enum as StoppingType;
pub const ObjectTrackingMethod_enum_IMAQ_MEANSHIFTTRADITIONAL: ObjectTrackingMethod_enum = 0;
pub const ObjectTrackingMethod_enum_IMAQ_SHAPEADAPTEDMEANSHIFT: ObjectTrackingMethod_enum = 1;
pub const ObjectTrackingMethod_enum_IMAQ_OBJECTTRACKINGMETHOD_SIZE_GUARD:
	ObjectTrackingMethod_enum = -1;
pub type ObjectTrackingMethod_enum = ::std::os::raw::c_int;
pub use self::ObjectTrackingMethod_enum as ObjectTrackingMethod;
pub const ObjectDescriptionMethod_enum_IMAQ_HISTOGRAMBASED: ObjectDescriptionMethod_enum = 0;
pub const ObjectDescriptionMethod_enum_IMAQ_OBJECTDESCRIPTIONMETHOD_SIZE_GUARD:
	ObjectDescriptionMethod_enum = -1;
pub type ObjectDescriptionMethod_enum = ::std::os::raw::c_int;
pub use self::ObjectDescriptionMethod_enum as ObjectDescriptionMethod;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_NOCHANGE:
	InterchangeObjectTrackingMethods_enum = 0;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_MSTOMS: InterchangeObjectTrackingMethods_enum =
	1;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_MSTOEMS:
	InterchangeObjectTrackingMethods_enum = 2;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_EMSTOMS:
	InterchangeObjectTrackingMethods_enum = 3;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_EMSTOEMS:
	InterchangeObjectTrackingMethods_enum = 4;
pub const InterchangeObjectTrackingMethods_enum_IMAQ_INTERCHANGEOBJECTTRACKINGMETHODS_SIZE_GUARD:
	InterchangeObjectTrackingMethods_enum = -1;
pub type InterchangeObjectTrackingMethods_enum = ::std::os::raw::c_int;
pub use self::InterchangeObjectTrackingMethods_enum as InterchangeObjectTrackingMethods;
pub const FeatureExtractionMethods_enum_IMAQ_HOG: FeatureExtractionMethods_enum = 0;
pub const FeatureExtractionMethods_enum_IMAQ_LBP: FeatureExtractionMethods_enum = 1;
pub const FeatureExtractionMethods_enum_IMAQ_FEATUREEXTRACTIONMETHODS_SIZE_GUARD:
	FeatureExtractionMethods_enum = -1;
pub type FeatureExtractionMethods_enum = ::std::os::raw::c_int;
pub use self::FeatureExtractionMethods_enum as FeatureExtractionMethods;
pub const FeatureDescriptionMethoods_enum_IMAQ_FREAK: FeatureDescriptionMethoods_enum = 0;
pub const FeatureDescriptionMethoods_enum_IMAQ_BRISK: FeatureDescriptionMethoods_enum = 1;
pub const FeatureDescriptionMethoods_enum_IMAQ_FEATUREDESCRIPTIONMETHODS_SIZEGUARD:
	FeatureDescriptionMethoods_enum = -1;
pub type FeatureDescriptionMethoods_enum = ::std::os::raw::c_int;
pub use self::FeatureDescriptionMethoods_enum as FeatureDescriptionMethods;
pub const MipiCsi2Format_enum_IMAQ_MIPICSI2FORMAT_NONE: MipiCsi2Format_enum = 0;
pub const MipiCsi2Format_enum_IMAQ_MIPICSI2FORMAT_YUV422_8BIT: MipiCsi2Format_enum = 30;
pub const MipiCsi2Format_enum_IMAQ_MIPICSI2FORMAT_RGB888: MipiCsi2Format_enum = 36;
pub const MipiCsi2Format_enum_IMAQ_MIPICSI2FORMAT_SIZE_GUARD: MipiCsi2Format_enum = -1;
pub type MipiCsi2Format_enum = ::std::os::raw::c_int;
pub use self::MipiCsi2Format_enum as MipiCsi2Format;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Image_struct {
	_unused: [u8; 0],
}
pub type Image = Image_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ROI_struct {
	_unused: [u8; 0],
}
pub type ROI = ROI_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Overlay_struct {
	_unused: [u8; 0],
}
pub type Overlay = Overlay_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassifierSession_struct {
	_unused: [u8; 0],
}
pub type ClassifierSession = ClassifierSession_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoSession_struct {
	_unused: [u8; 0],
}
pub type StereoSession = StereoSession_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MultipleGeometricPattern_struct {
	_unused: [u8; 0],
}
pub type MultipleGeometricPattern = MultipleGeometricPattern_struct;
pub type ContourID = ::std::os::raw::c_int;
pub type uInt32 = ::std::os::raw::c_ulong;
pub type SESSION_ID = uInt32;
pub type AVISession = ::std::os::raw::c_int;
pub type FilterName = *mut ::std::os::raw::c_char;
pub type String255 = [::std::os::raw::c_char; 256usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CharSet_struct {
	_unused: [u8; 0],
}
pub type CharSet = CharSet_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ObjectTrackingSession_struct {
	_unused: [u8; 0],
}
pub type ObjectTrackingSession = ObjectTrackingSession_struct;
pub type AVI2Session = *mut ::std::os::raw::c_void;
pub type int64 = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoLearnCalibQualiy_struct {
	pub dProjectionError: f64,
	pub dcalibQuality: f64,
	pub dmaxRectError: f64,
	pub drectQuality: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoLearnCalibQualiy_struct"]
		[::std::mem::size_of::<StereoLearnCalibQualiy_struct>() - 32usize];
	["Alignment of StereoLearnCalibQualiy_struct"]
		[::std::mem::align_of::<StereoLearnCalibQualiy_struct>() - 8usize];
	["Offset of field: StereoLearnCalibQualiy_struct::dProjectionError"]
		[::std::mem::offset_of!(StereoLearnCalibQualiy_struct, dProjectionError) - 0usize];
	["Offset of field: StereoLearnCalibQualiy_struct::dcalibQuality"]
		[::std::mem::offset_of!(StereoLearnCalibQualiy_struct, dcalibQuality) - 8usize];
	["Offset of field: StereoLearnCalibQualiy_struct::dmaxRectError"]
		[::std::mem::offset_of!(StereoLearnCalibQualiy_struct, dmaxRectError) - 16usize];
	["Offset of field: StereoLearnCalibQualiy_struct::drectQuality"]
		[::std::mem::offset_of!(StereoLearnCalibQualiy_struct, drectQuality) - 24usize];
};
pub type StereoLearnCalibQualiy = StereoLearnCalibQualiy_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoRtfSettings_struct {
	pub iLearnLookup: ::std::os::raw::c_uint,
	pub iRenderToOriginalImage: ::std::os::raw::c_uint,
	pub iScalingFactor: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoRtfSettings_struct"]
		[::std::mem::size_of::<StereoRtfSettings_struct>() - 12usize];
	["Alignment of StereoRtfSettings_struct"]
		[::std::mem::align_of::<StereoRtfSettings_struct>() - 4usize];
	["Offset of field: StereoRtfSettings_struct::iLearnLookup"]
		[::std::mem::offset_of!(StereoRtfSettings_struct, iLearnLookup) - 0usize];
	["Offset of field: StereoRtfSettings_struct::iRenderToOriginalImage"]
		[::std::mem::offset_of!(StereoRtfSettings_struct, iRenderToOriginalImage) - 4usize];
	["Offset of field: StereoRtfSettings_struct::iScalingFactor"]
		[::std::mem::offset_of!(StereoRtfSettings_struct, iScalingFactor) - 8usize];
};
pub type StereoRtfSettings = StereoRtfSettings_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoPrefilterOptions_struct {
	pub filterType: StereoPrefilterType,
	pub filterSize: ::std::os::raw::c_uint,
	pub filterCap: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoPrefilterOptions_struct"]
		[::std::mem::size_of::<StereoPrefilterOptions_struct>() - 12usize];
	["Alignment of StereoPrefilterOptions_struct"]
		[::std::mem::align_of::<StereoPrefilterOptions_struct>() - 4usize];
	["Offset of field: StereoPrefilterOptions_struct::filterType"]
		[::std::mem::offset_of!(StereoPrefilterOptions_struct, filterType) - 0usize];
	["Offset of field: StereoPrefilterOptions_struct::filterSize"]
		[::std::mem::offset_of!(StereoPrefilterOptions_struct, filterSize) - 4usize];
	["Offset of field: StereoPrefilterOptions_struct::filterCap"]
		[::std::mem::offset_of!(StereoPrefilterOptions_struct, filterCap) - 8usize];
};
pub type StereoPrefilterOptions = StereoPrefilterOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoBlockMatchingOptions_struct {
	pub metric: StereoBlockMatchMetric,
	pub windowSize: ::std::os::raw::c_uint,
	pub minDisparity: ::std::os::raw::c_int,
	pub numDisparities: ::std::os::raw::c_uint,
	pub maxLeftRightDisparityDiff: ::std::os::raw::c_int,
	pub subpixel: ::std::os::raw::c_short,
	pub pixelReplaceVal: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoBlockMatchingOptions_struct"]
		[::std::mem::size_of::<StereoBlockMatchingOptions_struct>() - 28usize];
	["Alignment of StereoBlockMatchingOptions_struct"]
		[::std::mem::align_of::<StereoBlockMatchingOptions_struct>() - 4usize];
	["Offset of field: StereoBlockMatchingOptions_struct::metric"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, metric) - 0usize];
	["Offset of field: StereoBlockMatchingOptions_struct::windowSize"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, windowSize) - 4usize];
	["Offset of field: StereoBlockMatchingOptions_struct::minDisparity"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, minDisparity) - 8usize];
	["Offset of field: StereoBlockMatchingOptions_struct::numDisparities"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, numDisparities) - 12usize];
	["Offset of field: StereoBlockMatchingOptions_struct::maxLeftRightDisparityDiff"][::std::mem::offset_of!(
		StereoBlockMatchingOptions_struct,
		maxLeftRightDisparityDiff
	) - 16usize];
	["Offset of field: StereoBlockMatchingOptions_struct::subpixel"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, subpixel) - 20usize];
	["Offset of field: StereoBlockMatchingOptions_struct::pixelReplaceVal"]
		[::std::mem::offset_of!(StereoBlockMatchingOptions_struct, pixelReplaceVal) - 24usize];
};
pub type StereoBlockMatchingOptions = StereoBlockMatchingOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoSGBlockMatchingOptions_struct {
	pub metric: StereoBlockMatchMetric,
	pub windowSize: ::std::os::raw::c_uint,
	pub minDisparity: ::std::os::raw::c_uint,
	pub numDisparities: ::std::os::raw::c_uint,
	pub p1: ::std::os::raw::c_int,
	pub p2: ::std::os::raw::c_int,
	pub fullDP: ::std::os::raw::c_short,
	pub maxLeftRightDisparityDiff: ::std::os::raw::c_int,
	pub subpixel: ::std::os::raw::c_short,
	pub pixelReplaceVal: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoSGBlockMatchingOptions_struct"]
		[::std::mem::size_of::<StereoSGBlockMatchingOptions_struct>() - 40usize];
	["Alignment of StereoSGBlockMatchingOptions_struct"]
		[::std::mem::align_of::<StereoSGBlockMatchingOptions_struct>() - 4usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::metric"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, metric) - 0usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::windowSize"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, windowSize) - 4usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::minDisparity"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, minDisparity) - 8usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::numDisparities"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, numDisparities) - 12usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::p1"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, p1) - 16usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::p2"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, p2) - 20usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::fullDP"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, fullDP) - 24usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::maxLeftRightDisparityDiff"][::std::mem::offset_of!(
		StereoSGBlockMatchingOptions_struct,
		maxLeftRightDisparityDiff
	)
		- 28usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::subpixel"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, subpixel) - 32usize];
	["Offset of field: StereoSGBlockMatchingOptions_struct::pixelReplaceVal"]
		[::std::mem::offset_of!(StereoSGBlockMatchingOptions_struct, pixelReplaceVal) - 36usize];
};
pub type StereoSGBlockMatchingOptions = StereoSGBlockMatchingOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoDepthControl_struct {
	pub dMinDepth: f64,
	pub dMaxDepth: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoDepthControl_struct"]
		[::std::mem::size_of::<StereoDepthControl_struct>() - 16usize];
	["Alignment of StereoDepthControl_struct"]
		[::std::mem::align_of::<StereoDepthControl_struct>() - 8usize];
	["Offset of field: StereoDepthControl_struct::dMinDepth"]
		[::std::mem::offset_of!(StereoDepthControl_struct, dMinDepth) - 0usize];
	["Offset of field: StereoDepthControl_struct::dMaxDepth"]
		[::std::mem::offset_of!(StereoDepthControl_struct, dMaxDepth) - 8usize];
};
pub type StereoDepthControl = StereoDepthControl_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoPostfilterOptions_struct {
	pub textureThreshold: ::std::os::raw::c_uint,
	pub uniquenessRatio: ::std::os::raw::c_uint,
	pub speckleWindowSize: ::std::os::raw::c_uint,
	pub speckleRange: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoPostfilterOptions_struct"]
		[::std::mem::size_of::<StereoPostfilterOptions_struct>() - 16usize];
	["Alignment of StereoPostfilterOptions_struct"]
		[::std::mem::align_of::<StereoPostfilterOptions_struct>() - 4usize];
	["Offset of field: StereoPostfilterOptions_struct::textureThreshold"]
		[::std::mem::offset_of!(StereoPostfilterOptions_struct, textureThreshold) - 0usize];
	["Offset of field: StereoPostfilterOptions_struct::uniquenessRatio"]
		[::std::mem::offset_of!(StereoPostfilterOptions_struct, uniquenessRatio) - 4usize];
	["Offset of field: StereoPostfilterOptions_struct::speckleWindowSize"]
		[::std::mem::offset_of!(StereoPostfilterOptions_struct, speckleWindowSize) - 8usize];
	["Offset of field: StereoPostfilterOptions_struct::speckleRange"]
		[::std::mem::offset_of!(StereoPostfilterOptions_struct, speckleRange) - 12usize];
};
pub type StereoPostfilterOptions = StereoPostfilterOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoCoordPtFloat_struct {
	pub x: f32,
	pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoCoordPtFloat_struct"]
		[::std::mem::size_of::<StereoCoordPtFloat_struct>() - 8usize];
	["Alignment of StereoCoordPtFloat_struct"]
		[::std::mem::align_of::<StereoCoordPtFloat_struct>() - 4usize];
	["Offset of field: StereoCoordPtFloat_struct::x"]
		[::std::mem::offset_of!(StereoCoordPtFloat_struct, x) - 0usize];
	["Offset of field: StereoCoordPtFloat_struct::y"]
		[::std::mem::offset_of!(StereoCoordPtFloat_struct, y) - 4usize];
};
pub type StereoCoordPtFloat = StereoCoordPtFloat_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StereoPointDbl3D_struct {
	pub x: f64,
	pub y: f64,
	pub z: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StereoPointDbl3D_struct"][::std::mem::size_of::<StereoPointDbl3D_struct>() - 24usize];
	["Alignment of StereoPointDbl3D_struct"]
		[::std::mem::align_of::<StereoPointDbl3D_struct>() - 8usize];
	["Offset of field: StereoPointDbl3D_struct::x"]
		[::std::mem::offset_of!(StereoPointDbl3D_struct, x) - 0usize];
	["Offset of field: StereoPointDbl3D_struct::y"]
		[::std::mem::offset_of!(StereoPointDbl3D_struct, y) - 8usize];
	["Offset of field: StereoPointDbl3D_struct::z"]
		[::std::mem::offset_of!(StereoPointDbl3D_struct, z) - 16usize];
};
pub type StereoPointDbl3D = StereoPointDbl3D_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Range_struct {
	pub minValue: ::std::os::raw::c_int,
	pub maxValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of Range_struct"][::std::mem::size_of::<Range_struct>() - 8usize];
	["Alignment of Range_struct"][::std::mem::align_of::<Range_struct>() - 4usize];
	["Offset of field: Range_struct::minValue"]
		[::std::mem::offset_of!(Range_struct, minValue) - 0usize];
	["Offset of field: Range_struct::maxValue"]
		[::std::mem::offset_of!(Range_struct, maxValue) - 4usize];
};
pub type Range = Range_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCRSpacingOptions2_struct {
	pub minCharSpacing: ::std::os::raw::c_int,
	pub minCharSize: ::std::os::raw::c_int,
	pub maxCharSize: ::std::os::raw::c_int,
	pub maxHorizontalElementSpacing: ::std::os::raw::c_int,
	pub maxVerticalElementSpacing: ::std::os::raw::c_int,
	pub minBoundingRectWidth: ::std::os::raw::c_int,
	pub maxBoundingRectWidth: ::std::os::raw::c_int,
	pub minBoundingRectHeight: ::std::os::raw::c_int,
	pub maxBoundingRectHeight: ::std::os::raw::c_int,
	pub autoSplit: ::std::os::raw::c_int,
	pub textLocation: ::std::os::raw::c_int,
	pub lineSeparator: LineSeparator,
	pub shortestPathSegment: ::std::os::raw::c_int,
	pub minPixelsForSpace: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of OCRSpacingOptions2_struct"]
		[::std::mem::size_of::<OCRSpacingOptions2_struct>() - 56usize];
	["Alignment of OCRSpacingOptions2_struct"]
		[::std::mem::align_of::<OCRSpacingOptions2_struct>() - 4usize];
	["Offset of field: OCRSpacingOptions2_struct::minCharSpacing"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, minCharSpacing) - 0usize];
	["Offset of field: OCRSpacingOptions2_struct::minCharSize"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, minCharSize) - 4usize];
	["Offset of field: OCRSpacingOptions2_struct::maxCharSize"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, maxCharSize) - 8usize];
	["Offset of field: OCRSpacingOptions2_struct::maxHorizontalElementSpacing"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, maxHorizontalElementSpacing) - 12usize];
	["Offset of field: OCRSpacingOptions2_struct::maxVerticalElementSpacing"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, maxVerticalElementSpacing) - 16usize];
	["Offset of field: OCRSpacingOptions2_struct::minBoundingRectWidth"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, minBoundingRectWidth) - 20usize];
	["Offset of field: OCRSpacingOptions2_struct::maxBoundingRectWidth"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, maxBoundingRectWidth) - 24usize];
	["Offset of field: OCRSpacingOptions2_struct::minBoundingRectHeight"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, minBoundingRectHeight) - 28usize];
	["Offset of field: OCRSpacingOptions2_struct::maxBoundingRectHeight"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, maxBoundingRectHeight) - 32usize];
	["Offset of field: OCRSpacingOptions2_struct::autoSplit"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, autoSplit) - 36usize];
	["Offset of field: OCRSpacingOptions2_struct::textLocation"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, textLocation) - 40usize];
	["Offset of field: OCRSpacingOptions2_struct::lineSeparator"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, lineSeparator) - 44usize];
	["Offset of field: OCRSpacingOptions2_struct::shortestPathSegment"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, shortestPathSegment) - 48usize];
	["Offset of field: OCRSpacingOptions2_struct::minPixelsForSpace"]
		[::std::mem::offset_of!(OCRSpacingOptions2_struct, minPixelsForSpace) - 52usize];
};
pub type OCRSpacingOptions2 = OCRSpacingOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCRProcessingOptions2_struct {
	pub thresholdType: ThresholdType,
	pub mode: ThresholdMode,
	pub lowThreshold: ::std::os::raw::c_int,
	pub highThreshold: ::std::os::raw::c_int,
	pub blockCount: ::std::os::raw::c_int,
	pub fastThreshold: ::std::os::raw::c_int,
	pub biModalCalculation: ::std::os::raw::c_int,
	pub darkCharacters: ::std::os::raw::c_int,
	pub windowWidth: ::std::os::raw::c_uint,
	pub windowHeight: ::std::os::raw::c_uint,
	pub colorMode: ColorMode,
	pub plane1Range: Range,
	pub plane2Range: Range,
	pub plane3Range: Range,
	pub removeParticlesTouchingROI: ::std::os::raw::c_int,
	pub erosionCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of OCRProcessingOptions2_struct"]
		[::std::mem::size_of::<OCRProcessingOptions2_struct>() - 76usize];
	["Alignment of OCRProcessingOptions2_struct"]
		[::std::mem::align_of::<OCRProcessingOptions2_struct>() - 4usize];
	["Offset of field: OCRProcessingOptions2_struct::thresholdType"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, thresholdType) - 0usize];
	["Offset of field: OCRProcessingOptions2_struct::mode"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, mode) - 4usize];
	["Offset of field: OCRProcessingOptions2_struct::lowThreshold"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, lowThreshold) - 8usize];
	["Offset of field: OCRProcessingOptions2_struct::highThreshold"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, highThreshold) - 12usize];
	["Offset of field: OCRProcessingOptions2_struct::blockCount"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, blockCount) - 16usize];
	["Offset of field: OCRProcessingOptions2_struct::fastThreshold"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, fastThreshold) - 20usize];
	["Offset of field: OCRProcessingOptions2_struct::biModalCalculation"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, biModalCalculation) - 24usize];
	["Offset of field: OCRProcessingOptions2_struct::darkCharacters"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, darkCharacters) - 28usize];
	["Offset of field: OCRProcessingOptions2_struct::windowWidth"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, windowWidth) - 32usize];
	["Offset of field: OCRProcessingOptions2_struct::windowHeight"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, windowHeight) - 36usize];
	["Offset of field: OCRProcessingOptions2_struct::colorMode"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, colorMode) - 40usize];
	["Offset of field: OCRProcessingOptions2_struct::plane1Range"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, plane1Range) - 44usize];
	["Offset of field: OCRProcessingOptions2_struct::plane2Range"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, plane2Range) - 52usize];
	["Offset of field: OCRProcessingOptions2_struct::plane3Range"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, plane3Range) - 60usize];
	["Offset of field: OCRProcessingOptions2_struct::removeParticlesTouchingROI"][::std::mem::offset_of!(
		OCRProcessingOptions2_struct,
		removeParticlesTouchingROI
	) - 68usize];
	["Offset of field: OCRProcessingOptions2_struct::erosionCount"]
		[::std::mem::offset_of!(OCRProcessingOptions2_struct, erosionCount) - 72usize];
};
pub type OCRProcessingOptions2 = OCRProcessingOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CharacterStatistics_struct {
	pub left: ::std::os::raw::c_int,
	pub top: ::std::os::raw::c_int,
	pub width: ::std::os::raw::c_int,
	pub height: ::std::os::raw::c_int,
	pub characterSize: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CharacterStatistics_struct"]
		[::std::mem::size_of::<CharacterStatistics_struct>() - 20usize];
	["Alignment of CharacterStatistics_struct"]
		[::std::mem::align_of::<CharacterStatistics_struct>() - 4usize];
	["Offset of field: CharacterStatistics_struct::left"]
		[::std::mem::offset_of!(CharacterStatistics_struct, left) - 0usize];
	["Offset of field: CharacterStatistics_struct::top"]
		[::std::mem::offset_of!(CharacterStatistics_struct, top) - 4usize];
	["Offset of field: CharacterStatistics_struct::width"]
		[::std::mem::offset_of!(CharacterStatistics_struct, width) - 8usize];
	["Offset of field: CharacterStatistics_struct::height"]
		[::std::mem::offset_of!(CharacterStatistics_struct, height) - 12usize];
	["Offset of field: CharacterStatistics_struct::characterSize"]
		[::std::mem::offset_of!(CharacterStatistics_struct, characterSize) - 16usize];
};
pub type CharacterStatistics = CharacterStatistics_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CharReport3_struct {
	pub character: *const ::std::os::raw::c_char,
	pub classificationScore: ::std::os::raw::c_int,
	pub verificationScore: ::std::os::raw::c_int,
	pub verified: ::std::os::raw::c_int,
	pub lowThreshold: ::std::os::raw::c_int,
	pub highThreshold: ::std::os::raw::c_int,
	pub characterStats: CharacterStatistics,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CharReport3_struct"][::std::mem::size_of::<CharReport3_struct>() - 48usize];
	["Alignment of CharReport3_struct"][::std::mem::align_of::<CharReport3_struct>() - 8usize];
	["Offset of field: CharReport3_struct::character"]
		[::std::mem::offset_of!(CharReport3_struct, character) - 0usize];
	["Offset of field: CharReport3_struct::classificationScore"]
		[::std::mem::offset_of!(CharReport3_struct, classificationScore) - 8usize];
	["Offset of field: CharReport3_struct::verificationScore"]
		[::std::mem::offset_of!(CharReport3_struct, verificationScore) - 12usize];
	["Offset of field: CharReport3_struct::verified"]
		[::std::mem::offset_of!(CharReport3_struct, verified) - 16usize];
	["Offset of field: CharReport3_struct::lowThreshold"]
		[::std::mem::offset_of!(CharReport3_struct, lowThreshold) - 20usize];
	["Offset of field: CharReport3_struct::highThreshold"]
		[::std::mem::offset_of!(CharReport3_struct, highThreshold) - 24usize];
	["Offset of field: CharReport3_struct::characterStats"]
		[::std::mem::offset_of!(CharReport3_struct, characterStats) - 28usize];
};
pub type CharReport3 = CharReport3_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReadTextReport4_struct {
	pub readString: *const ::std::os::raw::c_char,
	pub characterReport: *mut CharReport3,
	pub numCharacterReports: ::std::os::raw::c_int,
	pub roiBoundingCharacters: *mut ROI,
	pub numberOflinesDetected: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ReadTextReport4_struct"][::std::mem::size_of::<ReadTextReport4_struct>() - 40usize];
	["Alignment of ReadTextReport4_struct"]
		[::std::mem::align_of::<ReadTextReport4_struct>() - 8usize];
	["Offset of field: ReadTextReport4_struct::readString"]
		[::std::mem::offset_of!(ReadTextReport4_struct, readString) - 0usize];
	["Offset of field: ReadTextReport4_struct::characterReport"]
		[::std::mem::offset_of!(ReadTextReport4_struct, characterReport) - 8usize];
	["Offset of field: ReadTextReport4_struct::numCharacterReports"]
		[::std::mem::offset_of!(ReadTextReport4_struct, numCharacterReports) - 16usize];
	["Offset of field: ReadTextReport4_struct::roiBoundingCharacters"]
		[::std::mem::offset_of!(ReadTextReport4_struct, roiBoundingCharacters) - 24usize];
	["Offset of field: ReadTextReport4_struct::numberOflinesDetected"]
		[::std::mem::offset_of!(ReadTextReport4_struct, numberOflinesDetected) - 32usize];
};
pub type ReadTextReport4 = ReadTextReport4_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibReflectanceStruct_struct {
	pub rcal: f64,
	pub srcal: f64,
	pub mlcal: f64,
	pub srtarget: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibReflectanceStruct_struct"]
		[::std::mem::size_of::<CalibReflectanceStruct_struct>() - 32usize];
	["Alignment of CalibReflectanceStruct_struct"]
		[::std::mem::align_of::<CalibReflectanceStruct_struct>() - 8usize];
	["Offset of field: CalibReflectanceStruct_struct::rcal"]
		[::std::mem::offset_of!(CalibReflectanceStruct_struct, rcal) - 0usize];
	["Offset of field: CalibReflectanceStruct_struct::srcal"]
		[::std::mem::offset_of!(CalibReflectanceStruct_struct, srcal) - 8usize];
	["Offset of field: CalibReflectanceStruct_struct::mlcal"]
		[::std::mem::offset_of!(CalibReflectanceStruct_struct, mlcal) - 16usize];
	["Offset of field: CalibReflectanceStruct_struct::srtarget"]
		[::std::mem::offset_of!(CalibReflectanceStruct_struct, srtarget) - 24usize];
};
pub type CalibReflectanceStruct = CalibReflectanceStruct_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AdvancedDataMatrixOptions_struct {
	pub type_: DataMatrixAdvancedProcessing,
	pub value: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of AdvancedDataMatrixOptions_struct"]
		[::std::mem::size_of::<AdvancedDataMatrixOptions_struct>() - 16usize];
	["Alignment of AdvancedDataMatrixOptions_struct"]
		[::std::mem::align_of::<AdvancedDataMatrixOptions_struct>() - 8usize];
	["Offset of field: AdvancedDataMatrixOptions_struct::type_"]
		[::std::mem::offset_of!(AdvancedDataMatrixOptions_struct, type_) - 0usize];
	["Offset of field: AdvancedDataMatrixOptions_struct::value"]
		[::std::mem::offset_of!(AdvancedDataMatrixOptions_struct, value) - 8usize];
};
pub type AdvancedDataMatrixOptions = AdvancedDataMatrixOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AIMDPMGradeReport_struct {
	pub overallGrade: AIMGrade,
	pub decodingGrade: AIMGrade,
	pub cellContrastGrade: AIMGrade,
	pub cellContrast: f32,
	pub printGrowthGrade: AIMGrade,
	pub printGrowth: f32,
	pub axialNonuniformityGrade: AIMGrade,
	pub axialNonuniformity: f32,
	pub unusedErrorCorrectionGrade: AIMGrade,
	pub unusedErrorCorrection: f32,
	pub gridNonUniformityGrade: AIMGrade,
	pub gridNonUniformity: f32,
	pub cellModulationGrade: AIMGrade,
	pub fixedPatternDamageGrade: AIMGrade,
	pub fixedPatternDamage: f32,
	pub minimumReflectanceGrade: AIMGrade,
	pub minimumReflectance: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of AIMDPMGradeReport_struct"]
		[::std::mem::size_of::<AIMDPMGradeReport_struct>() - 68usize];
	["Alignment of AIMDPMGradeReport_struct"]
		[::std::mem::align_of::<AIMDPMGradeReport_struct>() - 4usize];
	["Offset of field: AIMDPMGradeReport_struct::overallGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, overallGrade) - 0usize];
	["Offset of field: AIMDPMGradeReport_struct::decodingGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, decodingGrade) - 4usize];
	["Offset of field: AIMDPMGradeReport_struct::cellContrastGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, cellContrastGrade) - 8usize];
	["Offset of field: AIMDPMGradeReport_struct::cellContrast"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, cellContrast) - 12usize];
	["Offset of field: AIMDPMGradeReport_struct::printGrowthGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, printGrowthGrade) - 16usize];
	["Offset of field: AIMDPMGradeReport_struct::printGrowth"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, printGrowth) - 20usize];
	["Offset of field: AIMDPMGradeReport_struct::axialNonuniformityGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, axialNonuniformityGrade) - 24usize];
	["Offset of field: AIMDPMGradeReport_struct::axialNonuniformity"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, axialNonuniformity) - 28usize];
	["Offset of field: AIMDPMGradeReport_struct::unusedErrorCorrectionGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, unusedErrorCorrectionGrade) - 32usize];
	["Offset of field: AIMDPMGradeReport_struct::unusedErrorCorrection"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, unusedErrorCorrection) - 36usize];
	["Offset of field: AIMDPMGradeReport_struct::gridNonUniformityGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, gridNonUniformityGrade) - 40usize];
	["Offset of field: AIMDPMGradeReport_struct::gridNonUniformity"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, gridNonUniformity) - 44usize];
	["Offset of field: AIMDPMGradeReport_struct::cellModulationGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, cellModulationGrade) - 48usize];
	["Offset of field: AIMDPMGradeReport_struct::fixedPatternDamageGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, fixedPatternDamageGrade) - 52usize];
	["Offset of field: AIMDPMGradeReport_struct::fixedPatternDamage"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, fixedPatternDamage) - 56usize];
	["Offset of field: AIMDPMGradeReport_struct::minimumReflectanceGrade"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, minimumReflectanceGrade) - 60usize];
	["Offset of field: AIMDPMGradeReport_struct::minimumReflectance"]
		[::std::mem::offset_of!(AIMDPMGradeReport_struct, minimumReflectance) - 64usize];
};
pub type AIMDPMGradeReport = AIMDPMGradeReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GradeReportISO15415_struct {
	pub overallGrade: AIMGrade,
	pub decodingGrade: AIMGrade,
	pub symbolContrastGrade: AIMGrade,
	pub symbolContrast: f32,
	pub printGrowthGrade: AIMGrade,
	pub printGrowth: f32,
	pub axialNonuniformityGrade: AIMGrade,
	pub axialNonuniformity: f32,
	pub unusedErrorCorrectionGrade: AIMGrade,
	pub unusedErrorCorrection: f32,
	pub gridNonUniformityGrade: AIMGrade,
	pub gridNonUniformity: f32,
	pub modulationGrade: AIMGrade,
	pub fixedPatternDamageGrade: AIMGrade,
	pub fixedPatternDamage: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GradeReportISO15415_struct"]
		[::std::mem::size_of::<GradeReportISO15415_struct>() - 60usize];
	["Alignment of GradeReportISO15415_struct"]
		[::std::mem::align_of::<GradeReportISO15415_struct>() - 4usize];
	["Offset of field: GradeReportISO15415_struct::overallGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, overallGrade) - 0usize];
	["Offset of field: GradeReportISO15415_struct::decodingGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, decodingGrade) - 4usize];
	["Offset of field: GradeReportISO15415_struct::symbolContrastGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, symbolContrastGrade) - 8usize];
	["Offset of field: GradeReportISO15415_struct::symbolContrast"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, symbolContrast) - 12usize];
	["Offset of field: GradeReportISO15415_struct::printGrowthGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, printGrowthGrade) - 16usize];
	["Offset of field: GradeReportISO15415_struct::printGrowth"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, printGrowth) - 20usize];
	["Offset of field: GradeReportISO15415_struct::axialNonuniformityGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, axialNonuniformityGrade) - 24usize];
	["Offset of field: GradeReportISO15415_struct::axialNonuniformity"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, axialNonuniformity) - 28usize];
	["Offset of field: GradeReportISO15415_struct::unusedErrorCorrectionGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, unusedErrorCorrectionGrade) - 32usize];
	["Offset of field: GradeReportISO15415_struct::unusedErrorCorrection"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, unusedErrorCorrection) - 36usize];
	["Offset of field: GradeReportISO15415_struct::gridNonUniformityGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, gridNonUniformityGrade) - 40usize];
	["Offset of field: GradeReportISO15415_struct::gridNonUniformity"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, gridNonUniformity) - 44usize];
	["Offset of field: GradeReportISO15415_struct::modulationGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, modulationGrade) - 48usize];
	["Offset of field: GradeReportISO15415_struct::fixedPatternDamageGrade"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, fixedPatternDamageGrade) - 52usize];
	["Offset of field: GradeReportISO15415_struct::fixedPatternDamage"]
		[::std::mem::offset_of!(GradeReportISO15415_struct, fixedPatternDamage) - 56usize];
};
pub type GradeReportISO15415 = GradeReportISO15415_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GradeReportISO16022_struct {
	pub overallGrade: AIMGrade,
	pub decodingGrade: AIMGrade,
	pub symbolContrastGrade: AIMGrade,
	pub symbolContrast: f32,
	pub printGrowthGrade: AIMGrade,
	pub printGrowth: f32,
	pub axialNonuniformityGrade: AIMGrade,
	pub axialNonuniformity: f32,
	pub unusedErrorCorrectionGrade: AIMGrade,
	pub unusedErrorCorrection: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GradeReportISO16022_struct"]
		[::std::mem::size_of::<GradeReportISO16022_struct>() - 40usize];
	["Alignment of GradeReportISO16022_struct"]
		[::std::mem::align_of::<GradeReportISO16022_struct>() - 4usize];
	["Offset of field: GradeReportISO16022_struct::overallGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, overallGrade) - 0usize];
	["Offset of field: GradeReportISO16022_struct::decodingGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, decodingGrade) - 4usize];
	["Offset of field: GradeReportISO16022_struct::symbolContrastGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, symbolContrastGrade) - 8usize];
	["Offset of field: GradeReportISO16022_struct::symbolContrast"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, symbolContrast) - 12usize];
	["Offset of field: GradeReportISO16022_struct::printGrowthGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, printGrowthGrade) - 16usize];
	["Offset of field: GradeReportISO16022_struct::printGrowth"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, printGrowth) - 20usize];
	["Offset of field: GradeReportISO16022_struct::axialNonuniformityGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, axialNonuniformityGrade) - 24usize];
	["Offset of field: GradeReportISO16022_struct::axialNonuniformity"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, axialNonuniformity) - 28usize];
	["Offset of field: GradeReportISO16022_struct::unusedErrorCorrectionGrade"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, unusedErrorCorrectionGrade) - 32usize];
	["Offset of field: GradeReportISO16022_struct::unusedErrorCorrection"]
		[::std::mem::offset_of!(GradeReportISO16022_struct, unusedErrorCorrection) - 36usize];
};
pub type GradeReportISO16022 = GradeReportISO16022_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibrationCorrectionLearnSetupInfo_struct {
	pub scaleMode: ScalingMethod,
	pub roiMode: CalibrationROI,
	pub learnCorrectionTable: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibrationCorrectionLearnSetupInfo_struct"]
		[::std::mem::size_of::<CalibrationCorrectionLearnSetupInfo_struct>() - 12usize];
	["Alignment of CalibrationCorrectionLearnSetupInfo_struct"]
		[::std::mem::align_of::<CalibrationCorrectionLearnSetupInfo_struct>() - 4usize];
	["Offset of field: CalibrationCorrectionLearnSetupInfo_struct::scaleMode"]
		[::std::mem::offset_of!(CalibrationCorrectionLearnSetupInfo_struct, scaleMode) - 0usize];
	["Offset of field: CalibrationCorrectionLearnSetupInfo_struct::roiMode"]
		[::std::mem::offset_of!(CalibrationCorrectionLearnSetupInfo_struct, roiMode) - 4usize];
	["Offset of field: CalibrationCorrectionLearnSetupInfo_struct::learnCorrectionTable"][::std::mem::offset_of!(
		CalibrationCorrectionLearnSetupInfo_struct,
		learnCorrectionTable
	)
		- 8usize];
};
pub type CalibrationCorrectionLearnSetupInfo = CalibrationCorrectionLearnSetupInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibrationModelSetup_struct {
	pub distortionModel: DistortionModel,
	pub radialCoefficient: RadialCoefficients,
	pub tangentialCoefficients: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibrationModelSetup_struct"]
		[::std::mem::size_of::<CalibrationModelSetup_struct>() - 12usize];
	["Alignment of CalibrationModelSetup_struct"]
		[::std::mem::align_of::<CalibrationModelSetup_struct>() - 4usize];
	["Offset of field: CalibrationModelSetup_struct::distortionModel"]
		[::std::mem::offset_of!(CalibrationModelSetup_struct, distortionModel) - 0usize];
	["Offset of field: CalibrationModelSetup_struct::radialCoefficient"]
		[::std::mem::offset_of!(CalibrationModelSetup_struct, radialCoefficient) - 4usize];
	["Offset of field: CalibrationModelSetup_struct::tangentialCoefficients"]
		[::std::mem::offset_of!(CalibrationModelSetup_struct, tangentialCoefficients) - 8usize];
};
pub type CalibrationModelSetup = CalibrationModelSetup_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DivisionModel_struct {
	pub kappa: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of DivisionModel_struct"][::std::mem::size_of::<DivisionModel_struct>() - 4usize];
	["Alignment of DivisionModel_struct"][::std::mem::align_of::<DivisionModel_struct>() - 4usize];
	["Offset of field: DivisionModel_struct::kappa"]
		[::std::mem::offset_of!(DivisionModel_struct, kappa) - 0usize];
};
pub type DivisionModel = DivisionModel_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FocalLength_struct {
	pub fx: f32,
	pub fy: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FocalLength_struct"][::std::mem::size_of::<FocalLength_struct>() - 8usize];
	["Alignment of FocalLength_struct"][::std::mem::align_of::<FocalLength_struct>() - 4usize];
	["Offset of field: FocalLength_struct::fx"]
		[::std::mem::offset_of!(FocalLength_struct, fx) - 0usize];
	["Offset of field: FocalLength_struct::fy"]
		[::std::mem::offset_of!(FocalLength_struct, fy) - 4usize];
};
pub type FocalLength = FocalLength_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PolyModel_struct {
	pub kCoeffs: *mut f32,
	pub numKCoeffs: ::std::os::raw::c_uint,
	pub p1: f32,
	pub p2: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PolyModel_struct"][::std::mem::size_of::<PolyModel_struct>() - 24usize];
	["Alignment of PolyModel_struct"][::std::mem::align_of::<PolyModel_struct>() - 8usize];
	["Offset of field: PolyModel_struct::kCoeffs"]
		[::std::mem::offset_of!(PolyModel_struct, kCoeffs) - 0usize];
	["Offset of field: PolyModel_struct::numKCoeffs"]
		[::std::mem::offset_of!(PolyModel_struct, numKCoeffs) - 8usize];
	["Offset of field: PolyModel_struct::p1"]
		[::std::mem::offset_of!(PolyModel_struct, p1) - 12usize];
	["Offset of field: PolyModel_struct::p2"]
		[::std::mem::offset_of!(PolyModel_struct, p2) - 16usize];
};
pub type PolyModel = PolyModel_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DistortionModelParams_struct {
	pub distortionModel: DistortionModel,
	pub polyModel: PolyModel,
	pub divisionModel: DivisionModel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of DistortionModelParams_struct"]
		[::std::mem::size_of::<DistortionModelParams_struct>() - 40usize];
	["Alignment of DistortionModelParams_struct"]
		[::std::mem::align_of::<DistortionModelParams_struct>() - 8usize];
	["Offset of field: DistortionModelParams_struct::distortionModel"]
		[::std::mem::offset_of!(DistortionModelParams_struct, distortionModel) - 0usize];
	["Offset of field: DistortionModelParams_struct::polyModel"]
		[::std::mem::offset_of!(DistortionModelParams_struct, polyModel) - 8usize];
	["Offset of field: DistortionModelParams_struct::divisionModel"]
		[::std::mem::offset_of!(DistortionModelParams_struct, divisionModel) - 32usize];
};
pub type DistortionModelParams = DistortionModelParams_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PointFloat_struct {
	pub x: f32,
	pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PointFloat_struct"][::std::mem::size_of::<PointFloat_struct>() - 8usize];
	["Alignment of PointFloat_struct"][::std::mem::align_of::<PointFloat_struct>() - 4usize];
	["Offset of field: PointFloat_struct::x"]
		[::std::mem::offset_of!(PointFloat_struct, x) - 0usize];
	["Offset of field: PointFloat_struct::y"]
		[::std::mem::offset_of!(PointFloat_struct, y) - 4usize];
};
pub type PointFloat = PointFloat_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InternalParameters_struct {
	pub isInsufficientData: ::std::os::raw::c_char,
	pub focalLength: FocalLength,
	pub opticalCenter: PointFloat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of InternalParameters_struct"]
		[::std::mem::size_of::<InternalParameters_struct>() - 20usize];
	["Alignment of InternalParameters_struct"]
		[::std::mem::align_of::<InternalParameters_struct>() - 4usize];
	["Offset of field: InternalParameters_struct::isInsufficientData"]
		[::std::mem::offset_of!(InternalParameters_struct, isInsufficientData) - 0usize];
	["Offset of field: InternalParameters_struct::focalLength"]
		[::std::mem::offset_of!(InternalParameters_struct, focalLength) - 4usize];
	["Offset of field: InternalParameters_struct::opticalCenter"]
		[::std::mem::offset_of!(InternalParameters_struct, opticalCenter) - 12usize];
};
pub type InternalParameters = InternalParameters_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MaxGridSize_struct {
	pub xMax: ::std::os::raw::c_uint,
	pub yMax: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MaxGridSize_struct"][::std::mem::size_of::<MaxGridSize_struct>() - 8usize];
	["Alignment of MaxGridSize_struct"][::std::mem::align_of::<MaxGridSize_struct>() - 4usize];
	["Offset of field: MaxGridSize_struct::xMax"]
		[::std::mem::offset_of!(MaxGridSize_struct, xMax) - 0usize];
	["Offset of field: MaxGridSize_struct::yMax"]
		[::std::mem::offset_of!(MaxGridSize_struct, yMax) - 4usize];
};
pub type MaxGridSize = MaxGridSize_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImageSize_struct {
	pub xRes: ::std::os::raw::c_uint,
	pub yRes: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ImageSize_struct"][::std::mem::size_of::<ImageSize_struct>() - 8usize];
	["Alignment of ImageSize_struct"][::std::mem::align_of::<ImageSize_struct>() - 4usize];
	["Offset of field: ImageSize_struct::xRes"]
		[::std::mem::offset_of!(ImageSize_struct, xRes) - 0usize];
	["Offset of field: ImageSize_struct::yRes"]
		[::std::mem::offset_of!(ImageSize_struct, yRes) - 4usize];
};
pub type ImageSize = ImageSize_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PointDouble_struct {
	pub x: f64,
	pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PointDouble_struct"][::std::mem::size_of::<PointDouble_struct>() - 16usize];
	["Alignment of PointDouble_struct"][::std::mem::align_of::<PointDouble_struct>() - 8usize];
	["Offset of field: PointDouble_struct::x"]
		[::std::mem::offset_of!(PointDouble_struct, x) - 0usize];
	["Offset of field: PointDouble_struct::y"]
		[::std::mem::offset_of!(PointDouble_struct, y) - 8usize];
};
pub type PointDouble = PointDouble_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibrationReferencePoints_struct {
	pub pixelCoords: *mut PointDouble,
	pub numPixelCoords: ::std::os::raw::c_uint,
	pub realCoords: *mut PointDouble,
	pub numRealCoords: ::std::os::raw::c_uint,
	pub units: CalibrationUnit,
	pub imageSize: ImageSize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibrationReferencePoints_struct"]
		[::std::mem::size_of::<CalibrationReferencePoints_struct>() - 40usize];
	["Alignment of CalibrationReferencePoints_struct"]
		[::std::mem::align_of::<CalibrationReferencePoints_struct>() - 8usize];
	["Offset of field: CalibrationReferencePoints_struct::pixelCoords"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, pixelCoords) - 0usize];
	["Offset of field: CalibrationReferencePoints_struct::numPixelCoords"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, numPixelCoords) - 8usize];
	["Offset of field: CalibrationReferencePoints_struct::realCoords"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, realCoords) - 16usize];
	["Offset of field: CalibrationReferencePoints_struct::numRealCoords"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, numRealCoords) - 24usize];
	["Offset of field: CalibrationReferencePoints_struct::units"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, units) - 28usize];
	["Offset of field: CalibrationReferencePoints_struct::imageSize"]
		[::std::mem::offset_of!(CalibrationReferencePoints_struct, imageSize) - 32usize];
};
pub type CalibrationReferencePoints = CalibrationReferencePoints_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GetCameraParametersReport_struct {
	pub projectionMatrix: *mut f64,
	pub projectionMatrixRows: usize,
	pub projectionMatrixCols: usize,
	pub distortion: DistortionModelParams,
	pub internalParams: InternalParameters,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GetCameraParametersReport_struct"]
		[::std::mem::size_of::<GetCameraParametersReport_struct>() - 88usize];
	["Alignment of GetCameraParametersReport_struct"]
		[::std::mem::align_of::<GetCameraParametersReport_struct>() - 8usize];
	["Offset of field: GetCameraParametersReport_struct::projectionMatrix"]
		[::std::mem::offset_of!(GetCameraParametersReport_struct, projectionMatrix) - 0usize];
	["Offset of field: GetCameraParametersReport_struct::projectionMatrixRows"]
		[::std::mem::offset_of!(GetCameraParametersReport_struct, projectionMatrixRows) - 8usize];
	["Offset of field: GetCameraParametersReport_struct::projectionMatrixCols"]
		[::std::mem::offset_of!(GetCameraParametersReport_struct, projectionMatrixCols) - 16usize];
	["Offset of field: GetCameraParametersReport_struct::distortion"]
		[::std::mem::offset_of!(GetCameraParametersReport_struct, distortion) - 24usize];
	["Offset of field: GetCameraParametersReport_struct::internalParams"]
		[::std::mem::offset_of!(GetCameraParametersReport_struct, internalParams) - 64usize];
};
pub type GetCameraParametersReport = GetCameraParametersReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibrationAxisInfo_struct {
	pub center: PointFloat,
	pub rotationAngle: f32,
	pub axisDirection: AxisOrientation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibrationAxisInfo_struct"]
		[::std::mem::size_of::<CalibrationAxisInfo_struct>() - 16usize];
	["Alignment of CalibrationAxisInfo_struct"]
		[::std::mem::align_of::<CalibrationAxisInfo_struct>() - 4usize];
	["Offset of field: CalibrationAxisInfo_struct::center"]
		[::std::mem::offset_of!(CalibrationAxisInfo_struct, center) - 0usize];
	["Offset of field: CalibrationAxisInfo_struct::rotationAngle"]
		[::std::mem::offset_of!(CalibrationAxisInfo_struct, rotationAngle) - 8usize];
	["Offset of field: CalibrationAxisInfo_struct::axisDirection"]
		[::std::mem::offset_of!(CalibrationAxisInfo_struct, axisDirection) - 12usize];
};
pub type CalibrationAxisInfo = CalibrationAxisInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CalibrationLearnSetupInfo_struct {
	pub calibrationMethod: CalibrationMode2,
	pub distortionModel: DistortionModel,
	pub scaleMode: ScalingMethod,
	pub roiMode: CalibrationROI,
	pub learnCorrectionTable: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CalibrationLearnSetupInfo_struct"]
		[::std::mem::size_of::<CalibrationLearnSetupInfo_struct>() - 20usize];
	["Alignment of CalibrationLearnSetupInfo_struct"]
		[::std::mem::align_of::<CalibrationLearnSetupInfo_struct>() - 4usize];
	["Offset of field: CalibrationLearnSetupInfo_struct::calibrationMethod"]
		[::std::mem::offset_of!(CalibrationLearnSetupInfo_struct, calibrationMethod) - 0usize];
	["Offset of field: CalibrationLearnSetupInfo_struct::distortionModel"]
		[::std::mem::offset_of!(CalibrationLearnSetupInfo_struct, distortionModel) - 4usize];
	["Offset of field: CalibrationLearnSetupInfo_struct::scaleMode"]
		[::std::mem::offset_of!(CalibrationLearnSetupInfo_struct, scaleMode) - 8usize];
	["Offset of field: CalibrationLearnSetupInfo_struct::roiMode"]
		[::std::mem::offset_of!(CalibrationLearnSetupInfo_struct, roiMode) - 12usize];
	["Offset of field: CalibrationLearnSetupInfo_struct::learnCorrectionTable"]
		[::std::mem::offset_of!(CalibrationLearnSetupInfo_struct, learnCorrectionTable) - 16usize];
};
pub type CalibrationLearnSetupInfo = CalibrationLearnSetupInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GridDescriptor_struct {
	pub xStep: f32,
	pub yStep: f32,
	pub unit: CalibrationUnit,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GridDescriptor_struct"][::std::mem::size_of::<GridDescriptor_struct>() - 12usize];
	["Alignment of GridDescriptor_struct"]
		[::std::mem::align_of::<GridDescriptor_struct>() - 4usize];
	["Offset of field: GridDescriptor_struct::xStep"]
		[::std::mem::offset_of!(GridDescriptor_struct, xStep) - 0usize];
	["Offset of field: GridDescriptor_struct::yStep"]
		[::std::mem::offset_of!(GridDescriptor_struct, yStep) - 4usize];
	["Offset of field: GridDescriptor_struct::unit"]
		[::std::mem::offset_of!(GridDescriptor_struct, unit) - 8usize];
};
pub type GridDescriptor = GridDescriptor_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ErrorStatistics_struct {
	pub mean: f64,
	pub maximum: f64,
	pub standardDeviation: f64,
	pub distortion: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ErrorStatistics_struct"][::std::mem::size_of::<ErrorStatistics_struct>() - 32usize];
	["Alignment of ErrorStatistics_struct"]
		[::std::mem::align_of::<ErrorStatistics_struct>() - 8usize];
	["Offset of field: ErrorStatistics_struct::mean"]
		[::std::mem::offset_of!(ErrorStatistics_struct, mean) - 0usize];
	["Offset of field: ErrorStatistics_struct::maximum"]
		[::std::mem::offset_of!(ErrorStatistics_struct, maximum) - 8usize];
	["Offset of field: ErrorStatistics_struct::standardDeviation"]
		[::std::mem::offset_of!(ErrorStatistics_struct, standardDeviation) - 16usize];
	["Offset of field: ErrorStatistics_struct::distortion"]
		[::std::mem::offset_of!(ErrorStatistics_struct, distortion) - 24usize];
};
pub type ErrorStatistics = ErrorStatistics_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GetCalibrationInfoReport_struct {
	pub userRoi: *mut ROI,
	pub calibrationRoi: *mut ROI,
	pub axisInfo: CalibrationAxisInfo,
	pub learnSetupInfo: CalibrationLearnSetupInfo,
	pub gridDescriptor: GridDescriptor,
	pub errorMap: *mut f32,
	pub errorMapRows: usize,
	pub errorMapCols: usize,
	pub errorStatistics: ErrorStatistics,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GetCalibrationInfoReport_struct"]
		[::std::mem::size_of::<GetCalibrationInfoReport_struct>() - 120usize];
	["Alignment of GetCalibrationInfoReport_struct"]
		[::std::mem::align_of::<GetCalibrationInfoReport_struct>() - 8usize];
	["Offset of field: GetCalibrationInfoReport_struct::userRoi"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, userRoi) - 0usize];
	["Offset of field: GetCalibrationInfoReport_struct::calibrationRoi"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, calibrationRoi) - 8usize];
	["Offset of field: GetCalibrationInfoReport_struct::axisInfo"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, axisInfo) - 16usize];
	["Offset of field: GetCalibrationInfoReport_struct::learnSetupInfo"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, learnSetupInfo) - 32usize];
	["Offset of field: GetCalibrationInfoReport_struct::gridDescriptor"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, gridDescriptor) - 52usize];
	["Offset of field: GetCalibrationInfoReport_struct::errorMap"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, errorMap) - 64usize];
	["Offset of field: GetCalibrationInfoReport_struct::errorMapRows"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, errorMapRows) - 72usize];
	["Offset of field: GetCalibrationInfoReport_struct::errorMapCols"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, errorMapCols) - 80usize];
	["Offset of field: GetCalibrationInfoReport_struct::errorStatistics"]
		[::std::mem::offset_of!(GetCalibrationInfoReport_struct, errorStatistics) - 88usize];
};
pub type GetCalibrationInfoReport = GetCalibrationInfoReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EdgePolarity_struct {
	pub start: EdgePolaritySearchMode,
	pub end: EdgePolaritySearchMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of EdgePolarity_struct"][::std::mem::size_of::<EdgePolarity_struct>() - 8usize];
	["Alignment of EdgePolarity_struct"][::std::mem::align_of::<EdgePolarity_struct>() - 4usize];
	["Offset of field: EdgePolarity_struct::start"]
		[::std::mem::offset_of!(EdgePolarity_struct, start) - 0usize];
	["Offset of field: EdgePolarity_struct::end"]
		[::std::mem::offset_of!(EdgePolarity_struct, end) - 4usize];
};
pub type EdgePolarity = EdgePolarity_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClampSettings_struct {
	pub angleRange: f64,
	pub edgePolarity: EdgePolarity,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClampSettings_struct"][::std::mem::size_of::<ClampSettings_struct>() - 16usize];
	["Alignment of ClampSettings_struct"][::std::mem::align_of::<ClampSettings_struct>() - 8usize];
	["Offset of field: ClampSettings_struct::angleRange"]
		[::std::mem::offset_of!(ClampSettings_struct, angleRange) - 0usize];
	["Offset of field: ClampSettings_struct::edgePolarity"]
		[::std::mem::offset_of!(ClampSettings_struct, edgePolarity) - 8usize];
};
pub type ClampSettings = ClampSettings_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PointDoublePair_struct {
	pub start: PointDouble,
	pub end: PointDouble,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PointDoublePair_struct"][::std::mem::size_of::<PointDoublePair_struct>() - 32usize];
	["Alignment of PointDoublePair_struct"]
		[::std::mem::align_of::<PointDoublePair_struct>() - 8usize];
	["Offset of field: PointDoublePair_struct::start"]
		[::std::mem::offset_of!(PointDoublePair_struct, start) - 0usize];
	["Offset of field: PointDoublePair_struct::end"]
		[::std::mem::offset_of!(PointDoublePair_struct, end) - 16usize];
};
pub type PointDoublePair = PointDoublePair_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClampResults_struct {
	pub distancePix: f64,
	pub distanceRealWorld: f64,
	pub angleAbs: f64,
	pub angleRelative: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClampResults_struct"][::std::mem::size_of::<ClampResults_struct>() - 32usize];
	["Alignment of ClampResults_struct"][::std::mem::align_of::<ClampResults_struct>() - 8usize];
	["Offset of field: ClampResults_struct::distancePix"]
		[::std::mem::offset_of!(ClampResults_struct, distancePix) - 0usize];
	["Offset of field: ClampResults_struct::distanceRealWorld"]
		[::std::mem::offset_of!(ClampResults_struct, distanceRealWorld) - 8usize];
	["Offset of field: ClampResults_struct::angleAbs"]
		[::std::mem::offset_of!(ClampResults_struct, angleAbs) - 16usize];
	["Offset of field: ClampResults_struct::angleRelative"]
		[::std::mem::offset_of!(ClampResults_struct, angleRelative) - 24usize];
};
pub type ClampResults = ClampResults_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClampPoints_struct {
	pub pixel: PointDoublePair,
	pub realWorld: PointDoublePair,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClampPoints_struct"][::std::mem::size_of::<ClampPoints_struct>() - 64usize];
	["Alignment of ClampPoints_struct"][::std::mem::align_of::<ClampPoints_struct>() - 8usize];
	["Offset of field: ClampPoints_struct::pixel"]
		[::std::mem::offset_of!(ClampPoints_struct, pixel) - 0usize];
	["Offset of field: ClampPoints_struct::realWorld"]
		[::std::mem::offset_of!(ClampPoints_struct, realWorld) - 32usize];
};
pub type ClampPoints = ClampPoints_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGBValue_struct {
	pub B: ::std::os::raw::c_uchar,
	pub G: ::std::os::raw::c_uchar,
	pub R: ::std::os::raw::c_uchar,
	pub alpha: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RGBValue_struct"][::std::mem::size_of::<RGBValue_struct>() - 4usize];
	["Alignment of RGBValue_struct"][::std::mem::align_of::<RGBValue_struct>() - 1usize];
	["Offset of field: RGBValue_struct::B"][::std::mem::offset_of!(RGBValue_struct, B) - 0usize];
	["Offset of field: RGBValue_struct::G"][::std::mem::offset_of!(RGBValue_struct, G) - 1usize];
	["Offset of field: RGBValue_struct::R"][::std::mem::offset_of!(RGBValue_struct, R) - 2usize];
	["Offset of field: RGBValue_struct::alpha"]
		[::std::mem::offset_of!(RGBValue_struct, alpha) - 3usize];
};
pub type RGBValue = RGBValue_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClampOverlaySettings_struct {
	pub showSearchArea: ::std::os::raw::c_int,
	pub showCurves: ::std::os::raw::c_int,
	pub showClampLocation: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub curvesColor: RGBValue,
	pub clampLocationsColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClampOverlaySettings_struct"]
		[::std::mem::size_of::<ClampOverlaySettings_struct>() - 40usize];
	["Alignment of ClampOverlaySettings_struct"]
		[::std::mem::align_of::<ClampOverlaySettings_struct>() - 8usize];
	["Offset of field: ClampOverlaySettings_struct::showSearchArea"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, showSearchArea) - 0usize];
	["Offset of field: ClampOverlaySettings_struct::showCurves"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, showCurves) - 4usize];
	["Offset of field: ClampOverlaySettings_struct::showClampLocation"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, showClampLocation) - 8usize];
	["Offset of field: ClampOverlaySettings_struct::showResult"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, showResult) - 12usize];
	["Offset of field: ClampOverlaySettings_struct::searchAreaColor"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, searchAreaColor) - 16usize];
	["Offset of field: ClampOverlaySettings_struct::curvesColor"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, curvesColor) - 20usize];
	["Offset of field: ClampOverlaySettings_struct::clampLocationsColor"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, clampLocationsColor) - 24usize];
	["Offset of field: ClampOverlaySettings_struct::resultColor"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, resultColor) - 28usize];
	["Offset of field: ClampOverlaySettings_struct::overlayGroupName"]
		[::std::mem::offset_of!(ClampOverlaySettings_struct, overlayGroupName) - 32usize];
};
pub type ClampOverlaySettings = ClampOverlaySettings_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClampMax2Report_struct {
	pub clampResults: ClampResults,
	pub clampPoints: ClampPoints,
	pub calibrationValid: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClampMax2Report_struct"][::std::mem::size_of::<ClampMax2Report_struct>() - 104usize];
	["Alignment of ClampMax2Report_struct"]
		[::std::mem::align_of::<ClampMax2Report_struct>() - 8usize];
	["Offset of field: ClampMax2Report_struct::clampResults"]
		[::std::mem::offset_of!(ClampMax2Report_struct, clampResults) - 0usize];
	["Offset of field: ClampMax2Report_struct::clampPoints"]
		[::std::mem::offset_of!(ClampMax2Report_struct, clampPoints) - 32usize];
	["Offset of field: ClampMax2Report_struct::calibrationValid"]
		[::std::mem::offset_of!(ClampMax2Report_struct, calibrationValid) - 96usize];
};
pub type ClampMax2Report = ClampMax2Report_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourFitSplineReport_struct {
	pub points: *mut PointDouble,
	pub numberOfPoints: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourFitSplineReport_struct"]
		[::std::mem::size_of::<ContourFitSplineReport_struct>() - 16usize];
	["Alignment of ContourFitSplineReport_struct"]
		[::std::mem::align_of::<ContourFitSplineReport_struct>() - 8usize];
	["Offset of field: ContourFitSplineReport_struct::points"]
		[::std::mem::offset_of!(ContourFitSplineReport_struct, points) - 0usize];
	["Offset of field: ContourFitSplineReport_struct::numberOfPoints"]
		[::std::mem::offset_of!(ContourFitSplineReport_struct, numberOfPoints) - 8usize];
};
pub type ContourFitSplineReport = ContourFitSplineReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LineFloat_struct {
	pub start: PointFloat,
	pub end: PointFloat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of LineFloat_struct"][::std::mem::size_of::<LineFloat_struct>() - 16usize];
	["Alignment of LineFloat_struct"][::std::mem::align_of::<LineFloat_struct>() - 4usize];
	["Offset of field: LineFloat_struct::start"]
		[::std::mem::offset_of!(LineFloat_struct, start) - 0usize];
	["Offset of field: LineFloat_struct::end"]
		[::std::mem::offset_of!(LineFloat_struct, end) - 8usize];
};
pub type LineFloat = LineFloat_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BarcodeInfo2_struct {
	pub data: *mut ::std::os::raw::c_uchar,
	pub numdata: ::std::os::raw::c_uint,
	pub char1: ::std::os::raw::c_uchar,
	pub char2: ::std::os::raw::c_uchar,
	pub checkSums: ::std::os::raw::c_uchar,
	pub type_: BarcodeType,
	pub confidenceLevel: f32,
	pub boundingBox: *mut PointFloat,
	pub numBox: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of BarcodeInfo2_struct"][::std::mem::size_of::<BarcodeInfo2_struct>() - 40usize];
	["Alignment of BarcodeInfo2_struct"][::std::mem::align_of::<BarcodeInfo2_struct>() - 8usize];
	["Offset of field: BarcodeInfo2_struct::data"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, data) - 0usize];
	["Offset of field: BarcodeInfo2_struct::numdata"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, numdata) - 8usize];
	["Offset of field: BarcodeInfo2_struct::char1"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, char1) - 12usize];
	["Offset of field: BarcodeInfo2_struct::char2"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, char2) - 13usize];
	["Offset of field: BarcodeInfo2_struct::checkSums"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, checkSums) - 14usize];
	["Offset of field: BarcodeInfo2_struct::type_"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, type_) - 16usize];
	["Offset of field: BarcodeInfo2_struct::confidenceLevel"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, confidenceLevel) - 20usize];
	["Offset of field: BarcodeInfo2_struct::boundingBox"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, boundingBox) - 24usize];
	["Offset of field: BarcodeInfo2_struct::numBox"]
		[::std::mem::offset_of!(BarcodeInfo2_struct, numBox) - 32usize];
};
pub type BarcodeInfo2 = BarcodeInfo2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Barcode1DSearchOptions_struct {
	pub minBarcodeWidth: ::std::os::raw::c_uint,
	pub minEdgeStrength: ::std::os::raw::c_uint,
	pub minBars: ::std::os::raw::c_uint,
	pub skipLocationSearch: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of Barcode1DSearchOptions_struct"]
		[::std::mem::size_of::<Barcode1DSearchOptions_struct>() - 16usize];
	["Alignment of Barcode1DSearchOptions_struct"]
		[::std::mem::align_of::<Barcode1DSearchOptions_struct>() - 4usize];
	["Offset of field: Barcode1DSearchOptions_struct::minBarcodeWidth"]
		[::std::mem::offset_of!(Barcode1DSearchOptions_struct, minBarcodeWidth) - 0usize];
	["Offset of field: Barcode1DSearchOptions_struct::minEdgeStrength"]
		[::std::mem::offset_of!(Barcode1DSearchOptions_struct, minEdgeStrength) - 4usize];
	["Offset of field: Barcode1DSearchOptions_struct::minBars"]
		[::std::mem::offset_of!(Barcode1DSearchOptions_struct, minBars) - 8usize];
	["Offset of field: Barcode1DSearchOptions_struct::skipLocationSearch"]
		[::std::mem::offset_of!(Barcode1DSearchOptions_struct, skipLocationSearch) - 12usize];
};
pub type Barcode1DSearchOptions = Barcode1DSearchOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LineEquation_struct {
	pub a: f64,
	pub b: f64,
	pub c: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of LineEquation_struct"][::std::mem::size_of::<LineEquation_struct>() - 24usize];
	["Alignment of LineEquation_struct"][::std::mem::align_of::<LineEquation_struct>() - 8usize];
	["Offset of field: LineEquation_struct::a"]
		[::std::mem::offset_of!(LineEquation_struct, a) - 0usize];
	["Offset of field: LineEquation_struct::b"]
		[::std::mem::offset_of!(LineEquation_struct, b) - 8usize];
	["Offset of field: LineEquation_struct::c"]
		[::std::mem::offset_of!(LineEquation_struct, c) - 16usize];
};
pub type LineEquation = LineEquation_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourFitLineReport_struct {
	pub lineSegment: LineFloat,
	pub lineEquation: LineEquation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourFitLineReport_struct"]
		[::std::mem::size_of::<ContourFitLineReport_struct>() - 40usize];
	["Alignment of ContourFitLineReport_struct"]
		[::std::mem::align_of::<ContourFitLineReport_struct>() - 8usize];
	["Offset of field: ContourFitLineReport_struct::lineSegment"]
		[::std::mem::offset_of!(ContourFitLineReport_struct, lineSegment) - 0usize];
	["Offset of field: ContourFitLineReport_struct::lineEquation"]
		[::std::mem::offset_of!(ContourFitLineReport_struct, lineEquation) - 16usize];
};
pub type ContourFitLineReport = ContourFitLineReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourFitPolynomialReport_struct {
	pub bestFit: *mut PointDouble,
	pub numberOfPoints: ::std::os::raw::c_int,
	pub polynomialCoefficients: *mut f64,
	pub numberOfCoefficients: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourFitPolynomialReport_struct"]
		[::std::mem::size_of::<ContourFitPolynomialReport_struct>() - 32usize];
	["Alignment of ContourFitPolynomialReport_struct"]
		[::std::mem::align_of::<ContourFitPolynomialReport_struct>() - 8usize];
	["Offset of field: ContourFitPolynomialReport_struct::bestFit"]
		[::std::mem::offset_of!(ContourFitPolynomialReport_struct, bestFit) - 0usize];
	["Offset of field: ContourFitPolynomialReport_struct::numberOfPoints"]
		[::std::mem::offset_of!(ContourFitPolynomialReport_struct, numberOfPoints) - 8usize];
	["Offset of field: ContourFitPolynomialReport_struct::polynomialCoefficients"][::std::mem::offset_of!(
		ContourFitPolynomialReport_struct,
		polynomialCoefficients
	) - 16usize];
	["Offset of field: ContourFitPolynomialReport_struct::numberOfCoefficients"]
		[::std::mem::offset_of!(ContourFitPolynomialReport_struct, numberOfCoefficients) - 24usize];
};
pub type ContourFitPolynomialReport = ContourFitPolynomialReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CornerOption_struct {
	pub detectorType: CornerOperators,
	pub kernelSize: ::std::os::raw::c_int,
	pub minCornerPointStrength: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CornerOption_struct"][::std::mem::size_of::<CornerOption_struct>() - 16usize];
	["Alignment of CornerOption_struct"][::std::mem::align_of::<CornerOption_struct>() - 8usize];
	["Offset of field: CornerOption_struct::detectorType"]
		[::std::mem::offset_of!(CornerOption_struct, detectorType) - 0usize];
	["Offset of field: CornerOption_struct::kernelSize"]
		[::std::mem::offset_of!(CornerOption_struct, kernelSize) - 4usize];
	["Offset of field: CornerOption_struct::minCornerPointStrength"]
		[::std::mem::offset_of!(CornerOption_struct, minCornerPointStrength) - 8usize];
};
pub type CornerOption = CornerOption_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartialCircle_struct {
	pub center: PointFloat,
	pub radius: f64,
	pub startAngle: f64,
	pub endAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PartialCircle_struct"][::std::mem::size_of::<PartialCircle_struct>() - 32usize];
	["Alignment of PartialCircle_struct"][::std::mem::align_of::<PartialCircle_struct>() - 8usize];
	["Offset of field: PartialCircle_struct::center"]
		[::std::mem::offset_of!(PartialCircle_struct, center) - 0usize];
	["Offset of field: PartialCircle_struct::radius"]
		[::std::mem::offset_of!(PartialCircle_struct, radius) - 8usize];
	["Offset of field: PartialCircle_struct::startAngle"]
		[::std::mem::offset_of!(PartialCircle_struct, startAngle) - 16usize];
	["Offset of field: PartialCircle_struct::endAngle"]
		[::std::mem::offset_of!(PartialCircle_struct, endAngle) - 24usize];
};
pub type PartialCircle = PartialCircle_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartialEllipse_struct {
	pub center: PointFloat,
	pub angle: f64,
	pub majorRadius: f64,
	pub minorRadius: f64,
	pub startAngle: f64,
	pub endAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of PartialEllipse_struct"][::std::mem::size_of::<PartialEllipse_struct>() - 48usize];
	["Alignment of PartialEllipse_struct"]
		[::std::mem::align_of::<PartialEllipse_struct>() - 8usize];
	["Offset of field: PartialEllipse_struct::center"]
		[::std::mem::offset_of!(PartialEllipse_struct, center) - 0usize];
	["Offset of field: PartialEllipse_struct::angle"]
		[::std::mem::offset_of!(PartialEllipse_struct, angle) - 8usize];
	["Offset of field: PartialEllipse_struct::majorRadius"]
		[::std::mem::offset_of!(PartialEllipse_struct, majorRadius) - 16usize];
	["Offset of field: PartialEllipse_struct::minorRadius"]
		[::std::mem::offset_of!(PartialEllipse_struct, minorRadius) - 24usize];
	["Offset of field: PartialEllipse_struct::startAngle"]
		[::std::mem::offset_of!(PartialEllipse_struct, startAngle) - 32usize];
	["Offset of field: PartialEllipse_struct::endAngle"]
		[::std::mem::offset_of!(PartialEllipse_struct, endAngle) - 40usize];
};
pub type PartialEllipse = PartialEllipse_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SetupMatchPatternData_struct {
	pub matchSetupData: *mut ::std::os::raw::c_uchar,
	pub numMatchSetupData: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SetupMatchPatternData_struct"]
		[::std::mem::size_of::<SetupMatchPatternData_struct>() - 16usize];
	["Alignment of SetupMatchPatternData_struct"]
		[::std::mem::align_of::<SetupMatchPatternData_struct>() - 8usize];
	["Offset of field: SetupMatchPatternData_struct::matchSetupData"]
		[::std::mem::offset_of!(SetupMatchPatternData_struct, matchSetupData) - 0usize];
	["Offset of field: SetupMatchPatternData_struct::numMatchSetupData"]
		[::std::mem::offset_of!(SetupMatchPatternData_struct, numMatchSetupData) - 8usize];
};
pub type SetupMatchPatternData = SetupMatchPatternData_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeSettingDouble_struct {
	pub settingType: SettingType,
	pub min: f64,
	pub max: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RangeSettingDouble_struct"]
		[::std::mem::size_of::<RangeSettingDouble_struct>() - 24usize];
	["Alignment of RangeSettingDouble_struct"]
		[::std::mem::align_of::<RangeSettingDouble_struct>() - 8usize];
	["Offset of field: RangeSettingDouble_struct::settingType"]
		[::std::mem::offset_of!(RangeSettingDouble_struct, settingType) - 0usize];
	["Offset of field: RangeSettingDouble_struct::min"]
		[::std::mem::offset_of!(RangeSettingDouble_struct, min) - 8usize];
	["Offset of field: RangeSettingDouble_struct::max"]
		[::std::mem::offset_of!(RangeSettingDouble_struct, max) - 16usize];
};
pub type RangeSettingDouble = RangeSettingDouble_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GeometricAdvancedSetupDataOption_struct {
	pub type_: GeometricSetupDataItem,
	pub value: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GeometricAdvancedSetupDataOption_struct"]
		[::std::mem::size_of::<GeometricAdvancedSetupDataOption_struct>() - 16usize];
	["Alignment of GeometricAdvancedSetupDataOption_struct"]
		[::std::mem::align_of::<GeometricAdvancedSetupDataOption_struct>() - 8usize];
	["Offset of field: GeometricAdvancedSetupDataOption_struct::type_"]
		[::std::mem::offset_of!(GeometricAdvancedSetupDataOption_struct, type_) - 0usize];
	["Offset of field: GeometricAdvancedSetupDataOption_struct::value"]
		[::std::mem::offset_of!(GeometricAdvancedSetupDataOption_struct, value) - 8usize];
};
pub type GeometricAdvancedSetupDataOption = GeometricAdvancedSetupDataOption_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourInfoReport_struct {
	pub pointsPixel: *mut PointDouble,
	pub numPointsPixel: ::std::os::raw::c_uint,
	pub pointsReal: *mut PointDouble,
	pub numPointsReal: ::std::os::raw::c_uint,
	pub curvaturePixel: *mut f64,
	pub numCurvaturePixel: ::std::os::raw::c_uint,
	pub curvatureReal: *mut f64,
	pub numCurvatureReal: ::std::os::raw::c_uint,
	pub length: f64,
	pub lengthReal: f64,
	pub hasEquation: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourInfoReport_struct"]
		[::std::mem::size_of::<ContourInfoReport_struct>() - 88usize];
	["Alignment of ContourInfoReport_struct"]
		[::std::mem::align_of::<ContourInfoReport_struct>() - 8usize];
	["Offset of field: ContourInfoReport_struct::pointsPixel"]
		[::std::mem::offset_of!(ContourInfoReport_struct, pointsPixel) - 0usize];
	["Offset of field: ContourInfoReport_struct::numPointsPixel"]
		[::std::mem::offset_of!(ContourInfoReport_struct, numPointsPixel) - 8usize];
	["Offset of field: ContourInfoReport_struct::pointsReal"]
		[::std::mem::offset_of!(ContourInfoReport_struct, pointsReal) - 16usize];
	["Offset of field: ContourInfoReport_struct::numPointsReal"]
		[::std::mem::offset_of!(ContourInfoReport_struct, numPointsReal) - 24usize];
	["Offset of field: ContourInfoReport_struct::curvaturePixel"]
		[::std::mem::offset_of!(ContourInfoReport_struct, curvaturePixel) - 32usize];
	["Offset of field: ContourInfoReport_struct::numCurvaturePixel"]
		[::std::mem::offset_of!(ContourInfoReport_struct, numCurvaturePixel) - 40usize];
	["Offset of field: ContourInfoReport_struct::curvatureReal"]
		[::std::mem::offset_of!(ContourInfoReport_struct, curvatureReal) - 48usize];
	["Offset of field: ContourInfoReport_struct::numCurvatureReal"]
		[::std::mem::offset_of!(ContourInfoReport_struct, numCurvatureReal) - 56usize];
	["Offset of field: ContourInfoReport_struct::length"]
		[::std::mem::offset_of!(ContourInfoReport_struct, length) - 64usize];
	["Offset of field: ContourInfoReport_struct::lengthReal"]
		[::std::mem::offset_of!(ContourInfoReport_struct, lengthReal) - 72usize];
	["Offset of field: ContourInfoReport_struct::hasEquation"]
		[::std::mem::offset_of!(ContourInfoReport_struct, hasEquation) - 80usize];
};
pub type ContourInfoReport = ContourInfoReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ROILabel_struct {
	pub className: *mut ::std::os::raw::c_char,
	pub label: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ROILabel_struct"][::std::mem::size_of::<ROILabel_struct>() - 16usize];
	["Alignment of ROILabel_struct"][::std::mem::align_of::<ROILabel_struct>() - 8usize];
	["Offset of field: ROILabel_struct::className"]
		[::std::mem::offset_of!(ROILabel_struct, className) - 0usize];
	["Offset of field: ROILabel_struct::label"]
		[::std::mem::offset_of!(ROILabel_struct, label) - 8usize];
};
pub type ROILabel = ROILabel_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SupervisedColorSegmentationReport_struct {
	pub labelOut: *mut ROILabel,
	pub numLabelOut: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SupervisedColorSegmentationReport_struct"]
		[::std::mem::size_of::<SupervisedColorSegmentationReport_struct>() - 16usize];
	["Alignment of SupervisedColorSegmentationReport_struct"]
		[::std::mem::align_of::<SupervisedColorSegmentationReport_struct>() - 8usize];
	["Offset of field: SupervisedColorSegmentationReport_struct::labelOut"]
		[::std::mem::offset_of!(SupervisedColorSegmentationReport_struct, labelOut) - 0usize];
	["Offset of field: SupervisedColorSegmentationReport_struct::numLabelOut"]
		[::std::mem::offset_of!(SupervisedColorSegmentationReport_struct, numLabelOut) - 8usize];
};
pub type SupervisedColorSegmentationReport = SupervisedColorSegmentationReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LabelToROIReport_struct {
	pub roiArray: *mut *mut ROI,
	pub numOfROIs: ::std::os::raw::c_uint,
	pub labelsOutArray: *mut ::std::os::raw::c_uint,
	pub numOfLabels: ::std::os::raw::c_uint,
	pub isTooManyVectorsArray: *mut ::std::os::raw::c_int,
	pub isTooManyVectorsArraySize: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of LabelToROIReport_struct"][::std::mem::size_of::<LabelToROIReport_struct>() - 48usize];
	["Alignment of LabelToROIReport_struct"]
		[::std::mem::align_of::<LabelToROIReport_struct>() - 8usize];
	["Offset of field: LabelToROIReport_struct::roiArray"]
		[::std::mem::offset_of!(LabelToROIReport_struct, roiArray) - 0usize];
	["Offset of field: LabelToROIReport_struct::numOfROIs"]
		[::std::mem::offset_of!(LabelToROIReport_struct, numOfROIs) - 8usize];
	["Offset of field: LabelToROIReport_struct::labelsOutArray"]
		[::std::mem::offset_of!(LabelToROIReport_struct, labelsOutArray) - 16usize];
	["Offset of field: LabelToROIReport_struct::numOfLabels"]
		[::std::mem::offset_of!(LabelToROIReport_struct, numOfLabels) - 24usize];
	["Offset of field: LabelToROIReport_struct::isTooManyVectorsArray"]
		[::std::mem::offset_of!(LabelToROIReport_struct, isTooManyVectorsArray) - 32usize];
	["Offset of field: LabelToROIReport_struct::isTooManyVectorsArraySize"]
		[::std::mem::offset_of!(LabelToROIReport_struct, isTooManyVectorsArraySize) - 40usize];
};
pub type LabelToROIReport = LabelToROIReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColorSegmenationOptions_struct {
	pub windowX: ::std::os::raw::c_uint,
	pub windowY: ::std::os::raw::c_uint,
	pub stepSize: ::std::os::raw::c_uint,
	pub minParticleArea: ::std::os::raw::c_uint,
	pub maxParticleArea: ::std::os::raw::c_uint,
	pub isFineSegment: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ColorSegmenationOptions_struct"]
		[::std::mem::size_of::<ColorSegmenationOptions_struct>() - 24usize];
	["Alignment of ColorSegmenationOptions_struct"]
		[::std::mem::align_of::<ColorSegmenationOptions_struct>() - 4usize];
	["Offset of field: ColorSegmenationOptions_struct::windowX"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, windowX) - 0usize];
	["Offset of field: ColorSegmenationOptions_struct::windowY"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, windowY) - 4usize];
	["Offset of field: ColorSegmenationOptions_struct::stepSize"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, stepSize) - 8usize];
	["Offset of field: ColorSegmenationOptions_struct::minParticleArea"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, minParticleArea) - 12usize];
	["Offset of field: ColorSegmenationOptions_struct::maxParticleArea"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, maxParticleArea) - 16usize];
	["Offset of field: ColorSegmenationOptions_struct::isFineSegment"]
		[::std::mem::offset_of!(ColorSegmenationOptions_struct, isFineSegment) - 20usize];
};
pub type ColorSegmenationOptions = ColorSegmenationOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassifiedCurve_struct {
	pub length: f64,
	pub lengthReal: f64,
	pub maxCurvature: f64,
	pub maxCurvatureReal: f64,
	pub label: ::std::os::raw::c_uint,
	pub curvePoints: *mut PointDouble,
	pub numCurvePoints: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClassifiedCurve_struct"][::std::mem::size_of::<ClassifiedCurve_struct>() - 56usize];
	["Alignment of ClassifiedCurve_struct"]
		[::std::mem::align_of::<ClassifiedCurve_struct>() - 8usize];
	["Offset of field: ClassifiedCurve_struct::length"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, length) - 0usize];
	["Offset of field: ClassifiedCurve_struct::lengthReal"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, lengthReal) - 8usize];
	["Offset of field: ClassifiedCurve_struct::maxCurvature"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, maxCurvature) - 16usize];
	["Offset of field: ClassifiedCurve_struct::maxCurvatureReal"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, maxCurvatureReal) - 24usize];
	["Offset of field: ClassifiedCurve_struct::label"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, label) - 32usize];
	["Offset of field: ClassifiedCurve_struct::curvePoints"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, curvePoints) - 40usize];
	["Offset of field: ClassifiedCurve_struct::numCurvePoints"]
		[::std::mem::offset_of!(ClassifiedCurve_struct, numCurvePoints) - 48usize];
};
pub type ClassifiedCurve = ClassifiedCurve_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeDouble_struct {
	pub minValue: f64,
	pub maxValue: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RangeDouble_struct"][::std::mem::size_of::<RangeDouble_struct>() - 16usize];
	["Alignment of RangeDouble_struct"][::std::mem::align_of::<RangeDouble_struct>() - 8usize];
	["Offset of field: RangeDouble_struct::minValue"]
		[::std::mem::offset_of!(RangeDouble_struct, minValue) - 0usize];
	["Offset of field: RangeDouble_struct::maxValue"]
		[::std::mem::offset_of!(RangeDouble_struct, maxValue) - 8usize];
};
pub type RangeDouble = RangeDouble_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeLabel_struct {
	pub range: RangeDouble,
	pub label: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RangeLabel_struct"][::std::mem::size_of::<RangeLabel_struct>() - 24usize];
	["Alignment of RangeLabel_struct"][::std::mem::align_of::<RangeLabel_struct>() - 8usize];
	["Offset of field: RangeLabel_struct::range"]
		[::std::mem::offset_of!(RangeLabel_struct, range) - 0usize];
	["Offset of field: RangeLabel_struct::label"]
		[::std::mem::offset_of!(RangeLabel_struct, label) - 16usize];
};
pub type RangeLabel = RangeLabel_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CurvatureAnalysisReport_struct {
	pub curves: *mut ClassifiedCurve,
	pub numCurves: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CurvatureAnalysisReport_struct"]
		[::std::mem::size_of::<CurvatureAnalysisReport_struct>() - 16usize];
	["Alignment of CurvatureAnalysisReport_struct"]
		[::std::mem::align_of::<CurvatureAnalysisReport_struct>() - 8usize];
	["Offset of field: CurvatureAnalysisReport_struct::curves"]
		[::std::mem::offset_of!(CurvatureAnalysisReport_struct, curves) - 0usize];
	["Offset of field: CurvatureAnalysisReport_struct::numCurves"]
		[::std::mem::offset_of!(CurvatureAnalysisReport_struct, numCurves) - 8usize];
};
pub type CurvatureAnalysisReport = CurvatureAnalysisReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Disparity_struct {
	pub current: PointDouble,
	pub reference: PointDouble,
	pub distance: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of Disparity_struct"][::std::mem::size_of::<Disparity_struct>() - 40usize];
	["Alignment of Disparity_struct"][::std::mem::align_of::<Disparity_struct>() - 8usize];
	["Offset of field: Disparity_struct::current"]
		[::std::mem::offset_of!(Disparity_struct, current) - 0usize];
	["Offset of field: Disparity_struct::reference"]
		[::std::mem::offset_of!(Disparity_struct, reference) - 16usize];
	["Offset of field: Disparity_struct::distance"]
		[::std::mem::offset_of!(Disparity_struct, distance) - 32usize];
};
pub type Disparity = Disparity_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ComputeDistancesReport_struct {
	pub distances: *mut Disparity,
	pub numDistances: ::std::os::raw::c_uint,
	pub distancesReal: *mut Disparity,
	pub numDistancesReal: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ComputeDistancesReport_struct"]
		[::std::mem::size_of::<ComputeDistancesReport_struct>() - 32usize];
	["Alignment of ComputeDistancesReport_struct"]
		[::std::mem::align_of::<ComputeDistancesReport_struct>() - 8usize];
	["Offset of field: ComputeDistancesReport_struct::distances"]
		[::std::mem::offset_of!(ComputeDistancesReport_struct, distances) - 0usize];
	["Offset of field: ComputeDistancesReport_struct::numDistances"]
		[::std::mem::offset_of!(ComputeDistancesReport_struct, numDistances) - 8usize];
	["Offset of field: ComputeDistancesReport_struct::distancesReal"]
		[::std::mem::offset_of!(ComputeDistancesReport_struct, distancesReal) - 16usize];
	["Offset of field: ComputeDistancesReport_struct::numDistancesReal"]
		[::std::mem::offset_of!(ComputeDistancesReport_struct, numDistancesReal) - 24usize];
};
pub type ComputeDistancesReport = ComputeDistancesReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MatchMode_struct {
	pub rotation: ::std::os::raw::c_uint,
	pub scale: ::std::os::raw::c_uint,
	pub occlusion: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MatchMode_struct"][::std::mem::size_of::<MatchMode_struct>() - 12usize];
	["Alignment of MatchMode_struct"][::std::mem::align_of::<MatchMode_struct>() - 4usize];
	["Offset of field: MatchMode_struct::rotation"]
		[::std::mem::offset_of!(MatchMode_struct, rotation) - 0usize];
	["Offset of field: MatchMode_struct::scale"]
		[::std::mem::offset_of!(MatchMode_struct, scale) - 4usize];
	["Offset of field: MatchMode_struct::occlusion"]
		[::std::mem::offset_of!(MatchMode_struct, occlusion) - 8usize];
};
pub type MatchMode = MatchMode_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassifiedDisparity_struct {
	pub length: f64,
	pub lengthReal: f64,
	pub maxDistance: f64,
	pub maxDistanceReal: f64,
	pub label: ::std::os::raw::c_uint,
	pub templateSubsection: *mut PointDouble,
	pub numTemplateSubsection: ::std::os::raw::c_uint,
	pub targetSubsection: *mut PointDouble,
	pub numTargetSubsection: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClassifiedDisparity_struct"]
		[::std::mem::size_of::<ClassifiedDisparity_struct>() - 72usize];
	["Alignment of ClassifiedDisparity_struct"]
		[::std::mem::align_of::<ClassifiedDisparity_struct>() - 8usize];
	["Offset of field: ClassifiedDisparity_struct::length"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, length) - 0usize];
	["Offset of field: ClassifiedDisparity_struct::lengthReal"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, lengthReal) - 8usize];
	["Offset of field: ClassifiedDisparity_struct::maxDistance"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, maxDistance) - 16usize];
	["Offset of field: ClassifiedDisparity_struct::maxDistanceReal"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, maxDistanceReal) - 24usize];
	["Offset of field: ClassifiedDisparity_struct::label"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, label) - 32usize];
	["Offset of field: ClassifiedDisparity_struct::templateSubsection"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, templateSubsection) - 40usize];
	["Offset of field: ClassifiedDisparity_struct::numTemplateSubsection"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, numTemplateSubsection) - 48usize];
	["Offset of field: ClassifiedDisparity_struct::targetSubsection"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, targetSubsection) - 56usize];
	["Offset of field: ClassifiedDisparity_struct::numTargetSubsection"]
		[::std::mem::offset_of!(ClassifiedDisparity_struct, numTargetSubsection) - 64usize];
};
pub type ClassifiedDisparity = ClassifiedDisparity_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassifyDistancesReport_struct {
	pub classifiedDistances: *mut ClassifiedDisparity,
	pub numClassifiedDistances: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClassifyDistancesReport_struct"]
		[::std::mem::size_of::<ClassifyDistancesReport_struct>() - 16usize];
	["Alignment of ClassifyDistancesReport_struct"]
		[::std::mem::align_of::<ClassifyDistancesReport_struct>() - 8usize];
	["Offset of field: ClassifyDistancesReport_struct::classifiedDistances"]
		[::std::mem::offset_of!(ClassifyDistancesReport_struct, classifiedDistances) - 0usize];
	["Offset of field: ClassifyDistancesReport_struct::numClassifiedDistances"]
		[::std::mem::offset_of!(ClassifyDistancesReport_struct, numClassifiedDistances) - 8usize];
};
pub type ClassifyDistancesReport = ClassifyDistancesReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourComputeCurvatureReport_struct {
	pub curvaturePixel: *mut f64,
	pub numCurvaturePixel: ::std::os::raw::c_uint,
	pub curvatureReal: *mut f64,
	pub numCurvatureReal: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourComputeCurvatureReport_struct"]
		[::std::mem::size_of::<ContourComputeCurvatureReport_struct>() - 32usize];
	["Alignment of ContourComputeCurvatureReport_struct"]
		[::std::mem::align_of::<ContourComputeCurvatureReport_struct>() - 8usize];
	["Offset of field: ContourComputeCurvatureReport_struct::curvaturePixel"]
		[::std::mem::offset_of!(ContourComputeCurvatureReport_struct, curvaturePixel) - 0usize];
	["Offset of field: ContourComputeCurvatureReport_struct::numCurvaturePixel"]
		[::std::mem::offset_of!(ContourComputeCurvatureReport_struct, numCurvaturePixel) - 8usize];
	["Offset of field: ContourComputeCurvatureReport_struct::curvatureReal"]
		[::std::mem::offset_of!(ContourComputeCurvatureReport_struct, curvatureReal) - 16usize];
	["Offset of field: ContourComputeCurvatureReport_struct::numCurvatureReal"]
		[::std::mem::offset_of!(ContourComputeCurvatureReport_struct, numCurvatureReal) - 24usize];
};
pub type ContourComputeCurvatureReport = ContourComputeCurvatureReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContourOverlaySettings_struct {
	pub overlay: ::std::os::raw::c_uint,
	pub color: RGBValue,
	pub width: ::std::os::raw::c_uint,
	pub maintainWidth: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ContourOverlaySettings_struct"]
		[::std::mem::size_of::<ContourOverlaySettings_struct>() - 16usize];
	["Alignment of ContourOverlaySettings_struct"]
		[::std::mem::align_of::<ContourOverlaySettings_struct>() - 4usize];
	["Offset of field: ContourOverlaySettings_struct::overlay"]
		[::std::mem::offset_of!(ContourOverlaySettings_struct, overlay) - 0usize];
	["Offset of field: ContourOverlaySettings_struct::color"]
		[::std::mem::offset_of!(ContourOverlaySettings_struct, color) - 4usize];
	["Offset of field: ContourOverlaySettings_struct::width"]
		[::std::mem::offset_of!(ContourOverlaySettings_struct, width) - 8usize];
	["Offset of field: ContourOverlaySettings_struct::maintainWidth"]
		[::std::mem::offset_of!(ContourOverlaySettings_struct, maintainWidth) - 12usize];
};
pub type ContourOverlaySettings = ContourOverlaySettings_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CurveParameters_struct {
	pub extractionMode: ExtractionMode,
	pub threshold: ::std::os::raw::c_int,
	pub filterSize: EdgeFilterSize,
	pub minLength: ::std::os::raw::c_int,
	pub searchStep: ::std::os::raw::c_int,
	pub maxEndPointGap: ::std::os::raw::c_int,
	pub subpixel: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CurveParameters_struct"][::std::mem::size_of::<CurveParameters_struct>() - 28usize];
	["Alignment of CurveParameters_struct"]
		[::std::mem::align_of::<CurveParameters_struct>() - 4usize];
	["Offset of field: CurveParameters_struct::extractionMode"]
		[::std::mem::offset_of!(CurveParameters_struct, extractionMode) - 0usize];
	["Offset of field: CurveParameters_struct::threshold"]
		[::std::mem::offset_of!(CurveParameters_struct, threshold) - 4usize];
	["Offset of field: CurveParameters_struct::filterSize"]
		[::std::mem::offset_of!(CurveParameters_struct, filterSize) - 8usize];
	["Offset of field: CurveParameters_struct::minLength"]
		[::std::mem::offset_of!(CurveParameters_struct, minLength) - 12usize];
	["Offset of field: CurveParameters_struct::searchStep"]
		[::std::mem::offset_of!(CurveParameters_struct, searchStep) - 16usize];
	["Offset of field: CurveParameters_struct::maxEndPointGap"]
		[::std::mem::offset_of!(CurveParameters_struct, maxEndPointGap) - 20usize];
	["Offset of field: CurveParameters_struct::subpixel"]
		[::std::mem::offset_of!(CurveParameters_struct, subpixel) - 24usize];
};
pub type CurveParameters = CurveParameters_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExtractContourReport_struct {
	pub contourPoints: *mut PointDouble,
	pub numContourPoints: ::std::os::raw::c_int,
	pub sourcePoints: *mut PointDouble,
	pub numSourcePoints: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ExtractContourReport_struct"]
		[::std::mem::size_of::<ExtractContourReport_struct>() - 32usize];
	["Alignment of ExtractContourReport_struct"]
		[::std::mem::align_of::<ExtractContourReport_struct>() - 8usize];
	["Offset of field: ExtractContourReport_struct::contourPoints"]
		[::std::mem::offset_of!(ExtractContourReport_struct, contourPoints) - 0usize];
	["Offset of field: ExtractContourReport_struct::numContourPoints"]
		[::std::mem::offset_of!(ExtractContourReport_struct, numContourPoints) - 8usize];
	["Offset of field: ExtractContourReport_struct::sourcePoints"]
		[::std::mem::offset_of!(ExtractContourReport_struct, sourcePoints) - 16usize];
	["Offset of field: ExtractContourReport_struct::numSourcePoints"]
		[::std::mem::offset_of!(ExtractContourReport_struct, numSourcePoints) - 24usize];
};
pub type ExtractContourReport = ExtractContourReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConnectionConstraint_struct {
	pub constraintType: ConnectionConstraintType,
	pub range: RangeDouble,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ConnectionConstraint_struct"]
		[::std::mem::size_of::<ConnectionConstraint_struct>() - 24usize];
	["Alignment of ConnectionConstraint_struct"]
		[::std::mem::align_of::<ConnectionConstraint_struct>() - 8usize];
	["Offset of field: ConnectionConstraint_struct::constraintType"]
		[::std::mem::offset_of!(ConnectionConstraint_struct, constraintType) - 0usize];
	["Offset of field: ConnectionConstraint_struct::range"]
		[::std::mem::offset_of!(ConnectionConstraint_struct, range) - 8usize];
};
pub type ConnectionConstraint = ConnectionConstraint_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExtractTextureFeaturesReport_struct {
	pub waveletBands: *mut ::std::os::raw::c_int,
	pub numWaveletBands: ::std::os::raw::c_int,
	pub textureFeatures: *mut *mut f64,
	pub textureFeaturesRows: ::std::os::raw::c_int,
	pub textureFeaturesCols: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ExtractTextureFeaturesReport_struct"]
		[::std::mem::size_of::<ExtractTextureFeaturesReport_struct>() - 32usize];
	["Alignment of ExtractTextureFeaturesReport_struct"]
		[::std::mem::align_of::<ExtractTextureFeaturesReport_struct>() - 8usize];
	["Offset of field: ExtractTextureFeaturesReport_struct::waveletBands"]
		[::std::mem::offset_of!(ExtractTextureFeaturesReport_struct, waveletBands) - 0usize];
	["Offset of field: ExtractTextureFeaturesReport_struct::numWaveletBands"]
		[::std::mem::offset_of!(ExtractTextureFeaturesReport_struct, numWaveletBands) - 8usize];
	["Offset of field: ExtractTextureFeaturesReport_struct::textureFeatures"]
		[::std::mem::offset_of!(ExtractTextureFeaturesReport_struct, textureFeatures) - 16usize];
	["Offset of field: ExtractTextureFeaturesReport_struct::textureFeaturesRows"][::std::mem::offset_of!(
		ExtractTextureFeaturesReport_struct,
		textureFeaturesRows
	) - 24usize];
	["Offset of field: ExtractTextureFeaturesReport_struct::textureFeaturesCols"][::std::mem::offset_of!(
		ExtractTextureFeaturesReport_struct,
		textureFeaturesCols
	) - 28usize];
};
pub type ExtractTextureFeaturesReport = ExtractTextureFeaturesReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WaveletBandsReport_struct {
	pub LLBand: *mut *mut f32,
	pub LHBand: *mut *mut f32,
	pub HLBand: *mut *mut f32,
	pub HHBand: *mut *mut f32,
	pub LLLBand: *mut *mut f32,
	pub LLHBand: *mut *mut f32,
	pub LHLBand: f32,
	pub LHHBand: *mut *mut f32,
	pub rows: ::std::os::raw::c_int,
	pub cols: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of WaveletBandsReport_struct"]
		[::std::mem::size_of::<WaveletBandsReport_struct>() - 72usize];
	["Alignment of WaveletBandsReport_struct"]
		[::std::mem::align_of::<WaveletBandsReport_struct>() - 8usize];
	["Offset of field: WaveletBandsReport_struct::LLBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LLBand) - 0usize];
	["Offset of field: WaveletBandsReport_struct::LHBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LHBand) - 8usize];
	["Offset of field: WaveletBandsReport_struct::HLBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, HLBand) - 16usize];
	["Offset of field: WaveletBandsReport_struct::HHBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, HHBand) - 24usize];
	["Offset of field: WaveletBandsReport_struct::LLLBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LLLBand) - 32usize];
	["Offset of field: WaveletBandsReport_struct::LLHBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LLHBand) - 40usize];
	["Offset of field: WaveletBandsReport_struct::LHLBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LHLBand) - 48usize];
	["Offset of field: WaveletBandsReport_struct::LHHBand"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, LHHBand) - 56usize];
	["Offset of field: WaveletBandsReport_struct::rows"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, rows) - 64usize];
	["Offset of field: WaveletBandsReport_struct::cols"]
		[::std::mem::offset_of!(WaveletBandsReport_struct, cols) - 68usize];
};
pub type WaveletBandsReport = WaveletBandsReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CircleFitOptions_struct {
	pub maxRadius: ::std::os::raw::c_int,
	pub stepSize: f64,
	pub processType: RakeProcessType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CircleFitOptions_struct"][::std::mem::size_of::<CircleFitOptions_struct>() - 24usize];
	["Alignment of CircleFitOptions_struct"]
		[::std::mem::align_of::<CircleFitOptions_struct>() - 8usize];
	["Offset of field: CircleFitOptions_struct::maxRadius"]
		[::std::mem::offset_of!(CircleFitOptions_struct, maxRadius) - 0usize];
	["Offset of field: CircleFitOptions_struct::stepSize"]
		[::std::mem::offset_of!(CircleFitOptions_struct, stepSize) - 8usize];
	["Offset of field: CircleFitOptions_struct::processType"]
		[::std::mem::offset_of!(CircleFitOptions_struct, processType) - 16usize];
};
pub type CircleFitOptions = CircleFitOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EdgeOptions2_struct {
	pub polarity: EdgePolaritySearchMode,
	pub kernelSize: ::std::os::raw::c_uint,
	pub width: ::std::os::raw::c_uint,
	pub minThreshold: f32,
	pub interpolationType: InterpolationMethod,
	pub columnProcessingMode: ColumnProcessingMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of EdgeOptions2_struct"][::std::mem::size_of::<EdgeOptions2_struct>() - 24usize];
	["Alignment of EdgeOptions2_struct"][::std::mem::align_of::<EdgeOptions2_struct>() - 4usize];
	["Offset of field: EdgeOptions2_struct::polarity"]
		[::std::mem::offset_of!(EdgeOptions2_struct, polarity) - 0usize];
	["Offset of field: EdgeOptions2_struct::kernelSize"]
		[::std::mem::offset_of!(EdgeOptions2_struct, kernelSize) - 4usize];
	["Offset of field: EdgeOptions2_struct::width"]
		[::std::mem::offset_of!(EdgeOptions2_struct, width) - 8usize];
	["Offset of field: EdgeOptions2_struct::minThreshold"]
		[::std::mem::offset_of!(EdgeOptions2_struct, minThreshold) - 12usize];
	["Offset of field: EdgeOptions2_struct::interpolationType"]
		[::std::mem::offset_of!(EdgeOptions2_struct, interpolationType) - 16usize];
	["Offset of field: EdgeOptions2_struct::columnProcessingMode"]
		[::std::mem::offset_of!(EdgeOptions2_struct, columnProcessingMode) - 20usize];
};
pub type EdgeOptions2 = EdgeOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindCircularEdgeOptions_struct {
	pub direction: SpokeDirection,
	pub showSearchArea: ::std::os::raw::c_int,
	pub showSearchLines: ::std::os::raw::c_int,
	pub showEdgesFound: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub searchLinesColor: RGBValue,
	pub searchEdgesColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
	pub edgeOptions: EdgeOptions2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindCircularEdgeOptions_struct"]
		[::std::mem::size_of::<FindCircularEdgeOptions_struct>() - 72usize];
	["Alignment of FindCircularEdgeOptions_struct"]
		[::std::mem::align_of::<FindCircularEdgeOptions_struct>() - 8usize];
	["Offset of field: FindCircularEdgeOptions_struct::direction"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, direction) - 0usize];
	["Offset of field: FindCircularEdgeOptions_struct::showSearchArea"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, showSearchArea) - 4usize];
	["Offset of field: FindCircularEdgeOptions_struct::showSearchLines"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, showSearchLines) - 8usize];
	["Offset of field: FindCircularEdgeOptions_struct::showEdgesFound"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, showEdgesFound) - 12usize];
	["Offset of field: FindCircularEdgeOptions_struct::showResult"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, showResult) - 16usize];
	["Offset of field: FindCircularEdgeOptions_struct::searchAreaColor"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, searchAreaColor) - 20usize];
	["Offset of field: FindCircularEdgeOptions_struct::searchLinesColor"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, searchLinesColor) - 24usize];
	["Offset of field: FindCircularEdgeOptions_struct::searchEdgesColor"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, searchEdgesColor) - 28usize];
	["Offset of field: FindCircularEdgeOptions_struct::resultColor"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, resultColor) - 32usize];
	["Offset of field: FindCircularEdgeOptions_struct::overlayGroupName"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, overlayGroupName) - 40usize];
	["Offset of field: FindCircularEdgeOptions_struct::edgeOptions"]
		[::std::mem::offset_of!(FindCircularEdgeOptions_struct, edgeOptions) - 48usize];
};
pub type FindCircularEdgeOptions = FindCircularEdgeOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindConcentricEdgeOptions_struct {
	pub direction: ConcentricRakeDirection,
	pub showSearchArea: ::std::os::raw::c_int,
	pub showSearchLines: ::std::os::raw::c_int,
	pub showEdgesFound: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub searchLinesColor: RGBValue,
	pub searchEdgesColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
	pub edgeOptions: EdgeOptions2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindConcentricEdgeOptions_struct"]
		[::std::mem::size_of::<FindConcentricEdgeOptions_struct>() - 72usize];
	["Alignment of FindConcentricEdgeOptions_struct"]
		[::std::mem::align_of::<FindConcentricEdgeOptions_struct>() - 8usize];
	["Offset of field: FindConcentricEdgeOptions_struct::direction"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, direction) - 0usize];
	["Offset of field: FindConcentricEdgeOptions_struct::showSearchArea"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, showSearchArea) - 4usize];
	["Offset of field: FindConcentricEdgeOptions_struct::showSearchLines"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, showSearchLines) - 8usize];
	["Offset of field: FindConcentricEdgeOptions_struct::showEdgesFound"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, showEdgesFound) - 12usize];
	["Offset of field: FindConcentricEdgeOptions_struct::showResult"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, showResult) - 16usize];
	["Offset of field: FindConcentricEdgeOptions_struct::searchAreaColor"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, searchAreaColor) - 20usize];
	["Offset of field: FindConcentricEdgeOptions_struct::searchLinesColor"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, searchLinesColor) - 24usize];
	["Offset of field: FindConcentricEdgeOptions_struct::searchEdgesColor"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, searchEdgesColor) - 28usize];
	["Offset of field: FindConcentricEdgeOptions_struct::resultColor"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, resultColor) - 32usize];
	["Offset of field: FindConcentricEdgeOptions_struct::overlayGroupName"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, overlayGroupName) - 40usize];
	["Offset of field: FindConcentricEdgeOptions_struct::edgeOptions"]
		[::std::mem::offset_of!(FindConcentricEdgeOptions_struct, edgeOptions) - 48usize];
};
pub type FindConcentricEdgeOptions = FindConcentricEdgeOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConcentricEdgeFitOptions_struct {
	pub maxRadius: ::std::os::raw::c_int,
	pub stepSize: f64,
	pub processType: RakeProcessType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ConcentricEdgeFitOptions_struct"]
		[::std::mem::size_of::<ConcentricEdgeFitOptions_struct>() - 24usize];
	["Alignment of ConcentricEdgeFitOptions_struct"]
		[::std::mem::align_of::<ConcentricEdgeFitOptions_struct>() - 8usize];
	["Offset of field: ConcentricEdgeFitOptions_struct::maxRadius"]
		[::std::mem::offset_of!(ConcentricEdgeFitOptions_struct, maxRadius) - 0usize];
	["Offset of field: ConcentricEdgeFitOptions_struct::stepSize"]
		[::std::mem::offset_of!(ConcentricEdgeFitOptions_struct, stepSize) - 8usize];
	["Offset of field: ConcentricEdgeFitOptions_struct::processType"]
		[::std::mem::offset_of!(ConcentricEdgeFitOptions_struct, processType) - 16usize];
};
pub type ConcentricEdgeFitOptions = ConcentricEdgeFitOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindConcentricEdgeReport_struct {
	pub startPt: PointFloat,
	pub endPt: PointFloat,
	pub startPtCalibrated: PointFloat,
	pub endPtCalibrated: PointFloat,
	pub angle: f64,
	pub angleCalibrated: f64,
	pub straightness: f64,
	pub avgStrength: f64,
	pub avgSNR: f64,
	pub lineFound: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindConcentricEdgeReport_struct"]
		[::std::mem::size_of::<FindConcentricEdgeReport_struct>() - 80usize];
	["Alignment of FindConcentricEdgeReport_struct"]
		[::std::mem::align_of::<FindConcentricEdgeReport_struct>() - 8usize];
	["Offset of field: FindConcentricEdgeReport_struct::startPt"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, startPt) - 0usize];
	["Offset of field: FindConcentricEdgeReport_struct::endPt"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, endPt) - 8usize];
	["Offset of field: FindConcentricEdgeReport_struct::startPtCalibrated"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, startPtCalibrated) - 16usize];
	["Offset of field: FindConcentricEdgeReport_struct::endPtCalibrated"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, endPtCalibrated) - 24usize];
	["Offset of field: FindConcentricEdgeReport_struct::angle"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, angle) - 32usize];
	["Offset of field: FindConcentricEdgeReport_struct::angleCalibrated"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, angleCalibrated) - 40usize];
	["Offset of field: FindConcentricEdgeReport_struct::straightness"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, straightness) - 48usize];
	["Offset of field: FindConcentricEdgeReport_struct::avgStrength"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, avgStrength) - 56usize];
	["Offset of field: FindConcentricEdgeReport_struct::avgSNR"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, avgSNR) - 64usize];
	["Offset of field: FindConcentricEdgeReport_struct::lineFound"]
		[::std::mem::offset_of!(FindConcentricEdgeReport_struct, lineFound) - 72usize];
};
pub type FindConcentricEdgeReport = FindConcentricEdgeReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindCircularEdgeReport_struct {
	pub centerCalibrated: PointFloat,
	pub radiusCalibrated: f64,
	pub center: PointFloat,
	pub radius: f64,
	pub roundness: f64,
	pub avgStrength: f64,
	pub avgSNR: f64,
	pub circleFound: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindCircularEdgeReport_struct"]
		[::std::mem::size_of::<FindCircularEdgeReport_struct>() - 64usize];
	["Alignment of FindCircularEdgeReport_struct"]
		[::std::mem::align_of::<FindCircularEdgeReport_struct>() - 8usize];
	["Offset of field: FindCircularEdgeReport_struct::centerCalibrated"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, centerCalibrated) - 0usize];
	["Offset of field: FindCircularEdgeReport_struct::radiusCalibrated"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, radiusCalibrated) - 8usize];
	["Offset of field: FindCircularEdgeReport_struct::center"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, center) - 16usize];
	["Offset of field: FindCircularEdgeReport_struct::radius"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, radius) - 24usize];
	["Offset of field: FindCircularEdgeReport_struct::roundness"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, roundness) - 32usize];
	["Offset of field: FindCircularEdgeReport_struct::avgStrength"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, avgStrength) - 40usize];
	["Offset of field: FindCircularEdgeReport_struct::avgSNR"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, avgSNR) - 48usize];
	["Offset of field: FindCircularEdgeReport_struct::circleFound"]
		[::std::mem::offset_of!(FindCircularEdgeReport_struct, circleFound) - 56usize];
};
pub type FindCircularEdgeReport = FindCircularEdgeReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WindowSize_struct {
	pub x: ::std::os::raw::c_int,
	pub y: ::std::os::raw::c_int,
	pub stepSize: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of WindowSize_struct"][::std::mem::size_of::<WindowSize_struct>() - 12usize];
	["Alignment of WindowSize_struct"][::std::mem::align_of::<WindowSize_struct>() - 4usize];
	["Offset of field: WindowSize_struct::x"]
		[::std::mem::offset_of!(WindowSize_struct, x) - 0usize];
	["Offset of field: WindowSize_struct::y"]
		[::std::mem::offset_of!(WindowSize_struct, y) - 4usize];
	["Offset of field: WindowSize_struct::stepSize"]
		[::std::mem::offset_of!(WindowSize_struct, stepSize) - 8usize];
};
pub type WindowSize = WindowSize_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DisplacementVector_struct {
	pub x: ::std::os::raw::c_int,
	pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of DisplacementVector_struct"]
		[::std::mem::size_of::<DisplacementVector_struct>() - 8usize];
	["Alignment of DisplacementVector_struct"]
		[::std::mem::align_of::<DisplacementVector_struct>() - 4usize];
	["Offset of field: DisplacementVector_struct::x"]
		[::std::mem::offset_of!(DisplacementVector_struct, x) - 0usize];
	["Offset of field: DisplacementVector_struct::y"]
		[::std::mem::offset_of!(DisplacementVector_struct, y) - 4usize];
};
pub type DisplacementVector = DisplacementVector_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WaveletOptions_struct {
	pub typeOfWavelet: WaveletType,
	pub minEnergy: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of WaveletOptions_struct"][::std::mem::size_of::<WaveletOptions_struct>() - 8usize];
	["Alignment of WaveletOptions_struct"]
		[::std::mem::align_of::<WaveletOptions_struct>() - 4usize];
	["Offset of field: WaveletOptions_struct::typeOfWavelet"]
		[::std::mem::offset_of!(WaveletOptions_struct, typeOfWavelet) - 0usize];
	["Offset of field: WaveletOptions_struct::minEnergy"]
		[::std::mem::offset_of!(WaveletOptions_struct, minEnergy) - 4usize];
};
pub type WaveletOptions = WaveletOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CooccurrenceOptions_struct {
	pub level: ::std::os::raw::c_int,
	pub displacement: DisplacementVector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CooccurrenceOptions_struct"]
		[::std::mem::size_of::<CooccurrenceOptions_struct>() - 12usize];
	["Alignment of CooccurrenceOptions_struct"]
		[::std::mem::align_of::<CooccurrenceOptions_struct>() - 4usize];
	["Offset of field: CooccurrenceOptions_struct::level"]
		[::std::mem::offset_of!(CooccurrenceOptions_struct, level) - 0usize];
	["Offset of field: CooccurrenceOptions_struct::displacement"]
		[::std::mem::offset_of!(CooccurrenceOptions_struct, displacement) - 4usize];
};
pub type CooccurrenceOptions = CooccurrenceOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParticleClassifierLocalThresholdOptions_struct {
	pub method: LocalThresholdMethod,
	pub particleType: ParticleType,
	pub windowWidth: ::std::os::raw::c_uint,
	pub windowHeight: ::std::os::raw::c_uint,
	pub deviationWeight: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ParticleClassifierLocalThresholdOptions_struct"]
		[::std::mem::size_of::<ParticleClassifierLocalThresholdOptions_struct>() - 24usize];
	["Alignment of ParticleClassifierLocalThresholdOptions_struct"]
		[::std::mem::align_of::<ParticleClassifierLocalThresholdOptions_struct>() - 8usize];
	["Offset of field: ParticleClassifierLocalThresholdOptions_struct::method"]
		[::std::mem::offset_of!(ParticleClassifierLocalThresholdOptions_struct, method) - 0usize];
	["Offset of field: ParticleClassifierLocalThresholdOptions_struct::particleType"][::std::mem::offset_of!(
		ParticleClassifierLocalThresholdOptions_struct,
		particleType
	) - 4usize];
	["Offset of field: ParticleClassifierLocalThresholdOptions_struct::windowWidth"][::std::mem::offset_of!(
		ParticleClassifierLocalThresholdOptions_struct,
		windowWidth
	) - 8usize];
	["Offset of field: ParticleClassifierLocalThresholdOptions_struct::windowHeight"][::std::mem::offset_of!(
		ParticleClassifierLocalThresholdOptions_struct,
		windowHeight
	) - 12usize];
	["Offset of field: ParticleClassifierLocalThresholdOptions_struct::deviationWeight"][::std::mem::offset_of!(
		ParticleClassifierLocalThresholdOptions_struct,
		deviationWeight
	)
		- 16usize];
};
pub type ParticleClassifierLocalThresholdOptions = ParticleClassifierLocalThresholdOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeFloat_struct {
	pub minValue: f32,
	pub maxValue: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RangeFloat_struct"][::std::mem::size_of::<RangeFloat_struct>() - 8usize];
	["Alignment of RangeFloat_struct"][::std::mem::align_of::<RangeFloat_struct>() - 4usize];
	["Offset of field: RangeFloat_struct::minValue"]
		[::std::mem::offset_of!(RangeFloat_struct, minValue) - 0usize];
	["Offset of field: RangeFloat_struct::maxValue"]
		[::std::mem::offset_of!(RangeFloat_struct, maxValue) - 4usize];
};
pub type RangeFloat = RangeFloat_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParticleClassifierAutoThresholdOptions_struct {
	pub method: ThresholdMethod,
	pub particleType: ParticleType,
	pub limits: RangeFloat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ParticleClassifierAutoThresholdOptions_struct"]
		[::std::mem::size_of::<ParticleClassifierAutoThresholdOptions_struct>() - 16usize];
	["Alignment of ParticleClassifierAutoThresholdOptions_struct"]
		[::std::mem::align_of::<ParticleClassifierAutoThresholdOptions_struct>() - 4usize];
	["Offset of field: ParticleClassifierAutoThresholdOptions_struct::method"]
		[::std::mem::offset_of!(ParticleClassifierAutoThresholdOptions_struct, method) - 0usize];
	["Offset of field: ParticleClassifierAutoThresholdOptions_struct::particleType"][::std::mem::offset_of!(
		ParticleClassifierAutoThresholdOptions_struct,
		particleType
	) - 4usize];
	["Offset of field: ParticleClassifierAutoThresholdOptions_struct::limits"]
		[::std::mem::offset_of!(ParticleClassifierAutoThresholdOptions_struct, limits) - 8usize];
};
pub type ParticleClassifierAutoThresholdOptions = ParticleClassifierAutoThresholdOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParticleClassifierPreprocessingOptions2_struct {
	pub thresholdType: ParticleClassifierThresholdType,
	pub manualThresholdRange: RangeFloat,
	pub autoThresholdOptions: ParticleClassifierAutoThresholdOptions,
	pub localThresholdOptions: ParticleClassifierLocalThresholdOptions,
	pub rejectBorder: ::std::os::raw::c_int,
	pub numErosions: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ParticleClassifierPreprocessingOptions2_struct"]
		[::std::mem::size_of::<ParticleClassifierPreprocessingOptions2_struct>() - 64usize];
	["Alignment of ParticleClassifierPreprocessingOptions2_struct"]
		[::std::mem::align_of::<ParticleClassifierPreprocessingOptions2_struct>() - 8usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::thresholdType"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		thresholdType
	) - 0usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::manualThresholdRange"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		manualThresholdRange
	)
		- 4usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::autoThresholdOptions"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		autoThresholdOptions
	)
		- 12usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::localThresholdOptions"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		localThresholdOptions
	)
		- 32usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::rejectBorder"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		rejectBorder
	) - 56usize];
	["Offset of field: ParticleClassifierPreprocessingOptions2_struct::numErosions"][::std::mem::offset_of!(
		ParticleClassifierPreprocessingOptions2_struct,
		numErosions
	) - 60usize];
};
pub type ParticleClassifierPreprocessingOptions2 = ParticleClassifierPreprocessingOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MeasureParticlesReport_struct {
	pub pixelMeasurements: *mut *mut f64,
	pub calibratedMeasurements: *mut *mut f64,
	pub numParticles: usize,
	pub numMeasurements: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MeasureParticlesReport_struct"]
		[::std::mem::size_of::<MeasureParticlesReport_struct>() - 32usize];
	["Alignment of MeasureParticlesReport_struct"]
		[::std::mem::align_of::<MeasureParticlesReport_struct>() - 8usize];
	["Offset of field: MeasureParticlesReport_struct::pixelMeasurements"]
		[::std::mem::offset_of!(MeasureParticlesReport_struct, pixelMeasurements) - 0usize];
	["Offset of field: MeasureParticlesReport_struct::calibratedMeasurements"]
		[::std::mem::offset_of!(MeasureParticlesReport_struct, calibratedMeasurements) - 8usize];
	["Offset of field: MeasureParticlesReport_struct::numParticles"]
		[::std::mem::offset_of!(MeasureParticlesReport_struct, numParticles) - 16usize];
	["Offset of field: MeasureParticlesReport_struct::numMeasurements"]
		[::std::mem::offset_of!(MeasureParticlesReport_struct, numMeasurements) - 24usize];
};
pub type MeasureParticlesReport = MeasureParticlesReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GeometricPatternMatch3_struct {
	pub position: PointFloat,
	pub rotation: f32,
	pub scale: f32,
	pub score: f32,
	pub corner: [PointFloat; 4usize],
	pub inverse: ::std::os::raw::c_int,
	pub occlusion: f32,
	pub templateMatchCurveScore: f32,
	pub matchTemplateCurveScore: f32,
	pub correlationScore: f32,
	pub calibratedPosition: PointFloat,
	pub calibratedRotation: f32,
	pub calibratedCorner: [PointFloat; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of GeometricPatternMatch3_struct"]
		[::std::mem::size_of::<GeometricPatternMatch3_struct>() - 116usize];
	["Alignment of GeometricPatternMatch3_struct"]
		[::std::mem::align_of::<GeometricPatternMatch3_struct>() - 4usize];
	["Offset of field: GeometricPatternMatch3_struct::position"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, position) - 0usize];
	["Offset of field: GeometricPatternMatch3_struct::rotation"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, rotation) - 8usize];
	["Offset of field: GeometricPatternMatch3_struct::scale"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, scale) - 12usize];
	["Offset of field: GeometricPatternMatch3_struct::score"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, score) - 16usize];
	["Offset of field: GeometricPatternMatch3_struct::corner"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, corner) - 20usize];
	["Offset of field: GeometricPatternMatch3_struct::inverse"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, inverse) - 52usize];
	["Offset of field: GeometricPatternMatch3_struct::occlusion"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, occlusion) - 56usize];
	["Offset of field: GeometricPatternMatch3_struct::templateMatchCurveScore"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, templateMatchCurveScore) - 60usize];
	["Offset of field: GeometricPatternMatch3_struct::matchTemplateCurveScore"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, matchTemplateCurveScore) - 64usize];
	["Offset of field: GeometricPatternMatch3_struct::correlationScore"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, correlationScore) - 68usize];
	["Offset of field: GeometricPatternMatch3_struct::calibratedPosition"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, calibratedPosition) - 72usize];
	["Offset of field: GeometricPatternMatch3_struct::calibratedRotation"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, calibratedRotation) - 80usize];
	["Offset of field: GeometricPatternMatch3_struct::calibratedCorner"]
		[::std::mem::offset_of!(GeometricPatternMatch3_struct, calibratedCorner) - 84usize];
};
pub type GeometricPatternMatch3 = GeometricPatternMatch3_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MatchGeometricPatternAdvancedOptions3_struct {
	pub subpixelIterations: ::std::os::raw::c_uint,
	pub subpixelTolerance: f64,
	pub initialMatchListLength: ::std::os::raw::c_uint,
	pub targetTemplateCurveScore: ::std::os::raw::c_int,
	pub correlationScore: ::std::os::raw::c_int,
	pub minMatchSeparationDistance: f64,
	pub minMatchSeparationAngle: f64,
	pub minMatchSeparationScale: f64,
	pub maxMatchOverlap: f64,
	pub coarseResult: ::std::os::raw::c_int,
	pub enableCalibrationSupport: ::std::os::raw::c_int,
	pub enableContrastReversal: ContrastMode,
	pub matchStrategy: GeometricMatchingSearchStrategy,
	pub refineMatchFactor: ::std::os::raw::c_uint,
	pub subpixelMatchFactor: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MatchGeometricPatternAdvancedOptions3_struct"]
		[::std::mem::size_of::<MatchGeometricPatternAdvancedOptions3_struct>() - 88usize];
	["Alignment of MatchGeometricPatternAdvancedOptions3_struct"]
		[::std::mem::align_of::<MatchGeometricPatternAdvancedOptions3_struct>() - 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::subpixelIterations"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		subpixelIterations
	)
		- 0usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::subpixelTolerance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		subpixelTolerance
	)
		- 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::initialMatchListLength"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		initialMatchListLength
	)
		- 16usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::targetTemplateCurveScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		targetTemplateCurveScore
	)
		- 20usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::correlationScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		correlationScore
	)
		- 24usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::minMatchSeparationDistance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		minMatchSeparationDistance
	)
		- 32usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::minMatchSeparationAngle"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		minMatchSeparationAngle
	)
		- 40usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::minMatchSeparationScale"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		minMatchSeparationScale
	)
		- 48usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::maxMatchOverlap"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		maxMatchOverlap
	) - 56usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::coarseResult"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		coarseResult
	) - 64usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::enableCalibrationSupport"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		enableCalibrationSupport
	)
		- 68usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::enableContrastReversal"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		enableContrastReversal
	)
		- 72usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::matchStrategy"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		matchStrategy
	) - 76usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::refineMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		refineMatchFactor
	)
		- 80usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions3_struct::subpixelMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions3_struct,
		subpixelMatchFactor
	)
		- 84usize];
};
pub type MatchGeometricPatternAdvancedOptions3 = MatchGeometricPatternAdvancedOptions3_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MatchGeometricPatternAdvancedOptions4_struct {
	pub subpixelIterations: ::std::os::raw::c_uint,
	pub subpixelTolerance: f64,
	pub initialMatchListLength: ::std::os::raw::c_uint,
	pub targetTemplateCurveScore: ::std::os::raw::c_int,
	pub correlationScore: ::std::os::raw::c_int,
	pub minMatchSeparationDistance: f64,
	pub minMatchSeparationAngle: f64,
	pub minMatchSeparationScale: f64,
	pub maxMatchOverlap: f64,
	pub coarseResult: ::std::os::raw::c_int,
	pub enableCalibrationSupport: ::std::os::raw::c_int,
	pub enableContrastReversal: ContrastMode,
	pub matchStrategy: GeometricMatchingSearchStrategy,
	pub refineMatchFactor: ::std::os::raw::c_uint,
	pub subpixelMatchFactor: ::std::os::raw::c_uint,
	pub contourMaxRefinements: ::std::os::raw::c_uint,
	pub scoringMethod: ::std::os::raw::c_uint,
	pub initialMatchAngularAccuracy: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MatchGeometricPatternAdvancedOptions4_struct"]
		[::std::mem::size_of::<MatchGeometricPatternAdvancedOptions4_struct>() - 104usize];
	["Alignment of MatchGeometricPatternAdvancedOptions4_struct"]
		[::std::mem::align_of::<MatchGeometricPatternAdvancedOptions4_struct>() - 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::subpixelIterations"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		subpixelIterations
	)
		- 0usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::subpixelTolerance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		subpixelTolerance
	)
		- 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::initialMatchListLength"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		initialMatchListLength
	)
		- 16usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::targetTemplateCurveScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		targetTemplateCurveScore
	)
		- 20usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::correlationScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		correlationScore
	)
		- 24usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::minMatchSeparationDistance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		minMatchSeparationDistance
	)
		- 32usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::minMatchSeparationAngle"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		minMatchSeparationAngle
	)
		- 40usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::minMatchSeparationScale"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		minMatchSeparationScale
	)
		- 48usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::maxMatchOverlap"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		maxMatchOverlap
	) - 56usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::coarseResult"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		coarseResult
	) - 64usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::enableCalibrationSupport"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		enableCalibrationSupport
	)
		- 68usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::enableContrastReversal"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		enableContrastReversal
	)
		- 72usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::matchStrategy"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		matchStrategy
	) - 76usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::refineMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		refineMatchFactor
	)
		- 80usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::subpixelMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		subpixelMatchFactor
	)
		- 84usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::contourMaxRefinements"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		contourMaxRefinements
	)
		- 88usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::scoringMethod"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions4_struct,
		scoringMethod
	) - 92usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions4_struct::initialMatchAngularAccuracy"]
		[::std::mem::offset_of!(
			MatchGeometricPatternAdvancedOptions4_struct,
			initialMatchAngularAccuracy
		) - 96usize];
};
pub type MatchGeometricPatternAdvancedOptions4 = MatchGeometricPatternAdvancedOptions4_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MatchGeometricPatternAdvancedOptions5_struct {
	pub subpixelIterations: ::std::os::raw::c_uint,
	pub subpixelTolerance: f64,
	pub initialMatchListLength: ::std::os::raw::c_uint,
	pub targetTemplateCurveScore: ::std::os::raw::c_int,
	pub correlationScore: ::std::os::raw::c_int,
	pub minMatchSeparationDistance: f64,
	pub minMatchSeparationAngle: f64,
	pub minMatchSeparationScale: f64,
	pub maxMatchOverlap: f64,
	pub coarseResult: ::std::os::raw::c_int,
	pub enableCalibrationSupport: ::std::os::raw::c_int,
	pub enableContrastReversal: ContrastMode,
	pub matchStrategy: GeometricMatchingSearchStrategy,
	pub refineMatchFactor: ::std::os::raw::c_uint,
	pub subpixelMatchFactor: ::std::os::raw::c_uint,
	pub contourMaxRefinements: ::std::os::raw::c_uint,
	pub scoringMethod: ::std::os::raw::c_uint,
	pub initialMatchAngularAccuracy: ::std::os::raw::c_uint,
	pub enableDefectMap: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of MatchGeometricPatternAdvancedOptions5_struct"]
		[::std::mem::size_of::<MatchGeometricPatternAdvancedOptions5_struct>() - 104usize];
	["Alignment of MatchGeometricPatternAdvancedOptions5_struct"]
		[::std::mem::align_of::<MatchGeometricPatternAdvancedOptions5_struct>() - 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::subpixelIterations"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		subpixelIterations
	)
		- 0usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::subpixelTolerance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		subpixelTolerance
	)
		- 8usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::initialMatchListLength"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		initialMatchListLength
	)
		- 16usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::targetTemplateCurveScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		targetTemplateCurveScore
	)
		- 20usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::correlationScore"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		correlationScore
	)
		- 24usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::minMatchSeparationDistance"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		minMatchSeparationDistance
	)
		- 32usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::minMatchSeparationAngle"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		minMatchSeparationAngle
	)
		- 40usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::minMatchSeparationScale"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		minMatchSeparationScale
	)
		- 48usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::maxMatchOverlap"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		maxMatchOverlap
	) - 56usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::coarseResult"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		coarseResult
	) - 64usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::enableCalibrationSupport"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		enableCalibrationSupport
	)
		- 68usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::enableContrastReversal"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		enableContrastReversal
	)
		- 72usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::matchStrategy"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		matchStrategy
	) - 76usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::refineMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		refineMatchFactor
	)
		- 80usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::subpixelMatchFactor"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		subpixelMatchFactor
	)
		- 84usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::contourMaxRefinements"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		contourMaxRefinements
	)
		- 88usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::scoringMethod"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		scoringMethod
	) - 92usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::initialMatchAngularAccuracy"]
		[::std::mem::offset_of!(
			MatchGeometricPatternAdvancedOptions5_struct,
			initialMatchAngularAccuracy
		) - 96usize];
	["Offset of field: MatchGeometricPatternAdvancedOptions5_struct::enableDefectMap"][::std::mem::offset_of!(
		MatchGeometricPatternAdvancedOptions5_struct,
		enableDefectMap
	)
		- 100usize];
};
pub type MatchGeometricPatternAdvancedOptions5 = MatchGeometricPatternAdvancedOptions5_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColorOptions_struct {
	pub colorClassificationResolution: ColorClassificationResolution,
	pub useLuminance: ::std::os::raw::c_uint,
	pub colorMode: ColorMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ColorOptions_struct"][::std::mem::size_of::<ColorOptions_struct>() - 12usize];
	["Alignment of ColorOptions_struct"][::std::mem::align_of::<ColorOptions_struct>() - 4usize];
	["Offset of field: ColorOptions_struct::colorClassificationResolution"]
		[::std::mem::offset_of!(ColorOptions_struct, colorClassificationResolution) - 0usize];
	["Offset of field: ColorOptions_struct::useLuminance"]
		[::std::mem::offset_of!(ColorOptions_struct, useLuminance) - 4usize];
	["Offset of field: ColorOptions_struct::colorMode"]
		[::std::mem::offset_of!(ColorOptions_struct, colorMode) - 8usize];
};
pub type ColorOptions = ColorOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SampleScore_struct {
	pub className: *mut ::std::os::raw::c_char,
	pub distance: f32,
	pub index: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SampleScore_struct"][::std::mem::size_of::<SampleScore_struct>() - 16usize];
	["Alignment of SampleScore_struct"][::std::mem::align_of::<SampleScore_struct>() - 8usize];
	["Offset of field: SampleScore_struct::className"]
		[::std::mem::offset_of!(SampleScore_struct, className) - 0usize];
	["Offset of field: SampleScore_struct::distance"]
		[::std::mem::offset_of!(SampleScore_struct, distance) - 8usize];
	["Offset of field: SampleScore_struct::index"]
		[::std::mem::offset_of!(SampleScore_struct, index) - 12usize];
};
pub type SampleScore = SampleScore_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassScore_struct {
	pub className: *mut ::std::os::raw::c_char,
	pub distance: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClassScore_struct"][::std::mem::size_of::<ClassScore_struct>() - 16usize];
	["Alignment of ClassScore_struct"][::std::mem::align_of::<ClassScore_struct>() - 8usize];
	["Offset of field: ClassScore_struct::className"]
		[::std::mem::offset_of!(ClassScore_struct, className) - 0usize];
	["Offset of field: ClassScore_struct::distance"]
		[::std::mem::offset_of!(ClassScore_struct, distance) - 8usize];
};
pub type ClassScore = ClassScore_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassifierReportAdvanced_struct {
	pub bestClassName: *mut ::std::os::raw::c_char,
	pub classificationScore: f32,
	pub identificationScore: f32,
	pub allScores: *mut ClassScore,
	pub allScoresSize: ::std::os::raw::c_int,
	pub sampleScores: *mut SampleScore,
	pub sampleScoresSize: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ClassifierReportAdvanced_struct"]
		[::std::mem::size_of::<ClassifierReportAdvanced_struct>() - 48usize];
	["Alignment of ClassifierReportAdvanced_struct"]
		[::std::mem::align_of::<ClassifierReportAdvanced_struct>() - 8usize];
	["Offset of field: ClassifierReportAdvanced_struct::bestClassName"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, bestClassName) - 0usize];
	["Offset of field: ClassifierReportAdvanced_struct::classificationScore"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, classificationScore) - 8usize];
	["Offset of field: ClassifierReportAdvanced_struct::identificationScore"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, identificationScore) - 12usize];
	["Offset of field: ClassifierReportAdvanced_struct::allScores"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, allScores) - 16usize];
	["Offset of field: ClassifierReportAdvanced_struct::allScoresSize"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, allScoresSize) - 24usize];
	["Offset of field: ClassifierReportAdvanced_struct::sampleScores"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, sampleScores) - 32usize];
	["Offset of field: ClassifierReportAdvanced_struct::sampleScoresSize"]
		[::std::mem::offset_of!(ClassifierReportAdvanced_struct, sampleScoresSize) - 40usize];
};
pub type ClassifierReportAdvanced = ClassifierReportAdvanced_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LearnGeometricPatternAdvancedOptions2_struct {
	pub minScaleFactor: f64,
	pub maxScaleFactor: f64,
	pub minRotationAngleValue: f64,
	pub maxRotationAngleValue: f64,
	pub imageSamplingFactor: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of LearnGeometricPatternAdvancedOptions2_struct"]
		[::std::mem::size_of::<LearnGeometricPatternAdvancedOptions2_struct>() - 40usize];
	["Alignment of LearnGeometricPatternAdvancedOptions2_struct"]
		[::std::mem::align_of::<LearnGeometricPatternAdvancedOptions2_struct>() - 8usize];
	["Offset of field: LearnGeometricPatternAdvancedOptions2_struct::minScaleFactor"][::std::mem::offset_of!(
		LearnGeometricPatternAdvancedOptions2_struct,
		minScaleFactor
	) - 0usize];
	["Offset of field: LearnGeometricPatternAdvancedOptions2_struct::maxScaleFactor"][::std::mem::offset_of!(
		LearnGeometricPatternAdvancedOptions2_struct,
		maxScaleFactor
	) - 8usize];
	["Offset of field: LearnGeometricPatternAdvancedOptions2_struct::minRotationAngleValue"][::std::mem::offset_of!(
		LearnGeometricPatternAdvancedOptions2_struct,
		minRotationAngleValue
	)
		- 16usize];
	["Offset of field: LearnGeometricPatternAdvancedOptions2_struct::maxRotationAngleValue"][::std::mem::offset_of!(
		LearnGeometricPatternAdvancedOptions2_struct,
		maxRotationAngleValue
	)
		- 24usize];
	["Offset of field: LearnGeometricPatternAdvancedOptions2_struct::imageSamplingFactor"][::std::mem::offset_of!(
		LearnGeometricPatternAdvancedOptions2_struct,
		imageSamplingFactor
	)
		- 32usize];
};
pub type LearnGeometricPatternAdvancedOptions2 = LearnGeometricPatternAdvancedOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParticleFilterOptions2_struct {
	pub rejectMatches: ::std::os::raw::c_int,
	pub rejectBorder: ::std::os::raw::c_int,
	pub fillHoles: ::std::os::raw::c_int,
	pub connectivity8: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ParticleFilterOptions2_struct"]
		[::std::mem::size_of::<ParticleFilterOptions2_struct>() - 16usize];
	["Alignment of ParticleFilterOptions2_struct"]
		[::std::mem::align_of::<ParticleFilterOptions2_struct>() - 4usize];
	["Offset of field: ParticleFilterOptions2_struct::rejectMatches"]
		[::std::mem::offset_of!(ParticleFilterOptions2_struct, rejectMatches) - 0usize];
	["Offset of field: ParticleFilterOptions2_struct::rejectBorder"]
		[::std::mem::offset_of!(ParticleFilterOptions2_struct, rejectBorder) - 4usize];
	["Offset of field: ParticleFilterOptions2_struct::fillHoles"]
		[::std::mem::offset_of!(ParticleFilterOptions2_struct, fillHoles) - 8usize];
	["Offset of field: ParticleFilterOptions2_struct::connectivity8"]
		[::std::mem::offset_of!(ParticleFilterOptions2_struct, connectivity8) - 12usize];
};
pub type ParticleFilterOptions2 = ParticleFilterOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindEdgeOptions2_struct {
	pub direction: RakeDirection,
	pub showSearchArea: ::std::os::raw::c_int,
	pub showSearchLines: ::std::os::raw::c_int,
	pub showEdgesFound: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub searchLinesColor: RGBValue,
	pub searchEdgesColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
	pub edgeOptions: EdgeOptions2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindEdgeOptions2_struct"][::std::mem::size_of::<FindEdgeOptions2_struct>() - 72usize];
	["Alignment of FindEdgeOptions2_struct"]
		[::std::mem::align_of::<FindEdgeOptions2_struct>() - 8usize];
	["Offset of field: FindEdgeOptions2_struct::direction"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, direction) - 0usize];
	["Offset of field: FindEdgeOptions2_struct::showSearchArea"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, showSearchArea) - 4usize];
	["Offset of field: FindEdgeOptions2_struct::showSearchLines"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, showSearchLines) - 8usize];
	["Offset of field: FindEdgeOptions2_struct::showEdgesFound"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, showEdgesFound) - 12usize];
	["Offset of field: FindEdgeOptions2_struct::showResult"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, showResult) - 16usize];
	["Offset of field: FindEdgeOptions2_struct::searchAreaColor"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, searchAreaColor) - 20usize];
	["Offset of field: FindEdgeOptions2_struct::searchLinesColor"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, searchLinesColor) - 24usize];
	["Offset of field: FindEdgeOptions2_struct::searchEdgesColor"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, searchEdgesColor) - 28usize];
	["Offset of field: FindEdgeOptions2_struct::resultColor"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, resultColor) - 32usize];
	["Offset of field: FindEdgeOptions2_struct::overlayGroupName"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, overlayGroupName) - 40usize];
	["Offset of field: FindEdgeOptions2_struct::edgeOptions"]
		[::std::mem::offset_of!(FindEdgeOptions2_struct, edgeOptions) - 48usize];
};
pub type FindEdgeOptions2 = FindEdgeOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EdgeInfo_struct {
	pub position: PointFloat,
	pub calibratedPosition: PointFloat,
	pub distance: f64,
	pub calibratedDistance: f64,
	pub magnitude: f64,
	pub noisePeak: f64,
	pub rising: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of EdgeInfo_struct"][::std::mem::size_of::<EdgeInfo_struct>() - 56usize];
	["Alignment of EdgeInfo_struct"][::std::mem::align_of::<EdgeInfo_struct>() - 8usize];
	["Offset of field: EdgeInfo_struct::position"]
		[::std::mem::offset_of!(EdgeInfo_struct, position) - 0usize];
	["Offset of field: EdgeInfo_struct::calibratedPosition"]
		[::std::mem::offset_of!(EdgeInfo_struct, calibratedPosition) - 8usize];
	["Offset of field: EdgeInfo_struct::distance"]
		[::std::mem::offset_of!(EdgeInfo_struct, distance) - 16usize];
	["Offset of field: EdgeInfo_struct::calibratedDistance"]
		[::std::mem::offset_of!(EdgeInfo_struct, calibratedDistance) - 24usize];
	["Offset of field: EdgeInfo_struct::magnitude"]
		[::std::mem::offset_of!(EdgeInfo_struct, magnitude) - 32usize];
	["Offset of field: EdgeInfo_struct::noisePeak"]
		[::std::mem::offset_of!(EdgeInfo_struct, noisePeak) - 40usize];
	["Offset of field: EdgeInfo_struct::rising"]
		[::std::mem::offset_of!(EdgeInfo_struct, rising) - 48usize];
};
pub type EdgeInfo = EdgeInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StraightEdge_struct {
	pub straightEdgeCoordinates: LineFloat,
	pub calibratedStraightEdgeCoordinates: LineFloat,
	pub angle: f64,
	pub calibratedAngle: f64,
	pub score: f64,
	pub straightness: f64,
	pub averageSignalToNoiseRatio: f64,
	pub calibrationValid: ::std::os::raw::c_int,
	pub usedEdges: *mut EdgeInfo,
	pub numUsedEdges: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StraightEdge_struct"][::std::mem::size_of::<StraightEdge_struct>() - 96usize];
	["Alignment of StraightEdge_struct"][::std::mem::align_of::<StraightEdge_struct>() - 8usize];
	["Offset of field: StraightEdge_struct::straightEdgeCoordinates"]
		[::std::mem::offset_of!(StraightEdge_struct, straightEdgeCoordinates) - 0usize];
	["Offset of field: StraightEdge_struct::calibratedStraightEdgeCoordinates"]
		[::std::mem::offset_of!(StraightEdge_struct, calibratedStraightEdgeCoordinates) - 16usize];
	["Offset of field: StraightEdge_struct::angle"]
		[::std::mem::offset_of!(StraightEdge_struct, angle) - 32usize];
	["Offset of field: StraightEdge_struct::calibratedAngle"]
		[::std::mem::offset_of!(StraightEdge_struct, calibratedAngle) - 40usize];
	["Offset of field: StraightEdge_struct::score"]
		[::std::mem::offset_of!(StraightEdge_struct, score) - 48usize];
	["Offset of field: StraightEdge_struct::straightness"]
		[::std::mem::offset_of!(StraightEdge_struct, straightness) - 56usize];
	["Offset of field: StraightEdge_struct::averageSignalToNoiseRatio"]
		[::std::mem::offset_of!(StraightEdge_struct, averageSignalToNoiseRatio) - 64usize];
	["Offset of field: StraightEdge_struct::calibrationValid"]
		[::std::mem::offset_of!(StraightEdge_struct, calibrationValid) - 72usize];
	["Offset of field: StraightEdge_struct::usedEdges"]
		[::std::mem::offset_of!(StraightEdge_struct, usedEdges) - 80usize];
	["Offset of field: StraightEdge_struct::numUsedEdges"]
		[::std::mem::offset_of!(StraightEdge_struct, numUsedEdges) - 88usize];
};
pub type StraightEdge = StraightEdge_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindEdgeReport_struct {
	pub straightEdges: *mut StraightEdge,
	pub numStraightEdges: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindEdgeReport_struct"][::std::mem::size_of::<FindEdgeReport_struct>() - 16usize];
	["Alignment of FindEdgeReport_struct"]
		[::std::mem::align_of::<FindEdgeReport_struct>() - 8usize];
	["Offset of field: FindEdgeReport_struct::straightEdges"]
		[::std::mem::offset_of!(FindEdgeReport_struct, straightEdges) - 0usize];
	["Offset of field: FindEdgeReport_struct::numStraightEdges"]
		[::std::mem::offset_of!(FindEdgeReport_struct, numStraightEdges) - 8usize];
};
pub type FindEdgeReport = FindEdgeReport_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindTransformRectOptions2_struct {
	pub direction: FindReferenceDirection,
	pub showSearchArea: ::std::os::raw::c_int,
	pub showSearchLines: ::std::os::raw::c_int,
	pub showEdgesFound: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub searchLinesColor: RGBValue,
	pub searchEdgesColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
	pub edgeOptions: EdgeOptions2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindTransformRectOptions2_struct"]
		[::std::mem::size_of::<FindTransformRectOptions2_struct>() - 72usize];
	["Alignment of FindTransformRectOptions2_struct"]
		[::std::mem::align_of::<FindTransformRectOptions2_struct>() - 8usize];
	["Offset of field: FindTransformRectOptions2_struct::direction"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, direction) - 0usize];
	["Offset of field: FindTransformRectOptions2_struct::showSearchArea"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, showSearchArea) - 4usize];
	["Offset of field: FindTransformRectOptions2_struct::showSearchLines"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, showSearchLines) - 8usize];
	["Offset of field: FindTransformRectOptions2_struct::showEdgesFound"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, showEdgesFound) - 12usize];
	["Offset of field: FindTransformRectOptions2_struct::showResult"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, showResult) - 16usize];
	["Offset of field: FindTransformRectOptions2_struct::searchAreaColor"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, searchAreaColor) - 20usize];
	["Offset of field: FindTransformRectOptions2_struct::searchLinesColor"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, searchLinesColor) - 24usize];
	["Offset of field: FindTransformRectOptions2_struct::searchEdgesColor"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, searchEdgesColor) - 28usize];
	["Offset of field: FindTransformRectOptions2_struct::resultColor"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, resultColor) - 32usize];
	["Offset of field: FindTransformRectOptions2_struct::overlayGroupName"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, overlayGroupName) - 40usize];
	["Offset of field: FindTransformRectOptions2_struct::edgeOptions"]
		[::std::mem::offset_of!(FindTransformRectOptions2_struct, edgeOptions) - 48usize];
};
pub type FindTransformRectOptions2 = FindTransformRectOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FindTransformRectsOptions2_struct {
	pub direction: FindReferenceDirection,
	pub showSearchArea: ::std::os::raw::c_int,
	pub showSearchLines: ::std::os::raw::c_int,
	pub showEdgesFound: ::std::os::raw::c_int,
	pub showResult: ::std::os::raw::c_int,
	pub searchAreaColor: RGBValue,
	pub searchLinesColor: RGBValue,
	pub searchEdgesColor: RGBValue,
	pub resultColor: RGBValue,
	pub overlayGroupName: *mut ::std::os::raw::c_char,
	pub primaryEdgeOptions: EdgeOptions2,
	pub secondaryEdgeOptions: EdgeOptions2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of FindTransformRectsOptions2_struct"]
		[::std::mem::size_of::<FindTransformRectsOptions2_struct>() - 96usize];
	["Alignment of FindTransformRectsOptions2_struct"]
		[::std::mem::align_of::<FindTransformRectsOptions2_struct>() - 8usize];
	["Offset of field: FindTransformRectsOptions2_struct::direction"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, direction) - 0usize];
	["Offset of field: FindTransformRectsOptions2_struct::showSearchArea"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, showSearchArea) - 4usize];
	["Offset of field: FindTransformRectsOptions2_struct::showSearchLines"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, showSearchLines) - 8usize];
	["Offset of field: FindTransformRectsOptions2_struct::showEdgesFound"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, showEdgesFound) - 12usize];
	["Offset of field: FindTransformRectsOptions2_struct::showResult"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, showResult) - 16usize];
	["Offset of field: FindTransformRectsOptions2_struct::searchAreaColor"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, searchAreaColor) - 20usize];
	["Offset of field: FindTransformRectsOptions2_struct::searchLinesColor"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, searchLinesColor) - 24usize];
	["Offset of field: FindTransformRectsOptions2_struct::searchEdgesColor"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, searchEdgesColor) - 28usize];
	["Offset of field: FindTransformRectsOptions2_struct::resultColor"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, resultColor) - 32usize];
	["Offset of field: FindTransformRectsOptions2_struct::overlayGroupName"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, overlayGroupName) - 40usize];
	["Offset of field: FindTransformRectsOptions2_struct::primaryEdgeOptions"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, primaryEdgeOptions) - 48usize];
	["Offset of field: FindTransformRectsOptions2_struct::secondaryEdgeOptions"]
		[::std::mem::offset_of!(FindTransformRectsOptions2_struct, secondaryEdgeOptions) - 72usize];
};
pub type FindTransformRectsOptions2 = FindTransformRectsOptions2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReadTextReport3_struct {
	pub readString: *const ::std::os::raw::c_char,
	pub characterReport: *mut CharReport3,
	pub numCharacterReports: ::std::os::raw::c_int,
	pub roiBoundingCharacters: *mut ROI,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ReadTextReport3_struct"][::std::mem::size_of::<ReadTextReport3_struct>() - 32usize];
	["Alignment of ReadTextReport3_struct"]
		[::std::mem::align_of::<ReadTextReport3_struct>() - 8usize];
	["Offset of field: ReadTextReport3_struct::readString"]
		[::std::mem::offset_of!(ReadTextReport3_struct, readString) - 0usize];
	["Offset of field: ReadTextReport3_struct::characterReport"]
		[::std::mem::offset_of!(ReadTextReport3_struct, characterReport) - 8usize];
	["Offset of field: ReadTextReport3_struct::numCharacterReports"]
		[::std::mem::offset_of!(ReadTextReport3_struct, numCharacterReports) - 16usize];
	["Offset of field: ReadTextReport3_struct::roiBoundingCharacters"]
		[::std::mem::offset_of!(ReadTextReport3_struct, roiBoundingCharacters) - 24usize];
};
pub type ReadTextReport3 = ReadTextReport3_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArcInfo2_struct {
	pub center: PointFloat,
	pub radius: f64,
	pub startAngle: f64,
	pub endAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ArcInfo2_struct"][::std::mem::size_of::<ArcInfo2_struct>() - 32usize];
	["Alignment of ArcInfo2_struct"][::std::mem::align_of::<ArcInfo2_struct>() - 8usize];
	["Offset of field: ArcInfo2_struct::center"]
		[::std::mem::offset_of!(ArcInfo2_struct, center) - 0usize];
	["Offset of field: ArcInfo2_struct::radius"]
		[::std::mem::offset_of!(ArcInfo2_struct, radius) - 8usize];
	["Offset of field: ArcInfo2_struct::startAngle"]
		[::std::mem::offset_of!(ArcInfo2_struct, startAngle) - 16usize];
	["Offset of field: ArcInfo2_struct::endAngle"]
		[::std::mem::offset_of!(ArcInfo2_struct, endAngle) - 24usize];
};
pub type ArcInfo2 = ArcInfo2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EdgeReport2_struct {
	pub edges: *mut EdgeInfo,
	pub numEdges: ::std::os::raw::c_uint,
	pub gradientInfo: *mut f64,
	pub numGradientInfo: ::std::os::raw::c_uint,
	pub calibrationValid: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of EdgeReport2_struct"][::std::mem::size_of::<EdgeReport2_struct>() - 32usize];
	["Alignment of EdgeReport2_struct"][::std::mem::align_of::<EdgeReport2_struct>() - 8usize];
	["Offset of field: EdgeReport2_struct::edges"]
		[::std::mem::offset_of!(EdgeReport2_struct, edges) - 0usize];
	["Offset of field: EdgeReport2_struct::numEdges"]
		[::std::mem::offset_of!(EdgeReport2_struct, numEdges) - 8usize];
	["Offset of field: EdgeReport2_struct::gradientInfo"]
		[::std::mem::offset_of!(EdgeReport2_struct, gradientInfo) - 16usize];
	["Offset of field: EdgeReport2_struct::numGradientInfo"]
		[::std::mem::offset_of!(EdgeReport2_struct, numGradientInfo) - 24usize];
	["Offset of field: EdgeReport2_struct::calibrationValid"]
		[::std::mem::offset_of!(EdgeReport2_struct, calibrationValid) - 28usize];
};
pub type EdgeReport2 = EdgeReport2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SearchArcInfo_struct {
	pub arcCoordinates: ArcInfo2,
	pub edgeReport: EdgeReport2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SearchArcInfo_struct"][::std::mem::size_of::<SearchArcInfo_struct>() - 64usize];
	["Alignment of SearchArcInfo_struct"][::std::mem::align_of::<SearchArcInfo_struct>() - 8usize];
	["Offset of field: SearchArcInfo_struct::arcCoordinates"]
		[::std::mem::offset_of!(SearchArcInfo_struct, arcCoordinates) - 0usize];
	["Offset of field: SearchArcInfo_struct::edgeReport"]
		[::std::mem::offset_of!(SearchArcInfo_struct, edgeReport) - 32usize];
};
pub type SearchArcInfo = SearchArcInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConcentricRakeReport2_struct {
	pub firstEdges: *mut EdgeInfo,
	pub numFirstEdges: ::std::os::raw::c_uint,
	pub lastEdges: *mut EdgeInfo,
	pub numLastEdges: ::std::os::raw::c_uint,
	pub searchArcs: *mut SearchArcInfo,
	pub numSearchArcs: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ConcentricRakeReport2_struct"]
		[::std::mem::size_of::<ConcentricRakeReport2_struct>() - 48usize];
	["Alignment of ConcentricRakeReport2_struct"]
		[::std::mem::align_of::<ConcentricRakeReport2_struct>() - 8usize];
	["Offset of field: ConcentricRakeReport2_struct::firstEdges"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, firstEdges) - 0usize];
	["Offset of field: ConcentricRakeReport2_struct::numFirstEdges"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, numFirstEdges) - 8usize];
	["Offset of field: ConcentricRakeReport2_struct::lastEdges"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, lastEdges) - 16usize];
	["Offset of field: ConcentricRakeReport2_struct::numLastEdges"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, numLastEdges) - 24usize];
	["Offset of field: ConcentricRakeReport2_struct::searchArcs"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, searchArcs) - 32usize];
	["Offset of field: ConcentricRakeReport2_struct::numSearchArcs"]
		[::std::mem::offset_of!(ConcentricRakeReport2_struct, numSearchArcs) - 40usize];
};
pub type ConcentricRakeReport2 = ConcentricRakeReport2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SearchLineInfo_struct {
	pub lineCoordinates: LineFloat,
	pub edgeReport: EdgeReport2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SearchLineInfo_struct"][::std::mem::size_of::<SearchLineInfo_struct>() - 48usize];
	["Alignment of SearchLineInfo_struct"]
		[::std::mem::align_of::<SearchLineInfo_struct>() - 8usize];
	["Offset of field: SearchLineInfo_struct::lineCoordinates"]
		[::std::mem::offset_of!(SearchLineInfo_struct, lineCoordinates) - 0usize];
	["Offset of field: SearchLineInfo_struct::edgeReport"]
		[::std::mem::offset_of!(SearchLineInfo_struct, edgeReport) - 16usize];
};
pub type SearchLineInfo = SearchLineInfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SpokeReport2_struct {
	pub firstEdges: *mut EdgeInfo,
	pub numFirstEdges: ::std::os::raw::c_uint,
	pub lastEdges: *mut EdgeInfo,
	pub numLastEdges: ::std::os::raw::c_uint,
	pub searchLines: *mut SearchLineInfo,
	pub numSearchLines: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of SpokeReport2_struct"][::std::mem::size_of::<SpokeReport2_struct>() - 48usize];
	["Alignment of SpokeReport2_struct"][::std::mem::align_of::<SpokeReport2_struct>() - 8usize];
	["Offset of field: SpokeReport2_struct::firstEdges"]
		[::std::mem::offset_of!(SpokeReport2_struct, firstEdges) - 0usize];
	["Offset of field: SpokeReport2_struct::numFirstEdges"]
		[::std::mem::offset_of!(SpokeReport2_struct, numFirstEdges) - 8usize];
	["Offset of field: SpokeReport2_struct::lastEdges"]
		[::std::mem::offset_of!(SpokeReport2_struct, lastEdges) - 16usize];
	["Offset of field: SpokeReport2_struct::numLastEdges"]
		[::std::mem::offset_of!(SpokeReport2_struct, numLastEdges) - 24usize];
	["Offset of field: SpokeReport2_struct::searchLines"]
		[::std::mem::offset_of!(SpokeReport2_struct, searchLines) - 32usize];
	["Offset of field: SpokeReport2_struct::numSearchLines"]
		[::std::mem::offset_of!(SpokeReport2_struct, numSearchLines) - 40usize];
};
pub type SpokeReport2 = SpokeReport2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RakeReport2_struct {
	pub firstEdges: *mut EdgeInfo,
	pub numFirstEdges: ::std::os::raw::c_uint,
	pub lastEdges: *mut EdgeInfo,
	pub numLastEdges: ::std::os::raw::c_uint,
	pub searchLines: *mut SearchLineInfo,
	pub numSearchLines: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of RakeReport2_struct"][::std::mem::size_of::<RakeReport2_struct>() - 48usize];
	["Alignment of RakeReport2_struct"][::std::mem::align_of::<RakeReport2_struct>() - 8usize];
	["Offset of field: RakeReport2_struct::firstEdges"]
		[::std::mem::offset_of!(RakeReport2_struct, firstEdges) - 0usize];
	["Offset of field: RakeReport2_struct::numFirstEdges"]
		[::std::mem::offset_of!(RakeReport2_struct, numFirstEdges) - 8usize];
	["Offset of field: RakeReport2_struct::lastEdges"]
		[::std::mem::offset_of!(RakeReport2_struct, lastEdges) - 16usize];
	["Offset of field: RakeReport2_struct::numLastEdges"]
		[::std::mem::offset_of!(RakeReport2_struct, numLastEdges) - 24usize];
	["Offset of field: RakeReport2_struct::searchLines"]
		[::std::mem::offset_of!(RakeReport2_struct, searchLines) - 32usize];
	["Offset of field: RakeReport2_struct::numSearchLines"]
		[::std::mem::offset_of!(RakeReport2_struct, numSearchLines) - 40usize];
};
pub type RakeReport2 = RakeReport2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TransformBehaviors_struct {
	pub ShiftBehavior: GroupBehavior,
	pub ScaleBehavior: GroupBehavior,
	pub RotateBehavior: GroupBehavior,
	pub SymmetryBehavior: GroupBehavior,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of TransformBehaviors_struct"]
		[::std::mem::size_of::<TransformBehaviors_struct>() - 16usize];
	["Alignment of TransformBehaviors_struct"]
		[::std::mem::align_of::<TransformBehaviors_struct>() - 4usize];
	["Offset of field: TransformBehaviors_struct::ShiftBehavior"]
		[::std::mem::offset_of!(TransformBehaviors_struct, ShiftBehavior) - 0usize];
	["Offset of field: TransformBehaviors_struct::ScaleBehavior"]
		[::std::mem::offset_of!(TransformBehaviors_struct, ScaleBehavior) - 4usize];
	["Offset of field: TransformBehaviors_struct::RotateBehavior"]
		[::std::mem::offset_of!(TransformBehaviors_struct, RotateBehavior) - 8usize];
	["Offset of field: TransformBehaviors_struct::SymmetryBehavior"]
		[::std::mem::offset_of!(TransformBehaviors_struct, SymmetryBehavior) - 12usize];
};
pub type TransformBehaviors = TransformBehaviors_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QRCodeDataToken_struct {
	pub mode: QRStreamMode,
	pub modeData: ::std::os::raw::c_uint,
	pub data: *mut ::std::os::raw::c_uchar,
	pub dataLength: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of QRCodeDataToken_struct"][::std::mem::size_of::<QRCodeDataToken_struct>() - 24usize];
	["Alignment of QRCodeDataToken_struct"]
		[::std::mem::align_of::<QRCodeDataToken_struct>() - 8usize];
	["Offset of field: QRCodeDataToken_struct::mode"]
		[::std::mem::offset_of!(QRCodeDataToken_struct, mode) - 0usize];
	["Offset of field: QRCodeDataToken_struct::modeData"]
		[::std::mem::offset_of!(QRCodeDataToken_struct, modeData) - 4usize];
	["Offset of field: QRCodeDataToken_struct::data"]
		[::std::mem::offset_of!(QRCodeDataToken_struct, data) - 8usize];
	["Offset of field: QRCodeDataToken_struct::dataLength"]
		[::std::mem::offset_of!(QRCodeDataToken_struct, dataLength) - 16usize];
};
pub type QRCodeDataToken = QRCodeDataToken_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParticleFilterOptions_struct {
	pub rejectMatches: ::std::os::raw::c_int,
	pub rejectBorder: ::std::os::raw::c_int,
	pub connectivity8: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ParticleFilterOptions_struct"]
		[::std::mem::size_of::<ParticleFilterOptions_struct>() - 12usize];
	["Alignment of ParticleFilterOptions_struct"]
		[::std::mem::align_of::<ParticleFilterOptions_struct>() - 4usize];
	["Offset of field: ParticleFilterOptions_struct::rejectMatches"]
		[::std::mem::offset_of!(ParticleFilterOptions_struct, rejectMatches) - 0usize];
	["Offset of field: ParticleFilterOptions_struct::rejectBorder"]
		[::std::mem::offset_of!(ParticleFilterOptions_struct, rejectBorder) - 4usize];
	["Offset of field: ParticleFilterOptions_struct::connectivity8"]
		[::std::mem::offset_of!(ParticleFilterOptions_struct, connectivity8) - 8usize];
};
pub type ParticleFilterOptions = ParticleFilterOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StraightEdgeReport2_struct {
	pub straightEdges: *mut StraightEdge,
	pub numStraightEdges: ::std::os::raw::c_uint,
	pub searchLines: *mut SearchLineInfo,
	pub numSearchLines: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StraightEdgeReport2_struct"]
		[::std::mem::size_of::<StraightEdgeReport2_struct>() - 32usize];
	["Alignment of StraightEdgeReport2_struct"]
		[::std::mem::align_of::<StraightEdgeReport2_struct>() - 8usize];
	["Offset of field: StraightEdgeReport2_struct::straightEdges"]
		[::std::mem::offset_of!(StraightEdgeReport2_struct, straightEdges) - 0usize];
	["Offset of field: StraightEdgeReport2_struct::numStraightEdges"]
		[::std::mem::offset_of!(StraightEdgeReport2_struct, numStraightEdges) - 8usize];
	["Offset of field: StraightEdgeReport2_struct::searchLines"]
		[::std::mem::offset_of!(StraightEdgeReport2_struct, searchLines) - 16usize];
	["Offset of field: StraightEdgeReport2_struct::numSearchLines"]
		[::std::mem::offset_of!(StraightEdgeReport2_struct, numSearchLines) - 24usize];
};
pub type StraightEdgeReport2 = StraightEdgeReport2_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StraightEdgeOptions_struct {
	pub numLines: ::std::os::raw::c_uint,
	pub searchMode: StraightEdgeSearchMode,
	pub minScore: f64,
	pub maxScore: f64,
	pub orientation: f64,
	pub angleRange: f64,
	pub angleTolerance: f64,
	pub stepSize: ::std::os::raw::c_uint,
	pub minSignalToNoiseRatio: f64,
	pub minCoverage: f64,
	pub houghIterations: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of StraightEdgeOptions_struct"]
		[::std::mem::size_of::<StraightEdgeOptions_struct>() - 80usize];
	["Alignment of StraightEdgeOptions_struct"]
		[::std::mem::align_of::<StraightEdgeOptions_struct>() - 8usize];
	["Offset of field: StraightEdgeOptions_struct::numLines"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, numLines) - 0usize];
	["Offset of field: StraightEdgeOptions_struct::searchMode"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, searchMode) - 4usize];
	["Offset of field: StraightEdgeOptions_struct::minScore"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, minScore) - 8usize];
	["Offset of field: StraightEdgeOptions_struct::maxScore"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, maxScore) - 16usize];
	["Offset of field: StraightEdgeOptions_struct::orientation"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, orientation) - 24usize];
	["Offset of field: StraightEdgeOptions_struct::angleRange"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, angleRange) - 32usize];
	["Offset of field: StraightEdgeOptions_struct::angleTolerance"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, angleTolerance) - 40usize];
	["Offset of field: StraightEdgeOptions_struct::stepSize"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, stepSize) - 48usize];
	["Offset of field: StraightEdgeOptions_struct::minSignalToNoiseRatio"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, minSignalToNoiseRatio) - 56usize];
	["Offset of field: StraightEdgeOptions_struct::minCoverage"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, minCoverage) - 64usize];
	["Offset of field: StraightEdgeOptions_struct::houghIterations"]
		[::std::mem::offset_of!(StraightEdgeOptions_struct, houghIterations) - 72usize];
};
pub type StraightEdgeOptions = StraightEdgeOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QRCodeSearchOptions_struct {
	pub rotationMode: QRRotationMode,
	pub skipLocation: ::std::os::raw::c_uint,
	pub edgeThreshold: ::std::os::raw::c_uint,
	pub demodulationMode: QRDemodulationMode,
	pub cellSampleSize: QRCellSampleSize,
	pub cellFilterMode: QRCellFilterMode,
	pub skewDegreesAllowed: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of QRCodeSearchOptions_struct"]
		[::std::mem::size_of::<QRCodeSearchOptions_struct>() - 28usize];
	["Alignment of QRCodeSearchOptions_struct"]
		[::std::mem::align_of::<QRCodeSearchOptions_struct>() - 4usize];
	["Offset of field: QRCodeSearchOptions_struct::rotationMode"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, rotationMode) - 0usize];
	["Offset of field: QRCodeSearchOptions_struct::skipLocation"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, skipLocation) - 4usize];
	["Offset of field: QRCodeSearchOptions_struct::edgeThreshold"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, edgeThreshold) - 8usize];
	["Offset of field: QRCodeSearchOptions_struct::demodulationMode"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, demodulationMode) - 12usize];
	["Offset of field: QRCodeSearchOptions_struct::cellSampleSize"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, cellSampleSize) - 16usize];
	["Offset of field: QRCodeSearchOptions_struct::cellFilterMode"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, cellFilterMode) - 20usize];
	["Offset of field: QRCodeSearchOptions_struct::skewDegreesAllowed"]
		[::std::mem::offset_of!(QRCodeSearchOptions_struct, skewDegreesAllowed) - 24usize];
};
pub type QRCodeSearchOptions = QRCodeSearchOptions_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QRCodeSizeOptions_struct {
	pub minSize: ::std::os::raw::c_uint,
	pub maxSize: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of QRCodeSizeOptions_struct"]
		[::std::mem::size_of::<QRCodeSizeOptions_struct>() - 8usize];
	["Alignment of QRCodeSizeOptions_struct"]
		[::std::mem::align_of::<QRCodeSizeOptions_struct>() - 4usize];
	["Offset of field: QRCodeSizeOptions_struct::minSize"]
